Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Select the quadrilateral that has to be transformed onto a given quadrilateral...
ar: اختر الشكل الرباعي الذي يجب تحويله إلى شكل رباعي معطى...
de: Wählen Sie das Viereck, das Sie auf ein gegebenes Viereck transformieren möchten ...
ja: 射影変換を決定する四角形の、変換元の四角形を選択...
nl: Selecteer de vierhoek die moet worden getransformeerd naar een gegeven vierhoek...

source: onto this other quadrilateral
ar: إلى هذا الشكل الرباعي الآخر
de: auf dieses andere Viereck
ja: この別の四角形上に
nl: op deze ander vierhoek

source: Select the quadrilateral that is the image by the projective transformation of the first quadrilateral...
ar: اختر الشكل الرباعي الذي يمثل صورة الشكل الرباعي الأول بالتحويل الإسقاطي...
de: Wählen Sie das Viereck, das das Bild einer projektiven Transformation des ersten Vierecks ist ...
ja: 射影変換を決定する四角形の、写像となる四角形を選択...
nl: Selecteer de vierhoek die de afbeelding is van de eerste vierhoek na de projectieve transformatie...

source: First of 4 starting points
ar: النقطة الأولى من 4 نقاط بداية
de: Der erste von vier Startpunkten
ja: 4 つの始点の 1 番目
nl: Eerste van 4 beginpunten

source: Select the first of the four starting points of the generic projectivity...
ar: اختر النقطة الأولى من نقاط البداية الأربع للإسقاط العام...
de: Wählen Sie den ersten der vier Startpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 1 番目の、変換前の位置を選択...
nl: Selecteer het eerste van de vier beginpunten van de algemene projectieve afbeelding...

source: Second of 4 starting points
ar: النقطة الثانية من 4 نقاط بداية
de: Der zweite von vier Startpunkten
ja: 4 つの始点の 2 番目
nl: Tweede van 4 beginpunten

source: Select the second of the four starting points of the generic projectivity...
ar: اختر النقطة الثانية من نقاط البداية الأربع للإسقاط العام...
de: Wählen Sie den zweiten der vier Startpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 2 番目の、変換前の位置を選択...
nl: Selecteer het tweede van de vier beginpunten van de algemene projectieve afbeelding...

source: Third of 4 starting points
ar: النقطة الثالثة من 4 نقاط بداية
de: Der dritte von vier Startpunkten
ja: 4 つの始点の 3 番目
nl: Derde van 4 beginpunten

source: Select the third of the four starting points of the generic projectivity...
ar: اختر النقطة الثالثة من نقاط البداية الأربع للإسقاط العام...
de: Wählen Sie den dritten der vier Startpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 3 番目の、変換前の位置を選択...
nl: Selecteer het derde van de vier beginpunten van de algemene projectieve afbeelding...

source: Fourth of 4 starting points
ar: النقطة الرابعة من 4 نقاط بداية
de: Der vierte von vier Startpunkten
ja: 4 つの始点の 4 番目
nl: Vierde van 4 beginpunten

source: Select the fourth of the four starting points of the generic projectivity...
ar: اختر النقطة الرابعة من نقاط البداية الأربع للإسقاط العام...
de: Wählen Sie den vierten der vier Startpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 4 番目の、変換前の位置を選択...
nl: Selecteer het vierde van de vier beginpunten van de algemene projectieve afbeelding...

source: Select the first of the four end points of the generic projectivity...
ar: اختر النقطة الأولى من نقاط النهاية الأربع للإسقاط العام...
de: Wählen Sie den ersten der vier Endpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 1 番目の、写像の位置を選択...
nl: Selecteer het eerste van de vier getransformeerde punten van de algemene projectieve afbeelding...

source: Select the second of the four end points of the generic projectivity...
ar: اختر النقطة الثانية من نقاط النهاية الأربع للإسقاط العام...
de: Wählen Sie den zweiten der vier Endpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 2 番目の、写像の位置を選択...
nl: Selecteer het tweede van de vier getransformeerde punten van de algemene projectieve afbeelding...

source: Select the third of the four end points of the generic projectivity...
ar: اختر النقطة الثالثة من نقاط النهاية الأربع للإسقاط العام...
de: Wählen Sie den dritten der vier Endpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 3 番目の、写像の位置を選択...
nl: Selecteer het derde van de vier getransformeerde punten van de algemene projectieve afbeelding...

source: Transformed position of fourth point
ar: الموضع المحوّل للنقطة الرابعة
de: Transformierte Position des vierten Punktes
ja: 4 番目の点の移される位置
nl: Getransformeerde positie van het vierde punt

source: Select the fourth of the four end points of the generic projectivity...
ar: اختر النقطة الرابعة من نقاط النهاية الأربع للإسقاط العام...
de: Wählen Sie den vierten der vier Endpunkte für die generische Projektivität ...
ja: 射影変換を決定する 4 点のうち 4 番目の、写像の位置を選択...
nl: Selecteer het vierde van de vier getransformeerde punten van de algemene projectieve afbeelding...

source: Cast the shadow of this object
ar: ألقِ بظل هذا الكائن
de: Einen Schatten dieses Objektes werfen
ja: このオブジェクトに影付けをする
nl: Teken de schaduw van dit object

source: Select the object of which you want to construct the shadow...
ar: اختر الكائن الذي تريد إنشاء ظله...
de: Wählen Sie das Objekt, dessen Schatten Sie konstruieren möchten ...
ja: 影を作成するオブジェクトを選択...
nl: Selecteer het object waarvan de schaduw moet worden getekend...

source: Cast a shadow from this light source
ar: ألقِ بظل من مصدر الضوء هذا
de: Einen Schatten von dieser Lichtquelle aus werfen
ja: この光源からの影付けをする
nl: Teken een schaduw vanuit deze lichtbron

source: Select the light source from which the shadow should originate...
ar: اختر مصدر الضوء الذي يجب أن ينبع منه الظل...
de: Wählen Sie die Lichtquelle, von der der Schatten ausgehen soll ...
ja: 影の元となる光源を選択...
nl: Selecteer de lichtbron voor de schaduw...

source: Cast a shadow on the horizon represented by this line
ar: ألقِ بظل على الأفق الممثل بهذا الخط
de: Einen Schatten auf den Horizont werfen, der durch diese Gerade bestimmt wird
ja: この直線によって表される水平軸に影付けをする
nl: Teken de schaduw op de horizon voorgesteld door deze rechte lijn

source: Select the horizon for the shadow...
ar: اختر الأفق للظل...
de: Wählen Sie den Horizont für den Schatten ...
ja: 影の水平軸を選択...
nl: Selecteer de horizon waarop de schaduw wordt geprojecteerd...

source: Transform this object
ar: حوّل هذا الكائن
de: Dieses Objekt transformieren
ja: このオブジェクトを変換
nl: Transformeer dit object

source: Transform using this transformation
ar: حوّل باستخدام هذا التحويل
de: Mittels dieser Transformation transformieren
ja: この変換を使って変換する
nl: Pas deze transformatie toe

source: Apply a similitude to this object
ar: طبّق تشابهًا على هذا الكائن
de: Ähnlichkeit auf dieses Objekt anwenden
ja: このオブジェクトを相似変換
nl: Pas een gelijkvormigheidstransformatie toe op dit object

source: Apply a similitude with this center
ar: طبّق تشابهًا بهذا المركز
de: Ähnlichkeit mit diesem Mittelpunkt anwenden
ja: ここを中心に相似変換
nl: Gelijkvormigheidstransformatie vanuit dit punt

source: Select the center for the similitude...
ar: اختر مركز التشابه...
de: Wählen Sie den Mittelpunkt für die Ähnlichkeit ...
ja: 相似変換の中心を選択...
nl: Selecteer het uitgangspunt voor de gelijkvormigheidstransformatie...

source: Apply a similitude mapping this point onto another point
ar: طبّق تشابهًا يربط هذه النقطة بنقطة أخرى
de: Eine Ähnlichkeitsabbildung von diesem Punkt auf einen anderen anwenden
ja: この点が他のある点へ移るような相似変換
nl: Beeld dit punt af op een ander punt met behulp van een gelijkvormigheidstransformatie

source: Select the point which the similitude should map onto another point...
ar: اختر النقطة التي يجب أن يربطها التشابه بنقطة أخرى...
de: Wählen Sie den Punkt, der mit der Ähnlichkeit auf einen anderen Punkt abgebildet werden soll ...
ja: 相似変換を決定する点の、変換元の位置を選択...
nl: Selecteer het punt dat door de gelijkvormigheidstransformatie moet worden afgebeeld op een ander punt...

source: Apply a similitude mapping a point onto this point
ar: طبّق تشابهًا يربط نقطة بهذه النقطة
de: Eine Ähnlichkeitsabbildung eines Punkte auf diesen Punkt anwenden
ja: 最初の点がこの点へ移るような相似変換
nl: Pas een gelijkvormigheidstransformatie toe die een punt op dit punt afbeeldt

source: Select the point onto which the similitude should map the first point...
ar: اختر النقطة التي يجب أن يربطها التشابه بالنقطة الأولى...
de: Wählen Sie den Punkt, auf den die Ähnlichkeit abbilden soll ...
ja: 相似変換を決定する点の、写像の位置を選択...
nl: Selecteer het punt waarop de gelijkvormigheidstransformatie het eerste punt moet afbeelden...

source: Construct a vector from this point
ar: أنشئ متجهًا من هذه النقطة
de: Einen Vektor von diesem Punkt aus konstruieren
ja: この点からのベクトルを作成
nl: Teken een vector vanuit dit punt

source: Select the start point of the new vector...
ar: اختر نقطة بداية المتجه الجديد...
de: Wählen Sie den Startpunkt für den neuen Vektor ...
ja: 新しいベクトルの始点を選択...
nl: Selecteer het beginpunt van de nieuwe vector...

source: Construct a vector to this point
ar: أنشئ متجهًا إلى هذه النقطة
de: Einen Vektor zu diesem Punkt konstruieren
ja: この点へのベクトルを作成
nl: Teken een vector naar dit punt

source: Select the end point of the new vector...
ar: اختر نقطة نهاية المتجه الجديد...
de: Wählen Sie den Endpunkt für den neuen Vektor ...
ja: 新しいベクトルの終点を選択...
nl: Selecteer het eindpunt van de nieuwe vector...

source: Construct the vector sum of this vector and another one.
ar: أنشئ المجموع الاتجاهي لهذا المتجه وآخر.
de: Konstruiert die Vektorsumme dieses Vektors und eines anderen.
ja: このベクトルと他のベクトルとの和ベクトルを作成します。
nl: Teken de somvector van deze en een andere vector.

source: Select the first of the two vectors of which you want to construct the sum...
ar: اختر المتجه الأول من المتجهين اللذين تريد إنشاء مجموعهما...
de: Wählen Sie den ersten der zwei Vektoren, von denen Sie die Summe konstruieren möchten ...
ja: 和ベクトルを作成する 2 つのベクトルの 1 番目のベクトルを選択...
nl: Selecteer de eerste van de twee vectoren waarvan u de somvector wilt tekenen...

source: Construct the vector sum of this vector and the other one.
ar: أنشئ المجموع الاتجاهي لهذا المتجه والمتجه الآخر.
de: Konstruiert die Summe dieses Vektors und eines anderen.
ja: このベクトルともう 1 つのベクトルの和をとります。
nl: Teken de somvector van deze en de andere vector.

source: Select the other of the two vectors of which you want to construct the sum...
ar: اختر المتجه الآخر من المتجهين اللذين تريد إنشاء مجموعهما...
de: Wählen Sie den zweiten der beiden Vektoren, deren Summe Sie konstruieren möchten ...
ja: 和ベクトルを作成する 2 つのベクトルの 2 番目のベクトルを選択...
nl: Selecteer de tweede van de twee vectoren waarvan u de somvector wilt tekenen...

source: Construct the vector sum starting at this point.
ar: أنشئ المجموع الاتجاهي بدءًا من هذه النقطة.
de: Konstruiert die Vektorsumme mit diesem Startpunkt
ja: この点を始点として和ベクトルを作成します。
nl: Teken de somvector vanuit dit punt.

source: Select the point to construct the sum vector in...
ar: اختر النقطة التي تريد إنشاء متجه المجموع عندها...
de: Wählen Sie den Punkt, in dem der Summenvektor konstruiert wird ...
ja: ベクトルの和を作成する点を選択...
nl: Selecteer het beginpunt van de somvector...

# @title:window
source: New Script
ar: برنامج نصي جديد
de: Neues Skript
nl: Nieuwe script

source: Select the argument objects (if any) in the Kig window and press "Next".
ar: اختر كائنات الوسائط (إن وجدت) في نافذة كيج واضغط "التالي".
de: Wählen Sie die Argument-Objekte (falls vorhanden) im Kig-Fenster und drücken Sie „Weiter“.
ja: 引数として使用するオブジェクトがあれば、Kig ウィンドウでそれを選んでから「次」を押してください。
nl: Selecteer de argumentobjecten (indien aanwezig) in het Kig-venster en klik op "Volgende".

source: Enter Code
ar: أدخل الرمز
de: Code eingeben
ja: コードを入力
nl: Programmacode invoeren

source: Now fill in the code:
ar: الآن املأ الرمز:
de: Nun geben Sie den Code ein:
ja: コードを入力:
nl: Voer nu de code in:

source: Now fill in the Python code:
ar: الآن املأ رمز بايثون:
de: Nun geben Sie den Python-Code ein:
ja: Python のコードを入力:
nl: Vul nu de Python-code in:

source: arg%1
ar: وسيط%1

source: The Python interpreter caught an error during the execution of your script. Please fix the script and click the Finish button again.
ar: اكتشف مفسّر بايثون خطأً أثناء تنفيذ برنامجك النصي. الرجاء إصلاح البرنامج النصي واضغط زر الإنهاء مرة أخرى.
de: Der Python-Interpreter hat während der Ausführung Ihres Skriptes einen Fehler festgestellt. Bitte reparieren Sie es und drücken Sie erneut auf den Knopf „Fertigstellen“.
ja: スクリプト実行中に Python インタプリタがエラーを出しました。スクリプトを修正して再度「完了」ボタンを押してください。
nl: Uw Pythonscript bevat blijkbaar een fout. Verbeter de script en druk opnieuw op Voltooien.

source: The Python Interpreter generated the following error output: %1
ar: ولّد مفسّر بايثون مخرجات الخطأ التالية: %1
de: Der Python-Interpreter erzeugte folgende Fehlerausgabe: %1
ja: Python インタプリタが以下のエラー出力を生成しました: %1
nl: De Python-interpreter (vertaalprogramma) gaf de volgende foutmelding: %1

source: There seems to be an error in your script. The Python interpreter reported no errors, but the script does not generate a valid object. Please fix the script, and click the Finish button again.
ar: يبدو أن هناك خطأ في برنامجك النصي. لم يبلّغ مفسّر بايثون عن أي أخطاء، ولكن البرنامج النصي لم يولد كائنًا صحيحًا. الرجاء إصلاح البرنامج النصي، واضغط زر الإنهاء مرة أخرى.
de: Ihr Skript scheint einen Fehler zu enthalten. Der Python-Interpreter hat keinen Fehler entdeckt, aber Ihr Skript erzeugt kein gültiges Objekt. Bitte reparieren Sie das Skript und drücken Sie erneut auf den Knopf „Fertigstellen“.
ja: スクリプト中にエラーがあるようです。Python インタプリタはエラーを報告していませんが、スクリプトは正しいオブジェクトを作成しません。スクリプトを修正して再度「完了」ボタンを押してください。
nl: Uw script bevat blijkbaar een fout. De Python-interpreter (vertaalprogramma) meldt geen fouten, maar de script resulteert niet in een geldig object. Verbeter de script en druk opnieuw op Voltooien.

# @title:window 'Edit' is a verb
source: Edit Script
ar: حرّر السكربت
de: Skript bearbeiten
nl: Script bewerken

source: Edit Python Script
ar: حرّر برنامج بايثون النصي
de: Python-Skript bearbeiten
ja: Python スクリプトを編集
nl: Pythonscript bewerken

source: The Python interpreter caught an error during the execution of your script. Please fix the script.
ar: اكتشف مفسّر بايثون خطأ أثناء تنفيذ برنامجك النصي. الرجاء إصلاح البرنامج النصي.
de: Der Python-Interpreter fand einen Fehler während der Ausführung Ihres Skriptes. Bitte korrigieren Sie das Skript.
ja: スクリプト実行中に Python インタプリタがエラーを出しました。スクリプトを修正してください。
nl: De Python-interpreter (vertaalprogramma) kwam een fout tegen bij het uitvoeren van uw script. U dient de script te verbeteren.

source: There seems to be an error in your script. The Python interpreter reported no errors, but the script does not generate a valid object. Please fix the script.
ar: يبدو أن هناك خطأ في برنامجك النصي. لم يبلّغ مفسّر بايثون عن أي أخطاء، ولكن البرنامج النصي لم يولد كائنًا صحيحًا. الرجاء إصلاح البرنامج النصي.
de: Ihr Skript scheint einen Fehler zu enthalten. Der Python-Interpreter hat keinen Fehler entdeckt, aber Ihr Skript erzeugt kein gültiges Objekt. Bitte reparieren Sie das Skript.
ja: スクリプト中にエラーがあるようです。Python インタプリタはエラーを報告していませんが、スクリプトは正しいオブジェクトを作成しません。スクリプトを修正してください。
nl: Uw script bevat blijkbaar een fout. De Python-interpreter (vertaalprogramma) meldt geen fouten, maar de script resulteert niet in een geldig object. U dient de script te verbeteren.

source: Possibly trascendental curve
de: Möglicherweise transzendente Kurve

source: <p>You can control a kig construction by means of a "pykig" python script, that can be executed with the command <code>pykig.py</code>. Here is a nice example (<code>hexagons.kpy</code>) you can try: <code><pre> kigdocument.hideobjects() def hexagons (c, v, n): hexagon = PolygonBCV (c, v, 6) if n &lt;= 0: hexagon.show() for i in range(6): PolygonSide (hexagon, i, True) return cnew = MidPoints (c, v) hexagons (cnew, v, n-1) for k in [2,4]: v1 = PolygonVertex (hexagon, k) cnew = MidPoints (c, v1) hexagons (cnew, v1, n-1) hexagons (Point(0,0), Point(1,0), 5) </pre></code>
de: <p>Sie können eine Kig-Zeichnung mit Hilfe eines „pykig“-Python-Skriptes steuern, das Sie mit dem Programm <code>pykig.py</code> starten können. Hier ist ein schönes Beispiel (<code>hexagons.kpy</code>), das Sie ausprobieren können: <code><pre> kigdocument.hideobjects() def hexagons (c, v, n): hexagon = PolygonBCV (c, v, 6) if n &lt;= 0: hexagon.show() for i in range(6): PolygonSide (hexagon, i, True) return cnew = MidPoints (c, v) hexagons (cnew, v, n-1) for k in [2,4]: v1 = PolygonVertex (hexagon, k) cnew = MidPoints (c, v1) hexagons (cnew, v1, n-1) hexagons (Point(0,0), Point(1,0), 5) </pre></code>
ja: <html><p align="left">“pykig” Python スクリプトを使って Kig の作成をコントロールすることができます。スクリプトは <code>pykig.py</code> コマンドで実行します。以下に良い例 (<code>hexagons.kpy</code>) があるので試してみてください。 <code><pre> kigdocument.hideobjects() def hexagons (c, v, n): hexagon = PolygonBCV (c, v, 6) if n &lt;= 0: hexagon.show() for i in range(6): PolygonSide (hexagon, i, True) return cnew = MidPoints (c, v) hexagons (cnew, v, n-1) for k in [2,4]: v1 = PolygonVertex (hexagon, k) cnew = MidPoints (c, v1) hexagons (cnew, v1, n-1) hexagons (Point(0,0), Point(1,0), 5) </pre></code></p></html>

source: <p>You can repeat the latest construction simply by pressing the key 'Z'; this comes in very handy if you need to construct a sequence of objects with the same construction, especially if there is no shortcut for that construction.</p>
de: <p>Sie können die letzte Konstruktion wiederholen, indem Sie die Taste „Z“ drücken. Das ist praktisch, wenn Sie eine Reihe von Objekten auf dieselbe Weise konstruieren möchten und es kein Tastaturkürzel dafür gibt.</p>
ja: <html><p align="left">“Z” を押すだけで最後の作成を繰り返すことができます。これは、同じ作成を使ってオブジェクトを続けて作成するときに便利です。特に、その作成にショートカットがない場合に役立ちます。</p></html>

source: <p>One of the most powerful tools in Kig are the menus that you can enter by right-clicking on an object, or on some empty space in the document. You can use them to give objects names, change their colors and line styles, and lots of other interesting things.</p>
de: <p>Eines der vielseitigsten Werkzeuge in Kig sind die Menüs, die Sie mit einem Rechtsklick auf ein Objekt oder auf freien Platz im Dokument öffnen können. Sie können den Objekten Namen geben, Ihre Farben und Linienstile ändern und viele andere interessante Dinge tun.</p>
ja: <html><p align="left">Kig の最も強力なツールの一つに、オブジェクト上または文書中の何もない領域を右クリックして呼び出せるメニュー群があります。それらを使って、オブジェクトに名前を付けたり、色、線スタイル、その他たくさんの興味深い事柄を変えられます。</p></html>

source: <p>You can construct new points without using the menu or the toolbar, simply clicking somewhere on the Kig document with the <em>middle mouse button</em>.</p>
de: <p>Sie können neue Punkte ohne das Menü oder die Werkzeugleiste erzeugen. Klicken Sie mit der <em>mittleren Maustaste</em> irgendwo auf das Kig-Dokument.</p>
ja: <html><p align="left">Kig 文書のどこかをマウスの中ボタンでクリックするだけで、メニューやツールバーを使わずに新しい点を作成できます。</p></html>

source: <p>Kig can open several file formats: its files (<code>.kig</code> files), <em>KGeo</em> files, <em>KSeg</em> files, and, partially, <em>Dr. Geo</em> and <em>Cabri&#8482;</em> files.</p>
de: <p>Kig kann verschiedene Dateiformate öffnen: Seine eigenen Dateien (<code>.kig</code>-Dateien), <em>KGeo</em>-Dateien, <em>KSeg</em>-Dateien, <em>Dr. Geo</em>-Dateien und <em>Cabri&#8482;</em>-Dateien.</p>
ja: <html><p align="left">Kig はいくつかのファイルフォーマットを開くことができます。自身のファイル (<code>.kig</code> ファイル)、KGeo のファイル、KSeg のファイル、そして部分的には Dr. Geo と Cabri&#8482; のファイルです。</p></html>

source: <p>Kig has more than 20 objects and 10 transformations with more than 80 constructions you can use in your documents: open the <em>Objects</em> menu to see them all.</p>
de: <p>Kig enthält mehr als 20 Objekte und 10 Transformationen mit mehr als 80 Konstruktionen, die Sie in Ihren Dokumenten benutzen können. Öffnen Sie das Menü <em>Objekte</em>, um alle zu sehen.</p>
ja: <html><p align="left">Kig には 20 種類以上のオブジェクトと 10 種類以上の変換があり、80 種類以上の作成を行うことができます。それらのすべてを見るには「オブジェクト」メニューを開いてください。</p></html>

source: <p>You can use the selected objects to start the construction of an object which requires the selected objects as arguments. For example, if you have two points selected, you can choose <em>Start->Circle by Three Points</em> from the popup menu to start constructing a circle by three points.</p>
de: <p>Sie können ausgewählte Objekte dazu benutzen, ein Objekt zu konstruieren, das diese gewählten Objekte als Argumente benötigt. Wenn Sie zum Beispiel zwei Punkte ausgewählt haben, können Sie <em>Start->Kreis durch drei Punkte</em> aus dem Aufklappmenü auswählen, um einen Kreis durch drei Punkte zu konstruieren.</p>
ja: <html><p align="left">引数としてオブジェクトの選択が求められるオブジェクトの作成を始めるときには、既に選択されているオブジェクトを引数として使うことができます。例えば 2 つの点が選択済みであれば、ポップアップメニューから「開始|3 点による円」を選んで、3 点による円の作成を始めることができます。</p></html>

source: <p>Kig can extends its object set using external macros. You can find some interesting macros on the Kig website: <a href="https://edu.kde.org/kig">https://edu.kde.org/kig</a>.</p>
de: <p>Kig kann seine Objekt mittels externen Makros erweitern. Sie können einige interessante Makros auf der Webseite von Kig finden: <a href="http://edu.kde.org/kig">https://edu.kde.org/kig</a>.</p>

source: <p>If you have more than one object under the mouse, and you want to select any of them, you can click with the <em>left mouse button</em>, while holding the <em>Shift</em> key, to get a list of the objects under the mouse cursor which you can then select from.</p>
de: <p>Wenn Sie mehr als ein Objekt unter dem Mauszeiger haben und Sie eines davon auswählen möchten, können Sie mit der <em>linken Maustaste</em> daraufklicken während Sie die <em>Umschalt-</em>Taste drücken, um eine Liste der Objekte unter dem Mauszeiger zu bekommen, aus der Sie eines auswählen können.</p>
ja: <html><p align="left">マウスの下に 2 つ以上の図形が重なっていて、そのうちの 1 つを選択するときは、Shift キーを押しながらマウスを左クリックすると、マウスカーソルの下にある図形のリストが表示され、そこから選ぶことができます。</p></html>

source: <p>When you construct a locus, you can click on it with the <em>right</em> mouse button and select <em>cartesian equation</em> to see its cartesian equation, whenever it is an algebraic curve of low degree.</p>
de: <p>Wenn Sie einen Ort konstruieren, können Sie mit einem Klick mit der <em>rechten</em> Maustaste und dem Auswählen von <em>kartesische Gleichung</em> die kartesische Gleichung anzeigen lassen, wann es sich auch immer um eine algebraische Kurve niedriger Ordnung handelt.</p>

source: &SVG...
ja: SVG(&S)...
