Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Support Circle
ar: الدائرة الداعمة
de: Hilfskreis
nl: Ondersteunende cirkel

source: angle
ar: الزاوية
de: Winkel
ja: 角
nl: hoek

source: Select this angle
ar: اختر هذه الزاوية
de: Diesen Winkel auswählen
ja: この角を選択
nl: Selecteer deze hoek

source: Select angle %1
ar: اختر الزاوية %1
de: Winkel %1 auswählen
ja: 角 %1 を選択
nl: Selecteer hoek %1

source: Remove an Angle
ar: أزل زاوية
de: Einen Winkel entfernen
ja: 角を削除
nl: Verwijder een hoek

source: Add an Angle
ar: أضف زاوية
de: Einen Winkel hinzufügen
ja: 角を追加
nl: Voeg een hoek toe

source: Move an Angle
ar: حرّك زاوية
de: Einen Winkel verschieben
ja: 角を移動
nl: Verplaats een hoek

source: Attach to this angle
ar: ارفق بهذه الزاوية
de: Zu diesem Winkel hinzufügen
ja: この角に付ける
nl: Teken op deze hoek

source: Show an Angle
ar: أظهر زاوية
de: Einen Winkel anzeigen
ja: 角を表示
nl: Toon een hoek

source: Hide an Angle
ar: أخفِ زاوية
de: Einen Winkel ausblenden
ja: 角を隠す
nl: Verberg een hoek

source: vector
ar: متجه
de: Vektor
ja: ベクトル

source: Select this vector
ar: اختر هذا المتجه
de: Diesen Vektor auswählen
ja: このベクトルを選択
nl: Selecteer deze vector

source: Select vector %1
ar: اختر المتجه %1
de: Vektor %1 auswählen
ja: ベクトル %1 を選択
nl: Selecteer vector %1

source: Remove a Vector
ar: أزل متجهًا
de: Einen Vektor entfernen
ja: ベクトルを削除
nl: Verwijder een vector

source: Add a Vector
ar: أضف متجهًا
de: Einen Vektor hinzufügen
ja: ベクトルを追加
nl: Voeg een vector toe

source: Move a Vector
ar: حرّك متجهًا
de: Einen Vektor verschieben
ja: ベクトルを移動
nl: Verplaats een vector

source: Attach to this vector
ar: ارفق بهذا المتجه
de: Zu diesem Vektor hinzufügen
ja: このベクトルに付ける
nl: Teken op deze vector

source: Show a Vector
ar: أظهر متجهًا
de: Einen Vektor anzeigen
ja: ベクトルを表示
nl: Toon een vector

source: Hide a Vector
ar: أخفِ متجهًا
de: Einen Vektor ausblenden
ja: ベクトルを隠す
nl: Verberg een vector

source: arc
ar: قوس
de: Kreisbogen
ja: 弧
nl: cirkelboog

source: Select this arc
ar: اختر هذا القوس
de: Diesen Kreisbogen auswählen
ja: この弧を選択
nl: Selecteer deze cirkelboog

source: Select arc %1
ar: اختر القوس %1
de: Kreisbogen %1 auswählen
ja: 弧 %1 を選択
nl: Selecteer cirkelboog %1

source: Remove an Arc
ar: أزل قوسًا
de: Einen Kreisbogen entfernen
ja: 弧を削除
nl: Verwijder een cirkelboog

source: Add an Arc
ar: أضف قوسًا
de: Einen Kreisbogen hinzufügen
ja: 弧を追加
nl: Voeg een cirkelboog toe

source: Move an Arc
ar: حرّك قوسًا
de: Einen Kreisbogen verschieben
ja: 弧を移動
nl: Verplaats een cirkelboog

source: Attach to this arc
ar: ارفق بهذا القوس
de: Zu diesem Kreisbogen hinzufügen
ja: この弧に付ける
nl: Teken op deze cirkelboog

source: Show an Arc
ar: أظهر قوسًا
de: Einen Kreisbogen anzeigen
ja: 弧を表示
nl: Toon een cirkelboog

source: Hide an Arc
ar: أخفِ قوسًا
de: Einen Kreisbogen ausblenden
ja: 弧を隠す
nl: Verberg een cirkelboog

source: Coordinate
ar: إحداثيّات
de: Koordinate
ja: 座標
nl: Coördinaat

source: X coordinate
ar: الإحداثي X
de: X-Koordinate
ja: X 座標
nl: X-coördinaat

source: Y coordinate
ar: الإحداثي Y
de: Y-Koordinate
ja: Y 座標
nl: Y-coördinaat

source: point
ar: نقطة
de: Punkt
ja: 点
nl: punt

source: Select this point
ar: اختر هذه النقطة
de: Diesen Punkt auswählen
ja: この点を選択
nl: Selecteer dit punt

source: Select point %1
ar: اختر النقطة %1
de: Punkt %1 auswählen
ja: 点 %1 を選択
nl: Selecteer punt %1

source: Remove a Point
ar: أزل نقطة
de: Einen Punkt entfernen
ja: 点を削除
nl: Verwijder een punt

source: Add a Point
ar: أضف نقطة
de: Einen Punkt hinzufügen
ja: 点を追加
nl: Voeg een punt toe

source: Move a Point
ar: حرّك نقطة
de: Einen Punkt verschieben
ja: 点を移動
nl: Verplaats een punt

source: Attach to this point
ar: ارفق بهذه النقطة
de: Diesem Punkt hinzufügen
ja: この点に付ける
nl: Teken in dit punt

source: Show a Point
ar: أظهر نقطة
de: Einen Punkt anzeigen
ja: 点を表示
nl: Toon een punt

source: Hide a Point
ar: أخفِ نقطة
de: Einen Punkt ausblenden
ja: 点を隠す
nl: Verberg een punt

source: Construct the midpoint of this point and another point
ar: أنشئ نقطة منتصف هذه النقطة ونقطة أخرى
de: Konstruiert den Mittelpunkt dieses Punktes und eines anderen
ja: この点ともう 1 つの点の中点を作成
nl: Teken het midden van dit punt en een ander punt

source: Select the first of the two points of which you want to construct the midpoint...
ar: اختر النقطة الأولى من النقطتين اللتين تريد إنشاء نقطة المنتصف لهما...
de: Wählen Sie den ersten der zwei Punkte, zwischen denen Sie den Mittelpunkt konstruieren möchten ...
ja: 中点を作成する 2 点の 1 番目の点を選択...
nl: Selecteer het eerste van de twee punten waarvan u het midden wilt tekenen...

source: Select the other of the two points of which you want to construct the midpoint...
ar: اختر النقطة الأخرى من النقطتين اللتين تريد إنشاء نقطة المنتصف لهما...
de: Wählen Sie den zweiten der Punkte, zwischen denen Sie den Mittelpunkt konstruieren möchten ...
ja: 中点を作成する 2 点の 2 番目の点を選択...
nl: Selecteer het tweede van de twee punten waarvan u het midden wilt tekenen...

source: Construct the golden ratio point of this point and another point
ar: أنشئ نقطة النسبة الذهبية لهذه النقطة ونقطة أخرى
de: Konstruiert den goldenen Schnitt dieses Punktes und eines anderen
nl: Teken de gulden snede van dit punt en een ander punt

source: Select the first of the two points of which you want to construct the golden ratio point...
ar: اختر النقطة الأولى من النقطتين اللتين تريد إنشاء نقطة النسبة الذهبية لهما...
de: Wählen Sie den ersten der zwei Punkte, zwischen denen Sie den goldenen Schnitt konstruieren möchten ...
nl: Selecteer het eerste van de twee punten waarvan u de gulden snede wilt tekenen...

source: Select the other of the two points of which you want to construct the golden ratio point...
ar: اختر النقطة الأخرى من النقطتين اللتين تريد إنشاء نقطة النسبة الذهبية لهما...
de: Wählen Sie den zweiten der Punkte, zwischen denen Sie den goldenen Schnitt konstruieren möchten ...
nl: Selecteer het tweede van de twee punten waarvan u de gulden snede wilt tekenen...

source: Set &Coordinate...
ar: اضبط الإ&حداثيات...
de: &Koordinaten ändern ...
ja: 座標を設定(&C)...
nl: &Coördinaat instellen...

source: Redefine
ar: أعِد التعريف
de: Neu festlegen
ja: 再定義
nl: Herdefiniëren

source: Set &Parameter...
ar: اضبط ال&معامل...
de: &Parameter wählen ...
ja: パラメータ設定(&P)...
nl: Stel &parameter in...

source: Set Coordinate
ar: اضبط الإحداثيات
de: Koordinate festlegen
ja: 座標を設定
nl: Coördinaat instellen

source: Enter the new coordinate.
ar: أدخل الإحداثيات الجديدة.
de: Geben Sie die neue Koordinate ein:
ja: 新しい座標を入力してください。
nl: Voer de nieuwe coördinaat in.

source: Set Point Parameter
ar: اضبط معامل النقطة
de: Punkt-Parameter festlegen
ja: 点のパラメータを設定
nl: Stel parameter van punt in

source: Choose the new parameter:
ar: اختر المعامل الجديد:
de: Wählen Sie den neuen Parameter:
ja: 新しいパラメータを入力:
nl: Voer de nieuwe parameter in:

source: Change Parameter of Constrained Point
ar: غيّر معامل النقطة المقيّدة
de: Die Parameter eines erzwungenen Punktes verändern
ja: 従属点のパラメータを変更
nl: Verander Parameter van een gedwongen Punt

source: Select the circle on which to transport a measure...
ar: اختر الدائرة التي ستنقل عليها القياس...
de: Wählen Sie den Kreis, auf den Sie ein Maß transportieren möchten ...
ja: 長さを移す円を選択...
nl: Selecteer de cirkel waarop moet worden afgepast...

source: Select a point on the circle...
ar: اختر نقطة على الدائرة...
de: Wählen Sie einen Punkt auf dem Kreis ...
ja: 円周上の点を選択...
nl: Selecteer een punt op de cirkel...

source: Select the segment to transport on the circle...
ar: اختر القطعة المستقيمة لنقلها على الدائرة...
de: Wählen Sie die Strecke, die auf den Kreis transportiert werden soll ...
ja: 円周上に移す線分を選択...
nl: Selecteer het lijnstuk dat op de cirkel moet worden afgepast...

source: Select a number/length as x coordinate of the point...
ar: اختر عددًا/طولًا كإحداثي سيني للنقطة...
de: Wählen Sie eine Zahl/Länge als x-Koordinate des Punktes ...
ja: 点の x 座標となる数/長さを選択...
nl: Selecteer een getal/lengte voor de x-coördinaat van het punt...

source: Select a number/length as y coordinate of the point...
ar: اختر عددًا/طولًا كإحداثي صادي للنقطة...
de: Wählen Sie eine Zahl/Länge als y-Koordinate des Punktes ...
ja: 点の y 座標となる数/長さを選択...
nl: Selecteer een getal/lengte voor de y-coördinaat van het punt...

source: Select a point to project onto a line...
ar: اختر نقطة لإسقاطها على خط...
de: Wählen Sie einen Punkt, der auf eine Linie projiziert werden soll ...
nl: Selecteer een punt voor projectie op een lijnstuk...

source: Line where the projected point will lie...
ar: الخط الذي ستقع عليه النقطة المسقطة...
de: Linie, auf der der projizierte Punkt liegen wird ...
nl: Lijnstuk waarop het geprojecteerde punt moet liggen...

source: Number of sides
ar: عدد الأضلاع
de: Anzahl der Seiten
ja: 辺の数
nl: Aantal zijden

source: Perimeter
ar: محيط
de: Umfang
ja: 周の長さ
nl: Omtrek

source: Boundary Polygonal
ar: مضلع حدودي
de: Geschlossene Polylinie auf den Kanten
nl: Begrenzende veelhoek

source: Open Boundary Polygonal
ar: مضلع حدودي مفتوح
de: Offene Polylinie auf den Kanten
nl: Open begrenzende veelhoek

source: Center of Mass of the Vertices
ar: مركز كتلة الرؤوس
de: Schwerpunkt
ja: 頂点の重心
nl: Zwaartepunt van de hoekpunten

source: Winding Number
ar: عدد اللفات
de: Umwindungsanzahl
ja: 巻数
nl: Windingsgetal

source: Inside Polygon
ar: داخل المضلع
de: Innerhalb des Polygons
nl: Inwendige veelhoek

source: Open Polygonal Curve
ar: منحنى مضلع مفتوح
de: Offene Polylinie
nl: Open veelhoekige kromme

source: Associated Polygon
ar: المضلع المرتبط
de: zugehöriges Polygon
nl: Bijbehorende veelhoek

source: Closed Polygonal Curve
ar: منحنى مضلع مغلق
de: Geschlossene Polylinie
nl: Gesloten veelhoekige kromme

source: polygon
ar: مضلع
ja: 多角形
nl: veelhoek

source: Select this polygon
ar: اختر هذا المضلع
de: Dieses Polygon auswählen
ja: この多角形を選択
nl: Selecteer deze veelhoek

source: Select polygon %1
ar: اختر المضلع %1
de: Polygon %1 auswählen
ja: 多角形 %1 を選択
nl: Selecteer veelhoek %1

source: Remove a Polygon
ar: أزل مضلعًا
de: Ein Polygon entfernen
ja: 多角形を削除
nl: Verwijder een veelhoek

source: Add a Polygon
ar: أضف مضلعًا
de: Ein Polygon hinzufügen
ja: 多角形を追加
nl: Voeg een veelhoek toe

source: Move a Polygon
ar: حرّك مضلعًا
de: Ein Polygon verschieben
ja: 多角形を移動
nl: Verplaats een veelhoek

source: Attach to this polygon
ar: ارفق بهذا المضلع
de: An dieses Polygon anfügen
ja: この多角形に付ける
nl: Teken op deze veelhoek

source: Show a Polygon
ar: أظهر مضلعًا
de: Ein Polygon anzeigen
ja: 多角形を表示
nl: Toon een veelhoek

source: Hide a Polygon
ar: أخفِ مضلعًا
de: Ein Polygon ausblenden
ja: 多角形を隠す
nl: Verberg een veelhoek

source: closed polygonal curve
ar: منحنى مضلع مغلق
de: Geschlossene Polylinie
nl: gesloten veelhoekige kromme

source: Select this closed polygonal curve
ar: اختر هذا المنحنى المضلع المغلق
de: Diese geschlossene Polylinie auswählen
nl: Selecteer deze gesloten veelhoekige kromme

source: Select closed polygonal curve %1
ar: اختر المنحنى المضلع المغلق %1
de: Geschlossene Polylinie %1 auswählen
nl: Selecteer gesloten veelhoekige kromme %1

source: Remove a closed polygonal curve
ar: أزل منحنى مضلع مغلق
de: Eine geschlossene Polylinie entfernen
nl: Verwijder een gesloten veelhoekige kromme

source: Add a closed polygonal curve
ar: أضف منحنى مضلع مغلق
de: Eine geschlossene Polylinie hinzufügen
nl: Voeg een gesloten veelhoekige kromme toe

source: Move a closed polygonal curve
ar: حرّك منحنى مضلع مغلق
de: Eine geschlossene Polylinie verschieben
nl: Verplaats een gesloten veelhoekige kromme

source: Attach to this closed polygonal curve
ar: ارفق بهذا المنحنى المضلع المغلق
de: An diese geschlossene Polylinie anfügen
nl: Maak vast aan deze gesloten veelhoekige kromme

source: Show a closed polygonal curve
ar: أظهر منحنى مضلع مغلق
de: Eine geschlossene Polylinie anzeigen
nl: Toon een gesloten veelhoekige kromme

source: Hide a closed polygonal curve
ar: أخفِ منحنى مضلع مغلق
de: Eine geschlossene Polylinie ausblenden
nl: Verberg een gesloten veelhoekige kromme

source: polygonal curve
ar: منحنى مضلع
de: Polylinie
nl: veelhoekige kromme

source: Select this polygonal curve
ar: اختر هذا المنحنى المضلع
de: Diese Polylinie auswählen
nl: Selecteer deze veelhoekige kromme

source: Select polygonal curve %1
ar: اختر المنحنى المضلع %1
de: Polylinie %1 auswählen
nl: Selecteer veelhoekige kromme %1

source: Remove a polygonal curve
ar: أزل منحنى مضلع
de: Eine Polylinie entfernen
nl: Verwijder een veelhoekige kromme

source: Add a polygonal curve
ar: أضف منحنى مضلع
de: Eine Polylinie hinzufügen
nl: Voeg een veelhoekige kromme toe

source: Move a polygonal curve
ar: حرّك منحنى مضلع
de: Eine Polylinie verschieben
nl: Verplaats een veelhoekige kromme

source: Attach to this polygonal curve
ar: ارفق بهذا المنحنى المضلع
de: An diese Polylinie anfügen
nl: Teken op deze veelhoekige kromme

source: Show a polygonal curve
ar: أظهر منحنى مضلع
de: Eine Polylinie anzeigen
nl: Toon een veelhoekige kromme

source: Hide a polygonal curve
ar: أخفِ منحنى مضلع
de: Eine Polylinie ausblenden
nl: Verberg een veelhoekige kromme

source: triangle
ar: مثلّث
de: Dreieck
ja: 三角形
nl: driehoek

source: Select this triangle
ar: اختر هذا المثلث
de: Dieses Dreieick auswählen
ja: 三角形を選択
nl: Selecteer deze driehoek

source: Select triangle %1
ar: اختر المثلث %1
de: Dreieck %1 auswählen
ja: 三角形 %1 を選択
nl: Selecteer driehoek %1

source: Remove a Triangle
ar: أزل مثلثًا
de: Ein Dreieck entfernen
ja: 三角形を削除
nl: Verwijder een driehoek

source: Add a Triangle
ar: أضف مثلثًا
de: Ein Dreieck hinzufügen
ja: 三角形を追加
nl: Voeg een driehoek toe

source: Move a Triangle
ar: حرّك مثلثًا
de: Ein Dreieck verschieben
ja: 三角形を移動
nl: Verplaats een driehoek

source: Attach to this triangle
ar: ارفق بهذا المثلث
de: An dieses Dreieck anfügen
ja: この三角形に付ける
nl: Teken op deze driehoek

source: Show a Triangle
ar: أظهر مثلثًا
de: Ein Dreieck anzeigen
ja: 三角形を表示
nl: Toon een driehoek

source: Hide a Triangle
ar: أخفِ مثلثًا
de: Ein Dreieck ausblenden
ja: 三角形を隠す
nl: Verberg een driehoek

source: quadrilateral
ar: رباعي الأضلاع
de: Viereck
ja: 四角形
nl: vierhoek

source: Select this quadrilateral
ar: اختر هذا الشكل الرباعي
de: Dieses Viereck auswählen
ja: この四角形を選択
nl: Selecteer deze vierhoek

source: Select quadrilateral %1
ar: اختر الشكل الرباعي %1
de: Viereck %1 auswählen
ja: 四角形 %1 を選択
nl: Selecteer vierhoek %1

source: Remove a Quadrilateral
ar: أزل شكلًا رباعيًا
de: Ein Viereck entfernen
ja: 四角形を削除
nl: Verwijder een vierhoek

source: Add a Quadrilateral
ar: أضف شكلًا رباعيًا
de: Ein Viereck hinzufügen
ja: 四角形を追加
nl: Voeg een vierhoek toe

source: Move a Quadrilateral
ar: حرّك شكلًا رباعيًا
de: Ein Viereck verschieben
ja: 四角形を移動
nl: Verplaats een vierhoek

source: Attach to this quadrilateral
ar: ارفق بهذا الشكل الرباعي
de: An dieses Viereck anfügen
ja: この四角形に付ける
nl: Teken op deze vierhoek

source: Show a Quadrilateral
ar: أظهر شكلًا رباعيًا
de: Ein Viereck anzeigen
ja: 四角形を表示
nl: Toon een vierhoek

source: Hide a Quadrilateral
ar: أخفِ شكلًا رباعيًا
de: Ein Viereck ausblenden
ja: 四角形を隠す
nl: Verberg een vierhoek

source: Construct a triangle with this vertex
ar: أنشئ مثلثًا باستخدام هذا الرأس
de: Konstruiert ein Dreieck mit diesem Eckpunkt
ja: この頂点で三角形を作成
nl: Teken een driehoek met dit hoekpunt

source: Select a point to be a vertex of the new triangle...
ar: اختر نقطة لتكون رأسًا للمثلث الجديد...
de: Wählen Sie einen Punkt als Eckpunkt des neuen Dreiecks ...
ja: 新しい三角形の頂点となる点を選択...
nl: Selecteer een hoekpunt van de nieuwe driehoek...

source: Intersect this polygon with a line
ar: اقطع هذا المضلع بخط
de: Dieses Polygon mit einer Geraden schneiden
ja: この多角形を直線と交差
nl: Snijd deze veelhoek met een lijn

source: Select the polygon of which you want the intersection with a line...
ar: اختر المضلع الذي تريد تقاطعه مع خط...
de: Wählen Sie das Polygon, das Sie mit einer Geraden schneiden möchten ...
ja: 直線と交差させる多角形を選択...
nl: Selecteer de veelhoek die u met een lijn wilt laten snijden...

source: Intersect this line with a polygon
ar: اقطع هذا الخط بمضلع
de: Diese Gerade mit einem Polygon schneiden
ja: この直線を多角形と交差
nl: Snijd deze lijn met een veelhoek

source: Select the line of which you want the intersection with a polygon...
ar: اختر الخط الذي تريد تقاطعه مع مضلع...
de: Wählen Sie die Gerade, die Sie mit einem Polygon schneiden möchten ...
ja: 多角形と交差させる直線を選択...
nl: Selecteer de lijn die u met een veelhoek wilt laten snijden...

source: Intersect this polygonal curve with a line
ar: اقطع هذا المنحنى المضلعي بخط
de: Diese Polylinie mit einer Geraden schneiden
nl: Snij deze veelhoekige kromme met een lijn

source: Select the polygonal curve of which you want the intersection with a line...
ar: اختر المنحنى المضلعي الذي تريد تقاطعه مع خط...
de: Wählen Sie die Polylinie, die Sie mit einer Geraden schneiden möchten ...
nl: Selecteer de veelhoekige kromme die u door een lijn wilt laten snijden...

source: Intersect this line with a polygonal curve
ar: اقطع هذا الخط بمنحنى مضلعي
de: Diese Gerade mit einer Polylinie schneiden
nl: Snij deze lijn met een veelhoekige kromme

source: Select the line of which you want the intersection with a polygonal curve...
ar: اختر الخط الذي تريد تقاطعه مع منحنى مضلعي...
de: Wählen Sie die Gerade, die Sie mit einer Polylinie schneiden möchten ...
nl: Selecteer de lijn die u met een veelhoekige kromme wilt laten snijden...

source: Intersect this polygon with another polygon
ar: اقطع هذا المضلع بمضلع آخر
de: Dieses Polygon mit einem anderen Polygon schneiden
ja: この多角形を別の多角形と交差
nl: Snijd deze veelhoek met een andere veelhoek

source: Select the polygon of which you want the intersection with another polygon...
ar: اختر المضلع الذي تريد تقاطعه مع مضلع آخر...
de: Wählen Sie das Polygon, das Sie mit einem anderen Polygon schneiden möchten ...
ja: 別の多角形と交差させる多角形を選択...
nl: Selecteer de veelhoek die u met een andere veelhoek wilt laten snijden...

source: Intersect with this polygon
ar: اقطع بهذا المضلع
de: Schnittpunkt mit diesem Polygon
ja: この多角形との交点
nl: Snijden met deze veelhoek

source: Select the second polygon for the intersection...
ar: اختر المضلع الثاني للتقاطع...
de: Wählen Sie das zweite Polygon für die Schnittmenge ...
ja: 交差させる 2 番目の多角形を選択...
nl: Selecteer de tweede veelhoek die u wilt laten snijden...

source: Construct the vertices of this polygon
ar: أنشئ رؤوس هذا المضلع
de: Konstruiert die Eckpunkte dieses Polygons
ja: この多角形の頂点を作成
nl: Teken de hoekpunten van deze veelhoek

source: Select the polygon of which you want to construct the vertices...
ar: اختر المضلع الذي تريد إنشاء رؤوسه...
de: Wählen Sie das Polygon, dessen Eckpunkte Sie konstruieren möchten ...
ja: 頂点を作成する多角形を選択...
nl: Selecteer de veelhoek waarvan u de hoekpunten wilt tekenen...

source: Construct the sides of this polygon
ar: أنشئ أضلاع هذا المضلع
de: Konstruiert die Seiten eines Polygons
ja: この多角形の辺を作成
nl: Teken de zijden van deze veelhoek

source: Select the polygon of which you want to construct the sides...
ar: اختر المضلع الذي تريد إنشاء أضلاعه...
de: Wählen Sie das Polygon, dessen Seiten Sie konstruieren möchten ...
ja: 辺を作成する多角形を選択...
nl: Selecteer de veelhoek waarvan u de zijden wilt tekenen...

source: Construct the convex hull of this polygon
ar: أنشئ الغلاف المحدب لهذا المضلع
de: Konstruiert die Konvexhülle dieses Polygons
ja: この多角形の凸包を作成
nl: Teken de convexe omhulling van deze veelhoek

source: Select the polygon of which you want to construct the convex hull...
ar: اختر المضلع الذي تريد إنشاء غلافه المحدب...
de: Wählen Sie das Polygon, dessen Konvexhülle Sie konstruieren möchten ...
ja: 凸包を作成する多角形を選択...
nl: Selecteer de veelhoek waarvan u de convexe omhulling wilt tekenen...

source: Project this point onto the circle
ar: أسقط هذه النقطة على الدائرة
de: Projiziert diesen Punkt auf den Kreis
ja: この点を円に投影
nl: Projecteer dit punt op de cirkel

source: Select the point for the tangent to go through...
ar: اختر النقطة التي سيمر منها المماس...
de: Wählen Sie den Punkt, durch den die Tangente gehen soll ...
ja: 接線が通る点を選択...
nl: Selecteer het raakpunt...

source: Is this line parallel?
ar: هل هذا الخط موازٍ؟
de: Ist diese Gerade parallel?
ja: この直線と...
nl: Is deze lijn evenwijdig?

source: Select the first of the two possibly parallel lines...
ar: اختر الخط الأول من الخطين المحتمل توازيهما...
de: Wählen Sie die erste der beiden womöglich parallelen Geraden ...
ja: 平行かもしれない 2 直線の 1 番目を選択...
nl: Selecteer de eerste van de twee lijnen die mogelijk evenwijdig zijn...

source: Parallel to this line?
ar: هل يوازي هذا الخط؟
de: Parallel zu dieser Geraden?
ja: この直線は平行？
nl: Evenwijdig aan deze lijn?

source: Select the other of the two possibly parallel lines...
ar: اختر الخط الآخر من الخطين المحتمل توازيهما...
de: Wählen Sie die zweite der beiden womöglich parallelen Geraden ...
ja: 平行かもしれない 2 直線の 2 番目を選択...
nl: Selecteer de tweede van de twee lijnen die mogelijk evenwijdig zijn...

source: These lines are parallel.
ar: هذان الخطان متوازيان.
de: Diese Geraden sind parallel.
ja: これらの直線は平行です。
nl: Deze lijnen zijn evenwijdig.

source: These lines are not parallel.
ar: هذان الخطان غير متوازيين.
de: Diese Geraden sind nicht parallel.
ja: これらの直線は平行ではありません。
nl: Deze lijnen zijn niet evenwijdig.

source: Is this line orthogonal?
ar: هل هذا الخط متعامد؟
de: Ist diese Gerade senkrecht zu einer anderen?
ja: この直線と...
nl: Is deze lijn loodrecht?

source: Select the first of the two possibly orthogonal lines...
ar: اختر الخط الأول من الخطين المحتمل تعامدهما...
de: Wählen Sie die erste der beiden womöglich senkrechten Geraden ...
ja: 直交するかもしれない 2 直線の 1 番目を選択...
nl: Selecteer de eerste van de twee lijnen die mogelijk loodrecht zijn...

source: Orthogonal to this line?
ar: هل يعامد هذا الخط؟
de: Senkrecht zu dieser Geraden?
ja: この直線は垂直？
nl: Loodrecht op deze lijn?

source: Select the other of the two possibly orthogonal lines...
ar: اختر الخط الآخر من الخطين المحتمل تعامدهما...
de: Wählen Sie die zweite der beiden womöglich senkrechten Geraden ...
ja: 直交するかもしれない 2 直線の 2 番目を選択...
nl: Selecteer de tweede van de twee lijnen die mogelijk loodrecht zijn...

source: These lines are orthogonal.
ar: هذان الخطان متعامدان.
de: Diese Geraden sind senkrecht zueinander.
ja: これらの直線は垂直です。
nl: Deze lijnen zijn loodrecht.

source: These lines are not orthogonal.
ar: هذان الخطان غير متعامدين.
de: Diese Geraden sind nicht senkrecht zueinander.
ja: これらの直線は垂直ではありません。
nl: Deze lijnen zijn niet loodrecht.

source: Check collinearity of this point
ar: افحص استقامة هذه النقطة
de: Kollinearität dieses Punktes testen
ja: この点の共線性をチェック
nl: Controleer of dit punt op de rechte lijn ligt

source: Select the first of the three possibly collinear points...
ar: اختر النقطة الأولى من النقاط الثلاث المحتمل استقامتها...
de: Wählen Sie den ersten von drei womöglich kollinearen Punkten ...
ja: 同一線上にあるかもしれない 3 点の 1 番目を選択...
nl: Selecteer het eerste van de drie punten die mogelijk op een rechte lijn liggen...

source: and this second point
ar: ومع هذه النقطة الثانية
de: und diesen zweiten Punkt
ja: そして 2 つ目の点
nl: en dit tweede punt

source: Select the second of the three possibly collinear points...
ar: اختر النقطة الثانية من النقاط الثلاث المحتمل استقامتها...
de: Wählen Sie den zweiten der drei womöglich kollinearen Punkten ...
ja: 同一線上にあるかもしれない 3 点の 2 番目を選択...
nl: Selecteer het tweede van de drie punten die mogelijk op een rechte lijn liggen...

source: with this third point
ar: ومع هذه النقطة الثالثة
de: mit diesem dritten Punkt
ja: そして 3 つ目の点
nl: met dit derde punt

source: Select the last of the three possibly collinear points...
ar: اختر آخر النقاط الثلاث المحتمل استقامتها...
de: Wählen Sie den letzten der drei womöglich kollinearen Punkten ...
ja: 同一線上にあるかもしれない 3 点の 3 番目を選択...
nl: Selecteer het laatste van de drie punten die mogelijk op een rechte lijn liggen...

source: These points are collinear.
ar: هذه النقاط على استقامة واحدة.
de: Diese Punkte sind kollinear
ja: これらの点は同一線上にあります。
nl: Deze drie punten liggen op een rechte lijn.

source: These points are not collinear.
ar: هذه النقاط ليست على استقامة واحدة.
de: Diese Punkte sind nicht kollinear
ja: これらの点は同一線上にありません。
nl: Deze drie punten liggen niet op een rechte lijn.
