Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Resize Angle
ar: غيّر حجم الزّاوية
de: Winkelgröße ändern
ja: 角をリサイズ
nl: Verander hoekgrootte

source: Construct an arc starting at this point
ar: أنشئ قوسًا يبدأ عند هذه النّقطة
de: Einen Kreisbogen mit Beginn an diesem Punkt konstruieren
ja: この点から始まる弧を作成
nl: Teken een cirkelboog die begint in dit punt

source: Select the start point of the new arc...
ar: اختر نقطة بدء القوس الجديد…
de: Wählen Sie den Startpunkt des neuen Kreisbogens ...
ja: 新しい弧の始点を選択...
nl: Selecteer het beginpunt van de nieuwe cirkelboog...

source: Construct an arc through this point
ar: أنشئ قوسًا عبر هذه النّقطة
de: Einen Kreisbogen durch diesen Punkt konstruieren
ja: この点を通る弧を作成
nl: Teken een cirkelboog door dit punt

source: Select a point for the new arc to go through...
ar: اختر نقطة ليمرّ القوس الجديد عبرها…
de: Wählen Sie einen Punkt, durch den der neue Kreisbogen gehen soll ...
ja: 新しい弧が通る点を選択...
nl: Selecteer een punt dat op de nieuwe cirkelboog ligt...

source: Construct an arc ending at this point
ar: أنشئ قوسًا ينتهي عند هذه النّقطة
de: Einen Kreisbogen mit dem Ende an diesem Punkt konstruieren
ja: この点で終わる弧を作成
nl: Teken een cirkelboog die eindigt in dit punt

source: Select the end point of the new arc...
ar: اختر نقطة نهاية القوس الجديد…
de: Wählen Sie den Endpunkt für den neuen Kreisbogen ...
ja: 新しい弧の終点を選択...
nl: Selecteer het eindpunt van de nieuwe cirkelboog...

source: Construct an arc with this center
ar: أنشئ قوسًا بمركزه هذا
de: Konstruieren Sie einen Kreisbogen mit diesem Mittelpunkt
ja: ここを中心とした弧を作成
nl: Teken een cirkelboog met dit middelpunt

source: Select the center of the new arc...
ar: اختر مركز القوس الجديد…
de: Wählen Sie den Mittelpunkt des neuen Kreisbogens ...
ja: 新しい弧の中心を選択...
nl: Selecteer het middelpunt van de nieuwe cirkelboog...

source: Construct an arc with this angle
ar: أنشئ قوسًا بزاوية
de: Konstruieren Sie einen Kreisbogen mit diesem Winkel
ja: この角で弧を作成
nl: Teken een cirkelboog met deze hoek

source: Select the angle of the new arc...
ar: اختر زاوية القوس الجديد…
de: Wählen Sie den Winkel des neuen Kreisbogens ...
ja: 新しい弧の角を選択...
nl: Selecteer de hoekgrootte van de nieuwe cirkelboog...

source: Construct a conic arc starting at this point
ar: أنشئ قوسًا مخروطيًّا يبدأ عند هذه النّقطة
de: Einen konischen Bogen mit Beginn an diesem Punkt konstruieren
ja: この点から始まる二次曲線の弧を作成
nl: Teken een kegelsnedeboog die begint in dit punt

source: Select the start point of the new conic arc...
ar: اختر نقطة بدء القوس المخروطيّ الجديد…
de: Wählen Sie den Startpunkt des neuen konischen Bogens ...
ja: 新しい二次曲線の弧の始点を選択...
nl: Selecteer het beginpunt van de nieuwe kegelsnedeboog...

source: Construct a conic arc through this point
ar: أنشئ قوسًا مخروطيًّا عبر هذه النّقطة
de: Einen konischen Bogen durch diesen Punkt konstruieren
ja: この点を通る二次曲線の弧を作成
nl: Teken een kegelsnedeboog door dit punt

source: Select a point for the new conic arc to go through...
ar: اختر نقطة ليمرّ القوس المخروطيّ الجديد عبرها…
de: Wählen Sie einen Punkt, durch den der neue konische Bogen gehen soll ...
ja: 新しい二次曲線の弧が通る点を選択...
nl: Selecteer een punt dat op de nieuwe kegelsnedeboog ligt...

source: Construct a conic arc ending at this point
ar: أنشئ قوسًا مخروطيًّا ينتهي عند هذه النّقطة
de: Einen konischen Bogen mit dem Ende an diesem Punkt konstruieren
ja: この点で終わる二次曲線の弧を作成
nl: Teken een kegelsnedeboog die eindigt in dit punt

source: Select the end point of the new conic arc...
ar: اختر نقطة نهاية القوس المخروطيّ الجديد…
de: Wählen Sie den Endpunkt für den neuen konischen Bogen ...
ja: 新しい二次曲線の弧の終点を選択...
nl: Selecteer het eindpunt van de nieuwe kegelsnedeboog...

source: Construct an conic arc with this center
ar: أنشئ قوسًا مخروطيًّا بهذا المركز
de: Konstruieren Sie einen konischen Bogen mit diesem Mittelpunkt
ja: ここを中心とする二次曲線の弧を作成
nl: Teken een kegelsnedeboog met dit middelpunt

source: Select the center of the new conic arc...
ar: اختر مركز القوس المخروطيّ الجديد…
de: Wählen Sie den Mittelpunkt des neuen konischen Bogens ...
ja: 新しい二次曲線の弧の中心を選択...
nl: Selecteer het middelpunt van de nieuwe kegelsnedeboog...

source: Number of control points
ar: عدد نقاط التّحكّم
de: Anzahl der Kontrollpunkte
nl: Aantal controlepunten

source: Control polygon
ar: مضلّع التّحكّم
de: Kontrollpolygon
nl: Controleveelhoek

source: Cartesian Equation
ar: المعادلة الدّيكارتيّة
de: Kartesische Gleichung
ja: 方程式 (直交座標系)
nl: Cartesische vergelijking

source: Bézier Curve
ar: منحنى بيزيه
de: Bézierkurve
nl: Bézier kromme

source: Select this Bézier Curve
ar: اختر منحنى بيزيه هذا
de: Diese Bézierkurve auswählen
nl: Selecteer deze Bézier kromme

source: Select Bézier Curve %1
ar: اختر منحنى بيزيه %1
de: Bézierkurve %1 auswählen
nl: Selecteer Bézier kromme %1

source: Remove a Bézier Curve
ar: أزل منحنى بيزيه
de: Eine Bézierkurve entfernen
nl: Verwijder een Bézier kromme

source: Add a Bézier Curve
ar: أضف منحنى بيزيه
de: Eine Bézierkurve hinzufügen
nl: Voeg een Bézier kromme toe

source: Move a Bézier Curve
ar: انقل منحنى بيزيه
de: Eine Bézierkurve verschieben
nl: Verplaats een Bézier kromme

source: Attach to this Bézier Curve
ar: أرفق بمنحنى بيزيه هذا
de: Zu dieser Bézierkurve hinzufügen
nl: Teken op deze Bézier kromme

source: Show a Bézier Curve
ar: اعرض منحنى بيزيه
de: Eine Bézierkurve anzeigen
nl: Toon een Bézier kromme

source: Hide a Bézier Curve
ar: أخفِ منحنى بيزيه
de: Eine Bézierkurve ausblenden
nl: Verberg een Bézier kromme

source: Bézier Quadratic
ar: تربيعيّة بيزيه
de: Quadratische Bézierkurve
nl: Bézier kwadratische kromme

source: Select this Bézier Quadratic
ar: اختر تربعيّة بيزيه هذه
de: Diese quadratische Bézierkurve auswählen
nl: Selecteer deze Bézier kwadratische kromme

source: Select Bézier Quadratic %1
ar: اختر تربعيّة بيزيه %1
de: Quadratische Bézierkurve %1 auswählen
nl: Selecteer Bézier kwadratische kromme %1

source: Remove a Bézier Quadratic
ar: أزل تربعيّة بيزيه
de: Eine quadratische Bézierkurve entfernen
nl: Verwijder een Bézier kwadratische kromme

source: Add a Bézier Quadratic
ar: أضف تربعيّة بيزيه
de: Eine quadratische Bézierkurve hinzufügen
nl: Voeg een Bézier kwadratische kromme toe

source: Move a Bézier Quadratic
ar: انقل تربعيّة بيزيه
de: Eine quadratische Bézierkurve verschieben
nl: Verplaats een Bézier kwadratische kromme

source: Attach to this Bézier Quadratic
ar: أرفق بتربيعيّة بيزيه هذه
de: Zu dieser quadratischen Bézierkurve hinzufügen
nl: Teken op deze Bézier kwadratische kromme

source: Show a Bézier Quadratic
ar: اعرض تربعيّة بيزيه
de: Eine quadratische Bézierkurve anzeigen
nl: Toon een Bézier kwadratische kromme

source: Hide a Bézier Quadratic
ar: أخفِ تربعيّة بيزيه
de: Eine quadratische Bézierkurve ausblenden
nl: Verberg een Bézier kwadratische kromme

source: Bézier Cubic
ar: مكعّبة بيزيه
de: Kubische Bézierkurve
nl: Bézier derdegraads kromme

source: Select this Bézier Cubic
ar: اختر مكعّبة بيزيه هذه
de: Diese kubische Bézierkurve auswählen
nl: Selecteer deze Bézier derdegraads kromme

source: Select Bézier Cubic %1
ar: اختر مكعّبة بيزيه %1
de: Kubische Bézierkurve %1 auswählen
nl: Selecteer Bézier derdegraads kromme %1

source: Remove a Bézier Cubic
ar: أزل مكعّبة بيزيه
de: Eine kubische Bézierkurve entfernen
nl: Verwijder een Bézier kromme

source: Add a Bézier Cubic
ar: أضف مكعّبة بيزيه
de: Eine kubische Bézierkurve hinzufügen
nl: Voeg een Bézier derdegraads kromme toe

source: Move a Bézier Cubic
ar: انقل مكعّبة بيزيه
de: Eine kubische Bézierkurve verschieben
nl: Verplaats een Bézier derdegraads kromme

source: Attach to this Bézier Cubic
ar: أرفق بمكعّبة بيزيه هذه
de: Zu dieser kubischen Bézierkurve hinzufügen
nl: Teken op deze Bézier derdegraads kromme

source: Show a Bézier Cubic
ar: اعرض مكعّبة بيزيه
de: Eine kubische Bézierkurve anzeigen
nl: Toon een Bézier derdegraads kromme

source: Hide a Bézier Cubic
ar: أخفِ مكعّبة بيزيه
de: Eine kubische Bézierkurve ausblenden
nl: Verberg een Bézier derdegraads kromme

source: Rational Bézier Curve
ar: منحنى بيزيه كسريّ
de: Rationale Bézierkurve
nl: Rationele Bézier kromme

source: Select this Rational Bézier Curve
ar: اختر منحنى بيزيه الكسريّ هذا
de: Diese rationale Bézierkurve auswählen
nl: Selecteer deze rationele Bézier kromme

source: Select Rational Bézier Curve %1
ar: اختر منحنى بيزيه الكسريّ %1
de: Bézierkurve %1 auswählen
nl: Selecteer rationele Bézier kromme %1

source: Remove a Rational Bézier Curve
ar: أزل منحنى بيزيه كسريّ
de: Eine rationale Bézierkurve entfernen
nl: Verwijder een rationele Bézier kromme

source: Add a Rational Bézier Curve
ar: أضف منحنى بيزيه كسريّ
de: Eine rationale Bézierkurve hinzufügen
nl: Voeg een rationele Bézier kromme toe

source: Move a Rational Bézier Curve
ar: انقل منحنى بيزيه كسريّ
de: Eine rationale Bézierkurve verschieben
nl: Verplaats een rationele Bézier kromme

source: Attach to this Rational Bézier Curve
ar: أرفق بمنحنى بيزيه الكسريّ هذا
de: Zu dieser rationalen Bézierkurve hinzufügen
nl: Teken op deze rationele Bézier kromme

source: Show a Rational Bézier Curve
ar: اعرض منحنى بيزيه كسريّ
de: Eine rationale Bézierkurve anzeigen
nl: Toon een rationele Bézier kromme

source: Hide a Rational Bézier Curve
ar: أخفِ منحنى بيزيه كسريّ
de: Eine rationale Bézierkurve ausblenden
nl: Verberg een rationele Bézier kromme

source: Rational Bézier Quadratic
ar: تربيعيّة بيزيه كسريّة
de: Rationale quadratische Bézierkurve
nl: Rationele Bézier kwadratische kromme

source: Select this Rational Bézier Quadratic
ar: اختر تربعيّة بيزيه الكسريّة هذه
de: Diese rationale quadratische Bézierkurve auswählen
nl: Selecteer deze rationele Bézier kwadratische kromme

source: Select Rational Bézier Quadratic %1
ar: اختر تربعيّة بيزيه الكسريّة %1
de: Rationale quadratische Bézierkurve %1 auswählen
nl: Selecteer rationele Bézier kwadratische kromme %1

source: Remove a Rational Bézier Quadratic
ar: أزل تربعيّة بيزيه كسريّة
de: Eine rationale quadratische Bézierkurve entfernen
nl: Verwijder een rationele Bézier kwadratische kromme

source: Add a Rational Bézier Quadratic
ar: أضف تربعيّة بيزيه كسريّة
de: Eine rationale quadratische Bézierkurve hinzufügen
nl: Voeg een rationele Bézier kwadratische kromme toe

source: Move a Rational Bézier Quadratic
ar: انقل تربعيّة بيزيه كسريّة
de: Eine rationale quadratische Bézierkurve verschieben
nl: Verplaats een rationele Bézier kwadratische kromme

source: Attach to this Rational Bézier Quadratic
ar: أرفق بتربيعيّة بيزيه الكسريّة هذه
de: Zu dieser rationalen quadratischen Bézierkurve hinzufügen
nl: Teken op deze rationele Bézier kwadratische kromme

source: Show a Rational Bézier Quadratic
ar: اعرض تربعيّة بيزيه كسريّة
de: Eine rationale quadratische Bézierkurve anzeigen
nl: Toon een rationele Bézier kwadratische kromme

source: Hide a Rational Bézier Quadratic
ar: أخفِ تربعيّة بيزيه كسريّة
de: Eine rationale quadratische Bézierkurve ausblenden
nl: Verberg een rationele Bézier kwadratische kromme

source: Rational Bézier Cubic
ar: مكعّبة بيزيه كسريّة
de: Rationale kubische Bézierkurve
nl: Rationele Bézier derdegraads kromme

source: Select this Rational Bézier Cubic
ar: اختر مكعّبة بيزيه الكسريّة هذه
de: Diese rationale kubische Bézierkurve auswählen
nl: Selecteer deze rationele Bézier derdegraads kromme

source: Select Rational Bézier Cubic %1
ar: اختر مكعّبة بيزيه الكسريّة %1
de: Rationale kubische Bézierkurve %1 auswählen
nl: Selecteer rationele Bézier derdegraads kromme %1

source: Remove a Rational Bézier Cubic
ar: أزل مكعّبة بيزيه كسريّة
de: Eine rationale kubische Bézierkurve entfernen
nl: Verwijder een rationele Bézier derdegraads kromme

source: Add a Rational Bézier Cubic
ar: أضف مكعّبة بيزيه كسريّة
de: Eine rationale kubische Bézierkurve hinzufügen
nl: Voeg een rationele Bézier derdegraads kromme toe

source: Move a Rational Bézier Cubic
ar: انقل مكعّبة بيزيه كسريّة
de: Eine rationale kubische Bézierkurve verschieben
nl: Verplaats een rationele Bézier derdegraads kromme

source: Attach to this Rational Bézier Cubic
ar: أرفق بمكعّبة بيزيه الكسريّة هذه
de: Zu dieser rationalen kubischen Bézierkurve hinzufügen
nl: Teken op deze rationele Bézier derdegraads kromme

source: Show a Rational Bézier Cubic
ar: اعرض مكعّبة بيزيه كسريّة
de: Eine rationale kubische Bézierkurve anzeigen
nl: Toon een rationele Bézier derdegraads kromme

source: Hide a Rational Bézier Cubic
ar: أخفِ مكعّبة بيزيه كسريّة
de: Eine rationale kubische Bézierkurve ausblenden
nl: Verberg een rationele Bézier derdegraads kromme

source: Construct a quadratic Bézier curve with this control point
ar: أنشئ منحنى بيزييه تربيعي بنقطة التحكم هذه
de: Eine quadratische Bézierkurve mit diesem Kontrollpunkt konstruieren
nl: Teken een kwadratische Bézier kromme met dit controlepunt

source: Select a point to be a control point of the new quadratic Bézier curve...
ar: اختر نقطة لتكون نقطة تحكم لمنحنى بيزييه التربيعي الجديد...
de: Wählen Sie einen Punkt als Kontrollpunkt der neuen Bézierkurve ...
nl: Selecteer een punt als controlepunt van de nieuwe kwadratische Bézier kromme...

source: Construct a cubic Bézier curve with this control point
ar: أنشئ منحنى بيزييه تكعيبي بنقطة التحكم هذه
de: Eine kubische Bézierkurve mit diesem Kontrollpunkt konstruieren
nl: Teken een derdegraads Bézier kromme met dit controlepunt

source: Select a point to be a control point of the new cubic Bézier curve...
ar: اختر نقطة لتكون نقطة تحكم لمنحنى بيزييه التكعيبي الجديد...
de: Wählen Sie einen Punkt als Kontrollpunkt der neuen kubischen Bézierkurve ...
nl: Selecteer een controlepunt voor de nieuwe derdegraads Bézier kromme...

source: Construct a quadratic rational Bézier curve with this control point
ar: أنشئ منحنى بيزييه نسبي تربيعي بنقطة التحكم هذه
de: Eine rationale quadratische Bézierkurve mit diesem Kontrollpunkt konstruieren
nl: Teken een kwadratische rationele Bézier kromme met dit controlepunt

source: Select three points and three numeric values as weights to construct rational Bézier curve...
ar: اختر ثلاث نقاط وثلاث قيم عددية كأوزان لإنشاء منحنى بيزييه نسبي...
de: Wählen Sie drei Punkte und drei numerische Werte als Gewichte um eine rationale Bézierkurve zu konstruieren ...
nl: Selecteer drie punten en drie gewichtswaarden voor het tekenen van een rationele Bézier kromme...

source: Select this value as weight
ar: اختر هذه القيمة كوزن
de: Diesen Wert als Gewicht auswählen
nl: Selecteer deze getalswaarde als gewicht

source: Construct a cubic rational Bézier curve with this control point
ar: أنشئ منحنى بيزييه نسبي تكعيبي بنقطة التحكم هذه
de: Eine rationale kubische Bézierkurve mit diesem Kontrollpunkt konstruieren
nl: Teken een derdegraads rationele Bézier kromme met dit controlepunt

source: string
ar: سلسلة نصية
nl: tekenreeks

source: double
ar: مزدوج
nl: dubbel

source: int
ar: عدد صحيح

source: Test Result
ar: نتيجة الاختبار
de: Testresultat
ja: テスト結果
nl: Test het resultaat

source: Select the curve...
ar: اختر المنحنى...
de: Diese Kurve auswählen ...
ja: 曲線を選択...
nl: Selecteer de kromme...

source: Select a point on the curve...
ar: اختر نقطة على المنحنى...
de: Wählen Sie einen Punkt auf der Kurve ...
ja: 曲線上の点を選択...
nl: Selecteer een punt op de kromme...

source: Surface
ar: سطح
de: Oberfläche
ja: 面積
nl: Oppervlak

source: Circumference
ar: محيط
de: Umfang
ja: 円周
nl: Omtrek

source: Radius
ar: نصف القطر
ja: 半径
nl: Straal

source: Center
ar: الوسط
de: Mittelpunkt
ja: 中心
nl: Middelpunt

source: Expanded Cartesian Equation
ar: المعادلة الديكارتية الموسعة
de: Erweiterte kartesische Gleichung
ja: 展開された方程式 (直交座標系)
nl: Ontwikkelde Cartesische vergelijking

source: Polar Equation
ar: المعادلة القطبية
de: Polare Gleichung
ja: 極方程式
nl: Polaire vergelijking

source: rho = %1 [centered at %2]
ar: رو = %1 [مركّز عند %2]
de: rho = %1 [zentriert bei %2]
ja: ρ = %1 [点 %2 を中心とする]
nl: rho = %1 [gecentreerd op %2]

source: circle
ar: دائرة
de: Kreis
ja: 円
nl: cirkel

source: Select this circle
ar: اختر هذه الدائرة
de: Diesen Kreis wählen
ja: この円を選択
nl: Selecteer deze cirkel

source: Select circle %1
ar: اختر الدائرة %1
de: Wählen Sie Kreis %1
ja: 円 %1 を選択
nl: Selecteer cirkel %1

source: Remove a Circle
ar: أزل دائرة
de: Einen Kreis entfernen
ja: 円を削除
nl: Verwijder een cirkel

source: Add a Circle
ar: أضف دائرة
de: Einen Kreis hinzufügen
ja: 円を追加
nl: Voeg een cirkel toe

source: Move a Circle
ar: حرّك دائرة
de: Einen Kreis verschieben
ja: 円を移動
nl: Verplaats een cirkel

source: Attach to this circle
ar: ارفق بهذه الدائرة
de: Zu diesem Kreis hinzufügen
ja: この円に付ける
nl: Teken op deze cirkel

source: Show a Circle
ar: أظهر دائرة
de: Einen Kreis anzeigen
ja: 円を表示
nl: Toon een cirkel

source: Hide a Circle
ar: أخفِ دائرة
de: Einen Kreis ausblenden
ja: 円を隠す
nl: Verberg een cirkel

source: Construct a circle through this point
ar: أنشئ دائرة تمر بهذه النقطة
de: Einen Kreis durch diesen Punkt konstruieren
ja: この点を通る円を作成
nl: Teken een cirkel door dit punt

source: Construct a circle with this center
ar: أنشئ دائرة بهذا المركز
de: Einen Kreis mit diesem Mittelpunkt konstruieren
ja: ここを中心とした円を作成
nl: Teken een cirkel met dit middelpunt

source: Select the center of the new circle...
ar: اختر مركز الدائرة الجديدة...
de: Wählen Sie den Mittelpunkt des neuen Kreises ...
ja: 新しい円の中心を選択...
nl: Selecteer het middelpunt van de nieuwe cirkel...

source: Select a point for the new circle to go through...
ar: اختر نقطة لتمرّ بها الدائرة الجديدة...
de: Wählen Sie einen Punkt, durch den der neue Kreis gehen soll ...
ja: 新しい円が通る点を選択...
nl: Selecteer een punt dat op de nieuwe cirkel ligt...

source: With this radius
ar: بهذا نصف القطر
de: mit diesem Radius
ja: この半径で
nl: Met deze straal

source: Select the length of the radius...
ar: اختر طول نصف القطر...
de: Wählen Sie die Länge des Radius ...
ja: 半径の長さを選択...
nl: Selecteer de lengte van de straal...

source: Conic Type
ar: نوع القطع المخروطي
de: Kegelschnitttyp
ja: 二次曲線の種類
nl: Type van kegelsnede

source: First Focus
ar: البؤرة الأولى
de: Erster Brennpunkt
ja: 第 1 焦点
nl: Eerste brandpunt

source: Second Focus
ar: البؤرة الثانية
de: Zweiter Brennpunkt
ja: 第 2 焦点
nl: Tweede brandpunt

source: Ellipse
ar: بيضاوي
ja: 楕円
nl: Ellips

source: Hyperbola
ar: قطع زائد
de: Hyperbel
ja: 双曲線
nl: Hyperbool

source: Parabola
ar: قطع مكافئ
de: Parabel
ja: 放物線
nl: Parabool

source: rho
ar: رو
ja: ρ

source: cos theta
ar: جيب التمام
ja: cos θ

source: sin theta
ar: جيب الزاوية
ja: sin θ

source: [centered at %1]
ar: [مركّز عند %1]
de: [zentriert bei %1]
ja: [点 %1 を中心とする]
nl: [vanuit op %1]

source: conic
ar: قطع مخروطي
de: Kegelschnitt
ja: 二次曲線
nl: kegelsnede

source: Select this conic
ar: اختر هذا القطع المخروطي
de: Diesen Kegelschnitt auswählen
ja: この二次曲線を選択
nl: Selecteer deze kegelsnede

source: Select conic %1
ar: اختر القطع المخروطي %1
de: Kegelschnitt %1 auswählen
ja: 二次曲線 %1 を選択
nl: Selecteer kegelsnede %1

source: Remove a Conic
ar: أزل قطع مخروطي
de: Diesen Kegelschnitt entfernen
ja: 二次曲線を削除
nl: Verwijder een kegelsnede

source: Add a Conic
ar: أضف قطع مخروطي
de: Einen Kegelschnitt hinzufügen
ja: 二次曲線を追加
nl: Voeg een kegelsnede toe

source: Move a Conic
ar: حرّك قطع مخروطي
de: Einen Kegelschnitt verschieben
ja: 二次曲線を移動
nl: Verplaats een kegelsnede

source: Attach to this conic
ar: ارفق بهذا القطع المخروطي
de: Diesem Kegelschnitt hinzufügen
ja: この二次曲線に付ける
nl: Teken op deze kegelsnede

source: Show a Conic
ar: أظهر قطع مخروطي
de: Einen Kegelschnitt anzeigen
ja: 二次曲線を表示
nl: Toon een kegelsnede

source: Hide a Conic
ar: أخفِ قطع مخروطي
de: Einen Kegelschnitt ausblenden
ja: 二次曲線を隠す
nl: Verberg een kegelsnede

source: Supporting Conic
ar: القطع المخروطي الداعم
de: Unterstützender Kegelschnitt
nl: Ondersteunende kegelsnede

source: First End Point
ar: نقطة النهاية الأولى
de: Erster Endpunkt
ja: 第 1 の端点
nl: Eerste eindpunt

source: Second End Point
ar: نقطة النهاية الثانية
de: Zweiter Endpunkt
ja: 第 2 の端点
nl: Tweede eindpunt

source: conic arc
ar: قوس مخروطي
de: Konischer Bogen
ja: 二次曲線の弧
nl: kegelsnedeboog

source: Select this conic arc
ar: اختر هذا القوس المخروطي
de: Diesen konischen Bogen auswählen
ja: この二次曲線の弧を選択
nl: Selecteer deze kegelsnedeboog

source: Select conic arc %1
ar: اختر القوس المخروطي %1
de: Konischen Bogen %1 auswählen
ja: 二次曲線の弧 %1 を選択
nl: Selecteer kegelsnedeboog %1

source: Remove a Conic Arc
ar: أزل قوس مخروطي
de: Diesen konischen Bogen entfernen
ja: 二次曲線の弧を削除
nl: Verwijder een kegelsnedeboog

source: Add a Conic Arc
ar: أضف قوس مخروطي
de: Einen konischen Bogen hinzufügen
ja: 二次曲線の弧を追加
nl: Voeg een kegelsnedeboog toe

source: Move a Conic Arc
ar: حرّك قوس مخروطي
de: Einen konischen Bogen verschieben
ja: 二次曲線の弧を移動
nl: Verplaats een kegelsnedeboog

source: Attach to this conic arc
ar: ارفق بهذا القوس المخروطي
de: Diesem konischen Bogen hinzufügen
ja: この二次曲線の弧に付ける
nl: Voeg toe aan deze kegelsnedeboog

source: Show a Conic Arc
ar: أظهر قوس مخروطي
de: Einen konischen Bogen anzeigen
ja: 二次曲線の弧を表示
nl: Toon een kegelsnedeboog

source: Hide a Conic Arc
ar: أخفِ قوس مخروطي
de: Einen konischen Bogen ausblenden
ja: 二次曲線の弧を隠す
nl: Verberg een kegelsnedeboog

source: Construct a conic through this point
ar: أنشئ قطعًا مخروطيًا يمر بهذه النقطة
de: Einen Kegelschnitt durch diesen Punkt konstruieren
ja: この点を通る二次曲線を作成
nl: Teken een kegelsnede door dit punt

source: Select a point for the new conic to go through...
ar: اختر نقطة ليمر بها القطع المخروطي الجديد...
de: Wählen Sie einen Punkt, durch den der neue Kegelschnitt gehen soll ...
ja: 新しい二次曲線が通る点を選択...
nl: Selecteer een punt dat op de nieuwe kegelsnede ligt...

source: Construct a conic with this asymptote
ar: أنشئ قطعًا مخروطيًا بهذا المحاذي
de: Einen Kegelschnitt mit dieser Asymptote konstruieren
ja: この漸近線で二次曲線を作成
nl: Teken een kegelsnede met deze asymptoot

source: Select the first asymptote of the new conic...
ar: اختر المحاذي الأول للقطع المخروطي الجديد...
de: Wählen Sie die erste Asymptote für den neuen Kegelschnitt ...
ja: 新しい二次曲線の 1 番目の漸近線を選択...
nl: Selecteer de eerste asymptoot van de nieuwe kegelsnede...

source: Select the second asymptote of the new conic...
ar: اختر المحاذي الثاني للقطع المخروطي الجديد...
de: Wählen Sie die zweite Asymptote für den neuen Kegelschnitt ...
ja: 新しい二次曲線の 2 番目の漸近線を選択...
nl: Selecteer de tweede asymptoot van de nieuwe kegelsnede...

source: Construct an ellipse with this focus
ar: أنشئ قطعًا ناقصًا بهذه البؤرة
de: Eine Ellipse mit diesem Brennpunkt konstruieren
ja: この焦点で楕円を作成
nl: Teken een ellips met dit brandpunt

source: Select the first focus of the new ellipse...
ar: اختر البؤرة الأولى للقطع الناقص الجديد...
de: Wählen Sie den ersten Brennpunkt der neuen Ellipse ...
ja: 新しい楕円の 1 番目の焦点を選択...
nl: Selecteer het eerste brandpunt van de nieuwe ellips...

source: Select the second focus of the new ellipse...
ar: اختر البؤرة الثانية للقطع الناقص الجديد...
de: Wählen Sie den zweiten Brennpunkt der neuen Ellipse ...
ja: 新しい楕円の 2 番目の焦点を選択...
nl: Selecteer het tweede brandpunt van de nieuwe ellips...

source: Construct an ellipse through this point
ar: أنشئ قطعًا ناقصًا يمر بهذه النقطة
de: Eine Ellipse durch diesen Punkt konstruieren
ja: この点を通る楕円を作成
nl: Teken een ellips door dit punt

source: Select a point for the new ellipse to go through...
ar: اختر نقطة ليمر بها القطع الناقص الجديد...
de: Wählen Sie einen Punkt, durch den die Ellipse gehen soll ...
ja: 新しい楕円が通る点を選択...
nl: Selecteer een punt dat op de nieuwe ellips ligt...

source: Construct a hyperbola with this focus
ar: أنشئ قطعًا زائدًا بهذه البؤرة
de: Eine Hyperbel mit diesem Brennpunkt konstruieren
ja: この焦点で双曲線を作成
nl: Teken een hyperbool met dit brandpunt

source: Select the first focus of the new hyperbola...
ar: اختر البؤرة الأولى للقطع الزائد الجديد...
de: Wählen Sie den ersten Brennpunkt für die neue Hyperbel ...
ja: 新しい双曲線の 1 番目の焦点を選択...
nl: Selecteer het eerste brandpunt van de nieuwe hyperbool...

source: Select the second focus of the new hyperbola...
ar: اختر البؤرة الثانية للقطع الزائد الجديد...
de: Wählen Sie den zweiten Brennpunkt für die neue Hyperbel ...
ja: 新しい双曲線の 2 番目の焦点を選択...
nl: Selecteer het tweede brandpunt van de nieuwe hyperbool...
