Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Check whether this point is on a curve
ar: افحص ما إذا كانت هذه النقطة على منحنى
de: Testen, ob dieser Punkt auf einer Kurve liegt
ja: この点が曲線上にあるかどうかをチェック
nl: Controleer of dit punt op een kromme ligt

source: Select the point you want to test...
ar: اختر النقطة التي تريد اختبارها...
de: Wählen Sie den zu überprüfenden Punkt ...
ja: テストする点を選択...
nl: Selecteer het punt dat u wilt testen...

source: Check whether the point is on this curve
ar: افحص ما إذا كانت النقطة على هذا المنحنى
de: Überprüft, ob der Punkt auf dieser Kurve ist
ja: 点がこの曲線上にあるかどうかをチェック
nl: Controleer of het punt op deze kromme ligt

source: Select the curve that the point might be on...
ar: اختر المنحنى الذي قد تكون النقطة عليه...
de: Wählen Sie die Kurve, auf der der Punkt liegen könnte ...
ja: 点があるかもしれない曲線を選択...
nl: Selecteer de kromme waar het punt misschien op ligt...

source: This curve contains the point.
ar: هذا المنحنى يحتوي النقطة.
de: Die Kurve enthält den Punkt
ja: この曲線は点を含んでいます。
nl: Het punt ligt op deze kromme.

source: This curve does not contain the point.
ar: هذا المنحنى لا يحتوي النقطة.
de: Die Kurve enthält den Punkt nicht
ja: この曲線は点を含んでいません。
nl: Het punt ligt niet op deze kromme.

source: Check whether this point is in a polygon
ar: افحص ما إذا كانت هذه النقطة في مضلع
de: Überprüft, ob dieser Punkt in einem Polygon liegt
ja: この点が多角形内にあるかどうかをチェック
nl: Controleer of dit punt binnen een veelhoek ligt

source: Check whether the point is in this polygon
ar: افحص ما إذا كانت النقطة في هذا المضلع
de: Überprüft, ob der Punkt in diesem Polygon ist
ja: 点がこの多角形内にあるかどうかをチェック
nl: Controleer of het punt binnen deze veelhoek ligt

source: Select the polygon that the point might be in...
ar: اختر المضلع الذي قد تكون النقطة فيه...
de: Wählen Sie das Polygon, in dem der Punkt liegen könnte ...
ja: 点があるかもしれない多角形を選択...
nl: Selecteer de veelhoek waar het punt misschien binnen ligt...

source: This polygon contains the point.
ar: هذا المضلع يحتوي النقطة.
de: Das Polygon enthält den Punkt
ja: この多角形は点を含んでいます。
nl: Het punt ligt binnen deze veelhoek.

source: This polygon does not contain the point.
ar: هذا المضلع لا يحتوي النقطة.
de: Dieses Polygon enthält den Punkt nicht
ja: この多角形は点を含んでいません。
nl: Het punt ligt niet binnen deze veelhoek.

source: Check whether this polygon is convex
ar: افحص ما إذا كان هذا المضلع محدبًا
de: Überprüft, ob dieses Polygon konvex ist
ja: この多角形が凸かどうかをチェック
nl: Controleer of deze veelhoek convex is

source: Select the polygon you want to test for convexity...
ar: اختر المضلع الذي تريد اختباره من أجل التحدب...
de: Wählen Sie das Polygon, das Sie auf Konvexität überprüfen möchten ...
ja: 凸性をテストする多角形を選択...
nl: Selecteer de veelhoek die u op convex zijn wilt testen...

source: This polygon is convex.
ar: هذا المضلع محدب.
de: Dieses Polygon ist konvex
ja: この多角形は凸です。
nl: Deze veelhoek is convex.

source: This polygon is not convex.
ar: هذا المضلع ليس محدبًا.
de: Dieses Polygon ist nicht konvex
ja: この多角形は凸ではありません。
nl: Deze veelhoek is niet convex.

source: Check if this point has the same distance
ar: افحص ما إذا كانت هذه النقطة لها نفس المسافة
de: Überprüfen, ob der Punkt denselben Abstand hat
ja: この点が等距離にあるかどうかをチェック
nl: Controleer of dit punt op dezelfde afstand ligt

source: Select the point which might have the same distance from two other points...
ar: اختر النقطة التي قد يكون لها نفس المسافة من نقطتين أخريين...
de: Wählen Sie den Punkt, der den gleichen Abstand von zwei anderen haben könnte ...
ja: 他の 2 点から等距離にあるかもしれない点を選択...
nl: Selecteer het punt dat mogelijk even ver ligt van twee andere punten...

source: from this point
ar: من هذه النقطة
de: von diesem Punkt
ja: この点からと
nl: vanaf dit punt

source: Select the first of the two other points...
ar: اختر النقطة الأولى من النقطتين الأخريين...
de: Wählen Sie den ersten der beiden anderen Punkte ...
ja: 他の 2 点の 1 番目を選択...
nl: Selecteer het eerste van de beide andere punten...

source: and from this second point
ar: ومن هذه النقطة الثانية
de: und von diesem zweiten Punkt
ja: そしてこの 2 つ目の点から
nl: en vanaf dit tweede punt

source: Select the other of the two other points...
ar: اختر النقطة الأخرى من النقطتين الأخريين...
de: Wählen Sie den zweiten der beiden anderen Punkte ...
ja: 他の 2 点の 2 番目を選択...
nl: Selecteer het tweede van de beide andere punten...

source: The two distances are the same.
ar: المسافتان متساويتان.
de: Die zwei Abstände sind gleich
ja: 2 つの距離は等しいです。
nl: De twee afstanden zijn even groot.

source: The two distances are not the same.
ar: المسافتان غير متساويتين.
de: Die zwei Abstände sind nicht gleich
ja: 2 つの距離は等しくありません。
nl: De twee afstanden zijn niet even groot.

source: Check whether this vector is equal to another vector
ar: افحص ما إذا كان هذا المتجه يساوي متجهًا آخر
de: Überprüfen, ob ein Vektor gleich einem anderen ist
ja: このベクトルと...
nl: Controleer of deze vector gelijk is aan een andere vector

source: Select the first of the two possibly equal vectors...
ar: اختر المتجه الأول من المتجهين المحتمل تساويهما...
de: Wählen Sie den ersten der beiden womöglich gleichen Vektoren ...
ja: 等しいかもしれない 2 つのベクトルの 1 番目を選択...
nl: Selecteer de eerste van de twee mogelijk gelijke vectoren...

source: Check whether this vector is equal to the other vector
ar: افحص ما إذا كان هذا المتجه يساوي المتجه الآخر
de: Überprüft, ob dieser Vektor gleich dem anderen ist
ja: このベクトルは等しい？
nl: Controleer of deze vector gelijk is aan de andere vector

source: Select the other of the two possibly equal vectors...
ar: اختر المتجه الآخر من المتجهين المحتمل تساويهما...
de: Wählen Sie den anderen der zwei womöglich gleichen Vektoren ...
ja: 等しいかもしれない 2 つのベクトルの 2 番目を選択...
nl: Selecteer de tweede van de twee mogelijk gelijke vectoren...

source: The two vectors are the same.
ar: المتجهان متساويان.
de: Die zwei Vektoren sind gleich
ja: 2 つのベクトルは等しいです。
nl: De twee vectoren zijn gelijk.

source: The two vectors are not the same.
ar: المتجهان غير متساويين.
de: Die zwei Vektoren sind nicht gleich
ja: 2 つのベクトルは等しくありません。
nl: De twee vectoren zijn niet gelijk.

source: Check whether this object exists
ar: افحص ما إذا كان هذا الكائن موجودًا
de: Testet, ob dieses Objekt existiert
ja: このオブジェクトが存在するかどうかをチェック
nl: Controleer of dit object bestaat

source: Select the object for the existence check...
ar: اختر الكائن لفحص الوجود...
de: Wählen Sie das Objekt für die Existenzprüfung ...
ja: 存在をテストするオブジェクトを選択...
nl: Selecteer het object waarvan het bestaan moet worden getest...

source: The object exists.
ar: الكائن موجود.
de: Das Objekt existiert
ja: このオブジェクトは存在します。
nl: Het object bestaat.

source: The object does not exist.
ar: الكائن غير موجود.
de: Das Objekt existiert nicht
ja: このオブジェクトは存在しません。
nl: Het object bestaat niet.

source: Text
ar: النص
ja: テキスト
nl: Tekst

source: label
ar: اللصيقة
de: Textfeld
ja: ラベル
nl: bijschrift

source: Select this label
ar: اختر هذه اللصيقة
de: Dieses Textfeld auswählen
ja: このラベルを選択
nl: Selecteer dit bijschrift

source: Select label %1
ar: اختر اللصيقة %1
de: Textfeld %1 auswählen
ja: ラベル %1 を選択
nl: Selecteer bijschrift %1

source: Remove a Label
ar: أزل لصيقة
de: Ein Textfeld entfernen
ja: ラベルを削除
nl: Verwijder een bijschrift

source: Add a Label
ar: أضف لصيقة
de: Ein Textfeld hinzufügen
ja: ラベルを追加
nl: Voeg een bijschrift toe

source: Move a Label
ar: حرّك لصيقة
de: Ein Textfeld verschieben
ja: ラベルを移動
nl: Verplaats een bijschrift

source: Attach to this label
ar: ألصق بهذه اللصيقة
de: Zu diesem Textfeld hinzufügen
ja: このラベルに付ける
nl: Voeg toe aan dit bijschrift

source: Show a Label
ar: أظهر لصيقة
de: Ein Textfeld anzeigen
ja: ラベルを表示
nl: Toon een bijschrift

source: Hide a Label
ar: أخفِ لصيقة
de: Ein Textfeld ausblenden
ja: ラベルを隠す
nl: Verberg een bijschrift

source: numeric label
ar: لصيقة عددية
de: Numerisches Feld
ja: 数値ラベル
nl: Getal als bijschrift

source: Select this numeric label
ar: اختر هذه اللصيقة العددية
de: Dieses numerische Feld auswählen
ja: この数値ラベルを選択
nl: Selecteer dit getal als bijschrift

source: Select numeric label %1
ar: اختر اللصيقة العددية %1
de: Das numerische Feld %1 auswählen
ja: 数値ラベル %1 を選択
nl: Selecteer numeriek bijschrift %1

source: Remove a Numeric Label
ar: أزل لصيقة عددية
de: Ein numerisches Feld entfernen
ja: 数値ラベルを削除
nl: Verwijder een numeriek bijschrift

source: Add a Numeric Label
ar: أضف لصيقة عددية
de: Ein numerisches Feld hinzufügen
ja: 数値ラベルを追加
nl: Voeg een getal toe als bijschrift

source: Move a Numeric Label
ar: حرّك لصيقة عددية
de: Ein numerisches Feld verschieben
ja: 数値ラベルを移動
nl: Verplaats een numeriek bijschrift

source: Attach to this numeric label
ar: ألصق بهذه اللصيقة العددية
de: Zu diesem numerischen Feld hinzufügen
ja: この数値ラベルに付ける
nl: Voeg toe aan dit numerieke bijschrift

source: Show a Numeric Label
ar: أظهر لصيقة عددية
de: Ein numerisches Feld anzeigen
ja: 数値ラベルを表示
nl: Toon een numeriek bijschrift

source: Hide a Numeric Label
ar: أخفِ لصيقة عددية
de: Ein numerisches Feld ausblenden
ja: 数値ラベルを隠す
nl: Verberg een numeriek bijschrift

source: Numeric value
ar: قيمة عددية
de: Numerisches Feld
ja: 数値
nl: Getalswaarde

source: boolean label
ar: لصيقة منطقية
de: Wahrheitsfeld
ja: ブール値ラベル
nl: booleaans bijschrift

source: Select this boolean label
ar: اختر هذه اللصيقة المنطقية
de: Dieses Wahrheitsfeld auswählen
ja: このブール値ラベルを選択
nl: Selecteer dit booleaans bijschrift

source: Select boolean label %1
ar: اختر اللصيقة المنطقية %1
de: Wahrheitsfeld %1 auswählen
ja: ブール値ラベル %1 を選択
nl: Selecteer booleaans bijschrift %1

source: Remove a Boolean Label
ar: أزل لصيقة منطقية
de: Ein Wahrheitsfeld entfernen
ja: ブール値ラベルを削除
nl: Verwijder een booleaans bijschrift

source: Add a Boolean Label
ar: أضف لصيقة منطقية
de: Ein Wahrheitsfeld hinzufügen
ja: ブール値ラベルを追加
nl: Voeg een booleaans bijschrift toe

source: Move a Boolean Label
ar: حرّك لصيقة منطقية
de: Ein Wahrheitsfeld verschieben
ja: ブール値ラベルを移動
nl: Verplaats een booleaans bijschrift

source: Attach to this boolean label
ar: ألصق بهذه اللصيقة المنطقية
de: Zu diesem Wahrheitsfeld hinzufügen
ja: このブール値ラベルに付ける
nl: Voeg toe aan dit booleaanse bijschrift

source: Show a Boolean Label
ar: أظهر لصيقة منطقية
de: Ein Wahrheitsfeld anzeigen
ja: ブール値ラベルを表示
nl: Toon een booleaans bijschrift

source: Hide a Boolean Label
ar: أخفِ لصيقة منطقية
de: Ein Wahrheitsfeld ausblenden
ja: ブール値ラベルを隠す
nl: Verberg een booleaans bijschrift

source: &Copy Text
ar: ا&نسخ النص
de: &Text kopieren
ja: テキストをコピー(&C)
nl: &Kopieer tekst

source: &Toggle Frame
ar: ب&دّل الإطار
de: Rahmen ein-/ausschal&ten
ja: 枠を表示/隠す(&T)
nl: Kader in/ui&tschakelen

source: Set &Font...
ar: &عين خطاً...
de: Schri&ft festlegen ...
ja: フォントを設定(&F)...
nl: &Lettertype kiezen...

source: Toggle Label Frame
ar: بدّل إطار اللصيقة
de: Textfeldrahmen ein-/ausschalten
ja: ラベルの枠の表示/非表示を切り替え
nl: Schakel kader voor bijschrift in/uit

source: Change Label Font
ar: غيّر خط اللصيقة
de: Feldschrift ändern
ja: ラベルのフォントを変更
nl: Lettertype van bijschrift wijzigen

source: &Redefine...
ar: أ&عد التعريف...
de: Text ände&rn
ja: 再定義(&R)...
nl: He&rdefiniëren...

source: Change &Value...
ar: غيّر ال&قيمة...
de: &Wert ändern ...
ja: 値を変更(&V)...
nl: &Waarde wijzigen...

source: Enter the new value:
ar: أدخل القيمة الجديدة:
de: Geben Sie den neuen Wert ein:
ja: 新しい値を入力:
nl: Voer de nieuwe waarde in:

source: Change Displayed Value
ar: غيّر القيمة المعروضة
de: Angezeigten Wert ändern
ja: 表示する値を変更
nl: Wijzig de getoonde waarde

source: Translate this object
ar: انقل هذا الكائن
de: Dieses Objekt verschieben
ja: このオブジェクトを平行移動
nl: Transleer dit object

source: Select the object to translate...
ar: اختر الكائن المراد نقله...
de: Wählen Sie ein zu verschiebendes Objekt ...
ja: 平行移動するオブジェクトを選択...
nl: Selecteer het te transleren object...

source: Translate by this vector
ar: انقل بهذا المتجه
de: Um diesen Vektor verschieben
ja: このベクトルの分だけ平行移動
nl: Transleer langs deze vector

source: Select the vector to translate by...
ar: اختر المتجه المراد النقل به...
de: Wählen Sie den Verschiebungsvektor ...
ja: 平行移動量を与えるベクトルを選択...
nl: Selecteer de translatievector...

source: Reflect this object
ar: اعكس هذا الكائن
de: Dieses Objekt spiegeln
ja: このオブジェクトを対称移動
nl: Spiegel dit object

source: Select the object to reflect...
ar: اختر الكائن المراد عكسه...
de: Wählen Sie das zu spiegelnde Objekt ...
ja: 対称移動するオブジェクトを選択...
nl: Selecteer het te spiegelen object...

source: Reflect in this point
ar: اعكس في هذه النقطة
de: In diesem Punkt spiegeln
ja: この点に関して対称移動
nl: Spiegel in dit punt

source: Select the point to reflect in...
ar: اختر النقطة المراد العكس فيها...
de: Wählen Sie den Punkt, in dem gespiegelt werden soll ...
ja: 対称の中心を選択...
nl: Selecteer het spiegelpunt...

source: Reflect in this line
ar: اعكس في هذا الخط
de: An dieser Geraden spiegeln
ja: この直線に関して対称移動
nl: Spiegel in deze lijn

source: Select the line to reflect in...
ar: اختر الخط المراد العكس فيه...
de: Wählen Sie die Gerade, an der gespiegelt werden soll ...
ja: 対称の軸を選択...
nl: Selecteer de spiegellijn...

source: Rotate this object
ar: دوّر هذا الكائن
de: Dieses Objekt drehen
ja: このオブジェクトを回転
nl: Roteer dit object

source: Select the object to rotate...
ar: اختر الكائن المراد تدويره...
de: Wählen Sie das zu drehende Objekt ...
ja: 回転するオブジェクトを選択...
nl: Selecteer het te roteren object...

source: Rotate around this point
ar: دوّر حول هذه النقطة
de: Um diesen Punkt drehen
ja: この点の周りで回転
nl: Roteer om dit punt

source: Select the center point of the rotation...
ar: اختر نقطة مركز الدوران...
de: Wählen Sie den Mittelpunkt der Drehung ...
ja: 回転の中心を選択...
nl: Selecteer het rotatiepunt...

source: Rotate by this angle
ar: دوّر بهذه الزاوية
de: Um diesen Winkel drehen
ja: この角だけ回転
nl: Roteer over deze hoek

source: Select the angle of the rotation...
ar: اختر زاوية الدوران...
de: Wählen Sie den Winkel der Drehung ...
ja: 回転角を選択...
nl: Selecteer de rotatiehoek...

source: Scale this object
ar: غيّر مقياس هذا الكائن
de: Dieses Objekt skalieren
ja: このオブジェクトを拡大縮小
nl: Vermenigvuldig dit object

source: Select the object to scale...
ar: اختر الكائن المراد تغيير مقياسه...
de: Wählen Sie das zu skalierende Objekt ...
ja: 拡大縮小するオブジェクトを選択...
nl: Selecteer het te vermenigvuldigen object...

source: Scale with this center
ar: غيّر المقياس بهذا المركز
de: Skalieren mit diesem Mittelpunkt
ja: ここを中心として拡大縮小
nl: Vermenigvuldig vanuit dit punt

source: Select the center point of the scaling...
ar: اختر نقطة مركز تغيير المقياس...
de: Wählen Sie den Mittelpunkt der Skalierung ...
ja: 拡大縮小の中心点を選択...
nl: Selecteer het vermenigvuldigingspunt...

source: Scale by this length
ar: غيّر المقياس بهذا الطول
de: Mit dieser Länge skalieren
ja: この長さだけ拡大縮小
nl: Vermenigvuldig met deze lengte

source: Select a length or a segment whose length is the factor of the scaling...
ar: اختر طولًا أو قطعة مستقيمة طولها هو عامل تغيير المقياس...
de: Wählen Sie eine Länge oder eine Strecke, deren Länge der Faktor der Skalierung ist ...
ja: 拡大縮小の倍率となる長さまたは線分を選択...
nl: Selecteer een lengte of lijnstuk waarvan de lengte de vermenigvuldigingsfactor is...

source: Scale this length...
ar: غيّر مقياس هذا الطول...
de: Mit dieser Länge skalieren ...
ja: 拡大縮小してこの長さを...
nl: Vermenigvuldig met deze lengte...

source: Select the first of two lengths whose ratio is the factor of the scaling...
ar: اختر الطول الأول من طولين نسبتهما هي عامل تغيير المقياس...
de: Wählen Sie die erste der beiden Längen, deren Verhältnis der Faktor der Skalierung ist ...
ja: 拡大縮小の倍率となる比を持つ 2 つの長さの 1 番目を選択...
nl: Selecteer het eerste van twee lengten waarvan de lengteverhouding de vermenigvuldigingsfactor is...

source: ...to this other length
ar: ...إلى هذا الطول الآخر
de: ... zu dieser anderen Länge.
ja: ...この別の長さにする
nl: ...tot deze andere lengte

source: Select the second of two lengths whose ratio is the factor of the scaling...
ar: اختر الطول الثاني من طولين نسبتهما هي عامل تغيير المقياس...
de: Wählen Sie die zweite der beiden Längen, deren Verhältnis der Faktor der Skalierung ist ...
ja: 拡大縮小の倍率となる比を持つ 2 つの長さの 2 番目を選択...
nl: Selecteer het tweede van twee lengten waarvan de lengteverhouding de vermenigvuldigingsfactor is...

source: Select the object to scale
ar: اختر الكائن المراد تغيير مقياسه
de: Wählen Sie das zu skalierende Objekt
ja: 拡大縮小するオブジェクトを選択
nl: Selecteer het te vermenigvuldigen object

source: Scale over this line
ar: غيّر المقياس على هذا الخط
de: An dieser Gerade skalieren
ja: この直線に対して拡大縮小
nl: Vermenigvuldig in deze lijn

source: Select the line to scale over
ar: اختر الخط المراد تغيير المقياس عليه
de: Wählen Sie die Gerade, an der skaliert werden soll
ja: 拡大縮小の軸となる直線を選択
nl: Vermenigvuldig met de lengte van dit lijnstuk

source: Projectively rotate this object
ar: دوّر هذا الكائن إسقاطيًا
de: Dieses Objekt projektiv drehen
ja: このオブジェクトを射影的に回転
nl: Dit object projectief roteren

source: Select the object to rotate projectively
ar: اختر الكائن المراد تدويره إسقاطيًا
de: Wählen Sie ein projektiv zu drehendes Objekt
ja: 射影的に回転するオブジェクトを選択
nl: Selecteer het object dat projectief moet worden geroteerd

source: Projectively rotate with this half-line
ar: دوّر إسقاطيًا بنصف الخط هذا
de: Projektiv drehen an diesem Strahl
ja: この半直線で射影的に回転
nl: Projectief roteren met deze halve rechte lijn

source: Select the half line of the projective rotation that you want to apply to the object
ar: اختر نصف خط الدوران الإسقاطي الذي تريد تطبيقه على الكائن
de: Wählen Sie den Strahl der projektiven Drehung, die Sie auf das Objekt anwenden möchten.
ja: オブジェクトをどの半直線で射影的に回転させるかを選択
nl: Selecteer de rechte halve lijn voor de projectieve rotatie die u op het object wilt toepassen

source: Projectively rotate by this angle
ar: دوّر إسقاطيًا بهذه الزاوية
de: Projektive Drehung um diesen Winkel
ja: この角で射影的に回転
nl: Projectief roteren over deze hoek

source: Select the angle of the projective rotation that you want to apply to the object
ar: اختر زاوية الدوران الإسقاطي الذي تريد تطبيقه على الكائن
de: Wählen Sie den Winkel der projektiven Drehung, die Sie auf das Objekt anwenden möchten.
ja: オブジェクトをどの角で射影的に回転させるかを選択
nl: Selecteer de hoek van de projectieve rotatie op dit object

source: Harmonic Homology of this object
ar: التشابه التآلفي لهذا الكائن
de: Harmonische Homologie dieses Objektes
ja: このオブジェクトの調和ホモロジー
nl: Harmonische homologie van dit object

source: Select the object to transform...
ar: اختر الكائن المراد تحويله...
de: Wählen Sie das zu transformierende Objekt ...
ja: 変換するオブジェクトを選択...
nl: Selecteer het object dat moet worden getransformeerd...

source: Harmonic Homology with this center
ar: تشابه تآلفي بهذا المركز
de: Harmonische Homologie mit diesem Mittelpunkt
ja: この中心での調和ホモロジー
nl: Harmonische homologie vanuit dit punt

source: Select the center point of the harmonic homology...
ar: اختر نقطة مركز التشابه التآلفي...
de: Wählen Sie den Mittelpunkt dieser harmonischen Homologie ...
ja: 調和ホモロジーの中心点を選択...
nl: Selecteer het uitgangspunt voor de harmonische homologie...

source: Harmonic Homology with this axis
ar: تشابه تآلفي بهذا المحور
de: Harmonische Homologie mit dieser Achse
ja: この軸での調和ホモロジー
nl: Harmonische homologie met deze as

source: Select the axis of the harmonic homology...
ar: اختر محور التشابه التآلفي...
de: Wählen Sie die Achse der harmonischen Homologie ...
ja: 調和ホモロジーの軸を選択...
nl: Selecteer de as voor de harmonische homologie...

source: Generic affinity of this object
ar: التآلف العام لهذا الكائن
de: Generische Affinität dieses Objektes
ja: このオブジェクトのアフィン変換
nl: Algemene affiene afbeelding van dit object

source: Map this triangle
ar: ارسم هذا المثلث
de: Dieses Dreieck abbilden
ja: この三角形を移す
nl: Beeld deze driehoek af

source: Select the triangle that has to be transformed onto a given triangle...
ar: اختر المثلث الذي يجب تحويله إلى مثلث آخر...
de: Wählen Sie das Dreieck, das auf ein gegebenes transformiert werden soll ...
ja: アフィン変換を決定する三角形の、変換元の三角形を選択...
nl: Selecteer de driehoek die naar een gegeven driehoek moet worden getransformeerd...

source: onto this other triangle
ar: إلى هذا المثلث الآخر
de: auf dieses andere Dreieck
ja: この別の三角形上に
nl: op deze andere driehoek

source: Select the triangle that is the image by the affinity of the first triangle...
ar: اختر المثلث الذي يمثل صورة المثلث الأول بالتشابه التآلفي...
de: Wählen Sie das Dreieck das ein Abbild des ersten Dreiecks sein soll ...
ja: アフィン変換を決定する三角形の、写像となる三角形を選択...
nl: Selecteer de driehoek die de affiene afbeelding is van de de eerste driehoek...

source: First of 3 starting points
ar: النقطة الأولى من 3 نقاط بداية
de: Der erste von 3 Startpunkten
ja: 3 つの始点の 1 番目
nl: Eerste van 3 beginpunten

source: Select the first of the three starting points of the generic affinity...
ar: اختر النقطة الأولى من نقاط البداية الثلاث للتآلف العام...
de: Wählen Sie den ersten der drei Startpunkte der generischen Affinität ...
ja: アフィン変換を決定する 3 点のうち 1 番目の、変換元の位置を選択...
nl: Selecteer het eerste van de drie beginpunten van de algemene affiene afbeelding...

source: Second of 3 starting points
ar: النقطة الثانية من 3 نقاط بداية
de: Der zweite von 3 Startpunkten
ja: 3 つの始点の 2 番目
nl: Tweede van 3 beginpunten

source: Select the second of the three starting points of the generic affinity...
ar: اختر النقطة الثانية من نقاط البداية الثلاث للتآلف العام...
de: Wählen Sie den zweiten von drei Startpunkten für die generische Affinität ...
ja: アフィン変換を決定する 3 点のうち 2 番目の、変換元の位置を選択...
nl: Selecteer het tweede van de drie beginpunten van de algemene affiene afbeelding...

source: Third of 3 starting points
ar: النقطة الثالثة من 3 نقاط بداية
de: Der dritte von 3 Startpunkten
ja: 3 つの始点の 3 番目
nl: Derde van 3 beginpunten

source: Select the third of the three starting points of the generic affinity...
ar: اختر النقطة الثالثة من نقاط البداية الثلاث للتآلف العام...
de: Wählen Sie den dritten von drei Startpunkten für die generische Affinität ...
ja: アフィン変換を決定する 3 点のうち 3 番目の、変換元の位置を選択...
nl: Selecteer het derde van de drie beginpunten van de algemene affiene afbeelding...

source: Transformed position of first point
ar: الموضع المحوّل للنقطة الأولى
de: Transformierte Position des ersten Punktes
ja: 1 番目の点の移される位置
nl: Getransformeerde positie van het eerste punt

source: Select the first of the three end points of the generic affinity...
ar: اختر النقطة الأولى من نقاط النهاية الثلاث للتآلف العام...
de: Wählen Sie den ersten der drei Endpunkte der generischen Affinität ...
ja: アフィン変換を決定する 3 点のうち 1 番目の、写像の位置を選択...
nl: Selecteer het eerste van de drie getransformeerde punten van de algemene affiene afbeelding...

source: Transformed position of second point
ar: الموضع المحوّل للنقطة الثانية
de: Transformierte Position des zweiten Punktes
ja: 2 番目の点の移される位置
nl: Getransformeerde positie van het tweede punt

source: Select the second of the three end points of the generic affinity...
ar: اختر النقطة الثانية من نقاط النهاية الثلاث للتآلف العام...
de: Wählen Sie den zweiten der drei Endpunkte der generischen Affinität ...
ja: アフィン変換を決定する 3 点のうち 2 番目の、写像の位置を選択...
nl: Selecteer het tweede van de drie getransformeerde punten van de algemene affiene afbeelding...

source: Transformed position of third point
ar: الموضع المحوّل للنقطة الثالثة
de: Transformierte Position des dritten Punktes
ja: 3 番目の点の移される位置
nl: Getransformeerde positie van het derde punt

source: Select the third of the three end points of the generic affinity...
ar: اختر النقطة الثالثة من نقاط النهاية الثلاث للتآلف العام...
de: Wählen Sie den dritten der drei Endpunkte der generischen Affinität ...
ja: アフィン変換を決定する 3 点のうち 3 番目の、写像の位置を選択...
nl: Selecteer het derde van de drie getransformeerde punten van de algemene affiene afbeelding...

source: Generic projective transformation of this object
ar: التحويل الإسقاطي العام لهذا الكائن
de: Generische projektive Transformation dieses Objektes
ja: このオブジェクトの一般的な射影変換
nl: Algemene projectieve transformatie van dit object

source: Map this quadrilateral
ar: ارسم هذا الشكل الرباعي
de: Dieses Viereck abbilden
ja: この四角形を移す
nl: Beeld deze vierhoek af
