Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: with this Cubic Curve
ar: بهذا المنحنى المكعّب
de: mit dieser kubischen Kurve
ja: この三次曲線と交わる
nl: met deze derdegraads kromme

source: with this Arc
ar: بهذا القوس
de: mit diesem Bogen
ja: この弧と交わる
nl: met deze cirkelboog

source: with this Polygon
ar: بهذا المضلّع
de: mit diesem Polygon
ja: この多角形と交わる
nl: met deze veelhoek

source: with this Polygonal
ar: بهذا الخطّ المضلّع
de: mit dieser Polylinie
nl: met deze veelhoek

source: Construct midpoint of this point and another one
ar: أنشئ نقطة المنتصف لهذه النّقطة ونقطة أخرى
de: Konstruiert den Mittelpunkt dieses Punktes und eines anderen
nl: Teken het midden van dit punt en een ander punt

source: Select the first of the points of which you want to construct the midpoint...
ar: اختر النّقطة الأولى التي تريد إنشاء نقطة منتصف لها…
de: Wählen Sie den ersten der Punkte, von denen Sie den Mittelpunkt konstruieren möchten ...
ja: 中点を作成する最初の点を選択...
nl: Selecteer het eerste van de punten waarvan u het midden wilt tekenen...

source: Construct the midpoint of this point and another one
ar: أنشئ نقطة منتصف لهذه النّقطة ونقطة أخرى
de: Konstruiert den Mittelpunkt dieses Punktes und eines anderen
ja: この点ともう 1 つの点の中点を作成
nl: Teken het midden van dit punt en een ander punt

source: Select the other of the points of which to construct the midpoint...
ar: اختر النّقطة الأخرى التي تريد إنشاء نقطة منتصف لها…
de: Wählen Sie den anderen der Punkte, von denen Sie den Mittelpunkt konstruieren möchten ...
ja: 中点を作成するもう一方の点を選択...
nl: Selecteer het andere van de punten waarvan u het midden wilt tekenen...

source: Construct golden ratio point of this point and another one
ar: أنشئ نقطة النّسبة الذّهبيّة لهذه النّقطة ونقطة أخرى
de: Konstruiert den goldenen Schnitt dieses Punktes und eines anderen
nl: Teken de gulden snede van dit punt en een ander

source: Select the first of the points of which you want to construct the golden ratio point...
ar: اختر النّقطة الأولى التي تريد إنشاء نقطة النّسبة الذّهبيّة لها…
de: Wählen Sie den ersten der Punkte, von denen Sie den goldenen Schnitt konstruieren möchten ...
nl: Selecteer het eerste van de punten waarvan u de gulden snede wilt tekenen...

source: Construct the golden ratio point of this point and another one
ar: أنشئ نقطة النّسبة الذّهبيّة لهذه النّقطة ونقطة أخرى
de: Konstruiert den goldenen Schnitt dieses Punktes und eines anderen
nl: Teken de gulden snede van dit punt en een ander

source: Select the other of the points of which to construct the golden ratio point...
ar: اختر النّقطة الأخرى التي تريد إنشاء نقطة النّسبة الذّهبيّة لها…
de: Wählen Sie den anderen der Punkte, von denen Sie den goldenen Schnitt konstruieren möchten ...
nl: Selecteer het andere van de punten waarvan u de gulden snede wilt tekenen...

source: Select the first object to intersect...
ar: اختر الكائن الأوّل للتّقاطع…
de: Wählen Sie das erste Objekt für die Schnittmenge ...
ja: 交差させる 1 番目のオブジェクトを選択...
nl: Selecteer het eerste object dat u wilt laten snijden...

source: Select the second object to intersect...
ar: اختر الكائن الثّاني للتّقاطع…
de: Wählen Sie das zweite Objekt für die Schnittmenge ...
ja: 交差させる 2 番目のオブジェクトを選択...
nl: Selecteer het tweede object dat u wilt laten snijden...

source: Tangent
ar: الظل
de: Tangente
ja: 接線
nl: Raaklijn

source: The line tangent to a curve
ar: الخطّ المماسّ لمنحنى
de: Die Tangente an einer Kurve
ja: 曲線に接する直線
nl: De raaklijn aan een kromme

source: Tangent to This Circle
ar: مماسّ لهذه الدّائرة
de: Tangente an diesem Kreis
ja: この円の接線
nl: Raaklijn aan deze cirkel

source: Tangent to This Conic
ar: مماسّ لهذا المقطع المخروطيّ
de: Tangente an diesem Kegelschnitt
ja: この二次曲線の接線
nl: Raaklijn aan deze kegelsnede

source: Tangent to This Arc
ar: مماسّ لهذا القوس
de: Tangente an diesem Kreisbogen
ja: この弧の接線
nl: Raaklijn aan deze cirkelboog

source: Tangent to This Cubic Curve
ar: مماسّ لمنحنى المكعّب هذا
de: Tangente an dieser kubischen Kurve
ja: この三次曲線の接線
nl: Raaklijn aan deze derdegraads kromme

source: Tangent to This Curve
ar: مماسّ لهذا المنحنى
de: Tangente an diesem Kreis
ja: この曲線の接線
nl: Raaklijn aan deze kromme

source: Tangent at This Point
ar: مماسّ عند هذه النّقطة
de: Tangente in diesem Punkt
ja: この点における接線
nl: Raaklijn in dit punt

source: Center Of Curvature
ar: مركز الانحناء
de: Zentrum einer Krümmung
ja: 曲率中心
nl: Krommingsmiddelpunt

source: The center of the osculating circle to a curve
ar: مركز الدّائرة المتلامسة بمنحنى
de: Das Zentrum dieser Schmiegungskurve zu einer Kurve
ja: 曲線の接触円の中心
nl: Het middelpunt van de osculerende cirkel aan een kromme

source: Center of Curvature of This Conic
ar: مركز انحناء هذا المقطع المخروطيّ
de: Zentrum der Krümmung dieses Kegelschnitts
ja: この二次曲線の曲率中心
nl: Krommingsmiddelpunt van deze kegelsnede

source: Center of Curvature of This Cubic Curve
ar: مركز انحناء منحنى المكعّب هذا
de: Zentrum der Krümmung dieser kubischen Kurve
ja: この三次曲線の曲率中心
nl: Krommingsmiddelpunt van deze derdegraads kromme

source: Center of Curvature of This Curve
ar: مركز انحناء هذا المنحنى
de: Zentrum der Krümmung dieser Kurve
ja: この曲線の曲率中心
nl: Krommingsmiddelpunt van deze kromme

source: Center of Curvature at This Point
ar: مركز الانحناء عند هذه النّقطة
de: Zentrum der Krümmung an diesem Punkt
ja: この点における曲率中心
nl: Krommingsmiddelpunt in dit punt

# Translators: Pixel
source: pixel
ar: بكسل
ja: ピクセル

# Translators: Centimeter
source: cm
ar: سم

# Translators: Inch
source: in
ar: في
de: Zoll
ja: インチ
nl: inch

source: Which object?
ar: أيّ كائن؟
de: Welches Objekt?
ja: どのオブジェクトですか？
nl: Welk object?

source: Click the location where you want to place the new point, or the curve that you want to attach it to...
ar: انقر على الموقع الذي تريد وضع النّقطة الجديدة فيه، أو على المنحنى الذي تريد إرفاقها به…
de: Klicken Sie auf einen Ort, an dem Sie den neuen Punkt platzieren möchten, oder auf die Kurve, an der Sie den Punkt anbringen möchten ...
ja: 新しい点を置く位置、または新しい点を付け加える曲線をクリック...
nl: Klik op de positie waar u het nieuwe punt wilt plaatsen, of de kromme waarop het moet liggen...

source: Now select the location for the result label.
ar: الآن اختر موقع وسم النّتيجة.
de: Wählen Sie nun die Position für das Resultatsfeld.
ja: 結果ラベルを置く場所を決めてください。
nl: Kies nu de plaats waar het bijschrift bij het resultaat moet komen.

# @title:window
source: Edit Type
ar: حرّر النّوع
de: Typ bearbeiten
nl: Type bewerken

source: Here you can edit the name of the current macro type.
ar: هنا يمكنك تحرير اسم نوع الماكرو الحاليّ.
de: Hier können Sie den Namen für den aktuellen Makrotyp bearbeiten.
ja: 現在のマクロタイプの名前をここで編集できます。
nl: Hier kunt u de naam van dit macrotype wijzigen.

source: Here you can edit the description of the current macro type. This field is optional, so you can also leave this empty: if you do so, then your macro type will have no description.
ar: هنا يمكنك تحرير وصف نوع الماكرو الحاليّ. هذا الحقل اختياريّ، فيمكنك تركه فارغًا: إذا فعلت ذلك، فلن يكون لنوع الماكرو الخاصّ بك أيّ وصف.
de: Hier können Sie die Beschreibung des aktuellen Makrotyps bearbeiten. Dieses Feld ist optional, Sie können es also leer lassen: Falls Sie dies tun, wird Ihr Makro keine Beschreibung haben.
ja: ここで現在のマクロタイプの説明を編集できます。このフィールドはオプション扱いなので、空欄にしておいてもかまいません。この場合、そのマクロタイプは説明なしとなります。
nl: Hier kunt u de beschrijving wijzigen van dit macrotype. Dit veld is optioneel, dus u kunt het ook leeg laten: in dat geval heeft uw macrotype geen beschrijving.

source: Use this button to change the icon of the current macro type.
ar: استخدم هذا الزّرّ لتغيير أيقونة نوع الماكرو الحاليّ.
de: Benutzen Sie diesen Knopf, um das Symbol für den aktuellen Makrotyp zu verändern.
ja: 現在のマクロタイプのアイコンを変えるには、このボタンを使います。
nl: Met deze knop kunt u het pictogram van dit macrotype wijzigen.

source: The name of the macro can not be empty.
ar: لا يمكن أن يكون اسم الماكرو فارغًا.
de: Der Name des Makros kann nicht leer sein.
ja: マクロの名前は空にできません。
nl: De naam van de macro moet minstens één teken bevatten.

source: Here you can modify the name, the description and the icon of this macro type.
ar: هنا يمكنك تحوير الاسم والوصف والأيقونة لهذا النّوع من الماكرو.
de: Hier können Sie den Namen, die Beschreibung und das Symbol für diesen Makrotyp bearbeiten.
ja: このマクロタイプの名前、詳細、アイコンをここで修正できます。
nl: Hier kunt u de naam, de beschrijving en het pictogram van dit macrotype wijzigen.

source: Name:
ar: الاسم:
ja: 名前:
nl: Naam:

source: Description:
ar: الوصف:
de: Beschreibung:
ja: 説明:
nl: Beschrijving:

# @title:window
source: History Browser
ar: متصفّح التّاريخ
de: Verlaufsansicht
nl: Geschiedenis browser

source: Start of the construction
ar: بدء الإنشاء
de: Start einer Konstruktion
ja: 作成の開始
nl: Start van de constructie

source: Description of the current step:
ar: وصف الخطوة الحاليّة:
de: Beschreibung des aktuellen Schrittes:
ja: 現在のステップの説明:
nl: Beschrijving van de huidige stap:

source: First step
ar: الخطوة الأولى
de: Erster Schritt
ja: 最初のステップ
nl: Eerste stap

source: One step back
ar: خطوة للوراء
de: Einen Schritt zurück
ja: 1 ステップ戻る
nl: Een stap terug

source: One step forward
ar: خطوة للأمام
de: Einen Schritt vor
ja: 1 ステップ進む
nl: Een stap vooruit

source: Last step
ar: الخطوة الأخيرة
de: Letzter Schritt
ja: 最後のステップ
nl: Laatste stap

source: Name
ar: الاسم
ja: 名前
nl: Naam

source: <unnamed object>
ar: <كائن غير مسمّى>
de: <unbenanntes Objekt>
ja: <名前なしオブジェクト>
nl: <naamloos object>

source: There are '%n' parts in the text that you have not selected a value for. Please remove them or select enough arguments.
ar: يوجد %n أجزاء في النّصّ لم تختر لها قيمة. أزلها أو اختر وسائط كافية.
de: Es gibt „%n“ Teile im Text, für die Sie noch keinen Wert ausgewählt haben. Bitte entfernen Sie sie oder wählen Sie genug Argumente.
ja: 値が設定されていない変数が、テキスト中に %n 個あります。それらを削除するか、必要なだけの変数を設定してください。
nl: Er zijn '%n' onderdelen in de tekst waarvoor geen waarde is opgegeven. Verwijder ze of selecteer voldoende argumenten.

source: argument %1
ar: وسيط %1
ja: 変数 %1

source: Selecting argument %1
ar: اختيار الوسيط %1
de: Argument %1 auswählen
ja: 変数 %1 を選択
nl: Selecteer argument %1

source: Change Label
ar: غيّر الوسم
de: Textfeld verändern
ja: ラベルを変更
nl: Bewerk bijschrift

source: Set Value
ar: اضبط القيمة
de: Wert setzen
ja: 値を設定
nl: Waarde instellen

source: Enter value:
ar: أدخل القيمة:
de: Wert eingeben:
ja: 値を入力:
nl: Waarde invoeren:

source: Select the position for the new numeric value...
ar: اختر موضع القيمة العدديّة الجديدة…
de: Wählen Sie die Position für den neuen numerischen Wert ...
ja: 新しい数値の位置を選択...
nl: Selecteer de positie van de nieuwe getalswaarde...

source: One of the result objects you selected cannot be calculated from the given objects. Kig cannot calculate this macro because of this. Please press Back, and construct the objects in the correct order...
ar: لا يمكن حساب أحد كائنات النّتيجة التي اخترتها من الكائنات المعطاة. لا يستطيع كيج حساب هذا الماكرو بسبب ذلك. اضغط على «الخلف»، وأنّشئ الكائنات بالترتيب الصحيح…
de: Eines der Ergebnisobjekte, die Sie ausgewählt haben, kann nicht aus den gegebenen Objekt errechnet werden. Kig kann dieses Makro deswegen nicht berechnen. Bitte drücken Sie Zurück und konstruieren Sie die Objekte in der richtigen Reihenfolge ...
ja: あなたが選んだ結果オブジェクトの 1 つは、引数オブジェクトから計算できません。このため、Kig はこのマクロの計算ができません。戻るボタンを押して、正しい順序でオブジェクトを選んでください...
nl: Een van de geselecteerde resultaatobjecten kan niet worden berekend met behulp van de gegeven objecten. Kig kan daarom deze macro niet uitvoeren. Klikt u op "Terug", en teken de objecten in de juiste volgorde...

source: One of the given objects is not used in the calculation of the resultant objects. This probably means you are expecting Kig to do something impossible. Please check the macro and try again.
ar: أحد الكائنات المعطاة لا يُستخدم في حساب الكائنات الناتجة. ربّما هذا يعني أنك تتوقع أن يفعل كيج شيئًا مستحيلًا. رجاءً، تفحّص الماكرو وحاول ثانية.
de: Eines der gegebenen Objekte wird nicht für die Berechnung der Resultatobjekte benutzt. Das bedeutet womöglich, dass Sie etwas erwarten, was Kig nicht kann. Bitte überprüfen Sie das Makro und versuchen Sie es erneut.
ja: 引数オブジェクトの 1 つが、結果オブジェクトの計算に使われていません。これはおそらく、あなたが Kig にできないことを期待しているためだと思われます。マクロをチェックしてやり直してみてください。
nl: Een van de gegeven objecten is niet nodig voor de berekening van de resultaatobjecten. Dit betekent dat u misschien van Kig het onmogelijke verlangt. Controleert u de macro en probeert u het dan nog eens.

source: Given Objects
ar: كائنات معطاة
de: Gegebene Objekte
ja: 引数のオブジェクト
nl: Gegeven objecten

source: Select the "given" objects for your new macro and press "Next".
ar: اختر الكائنات «المعطاة» للماكرو الجديد الخاصّ بك واضغط على «التّالي».
de: Wählen Sie die „gegebenen“ Objekte für Ihr neues Makro und drücken Sie „Weiter“.
ja: 新しいマクロの引数に相当するオブジェクトを選んで「次へ」を押してください。
nl: Selecteer de "gegeven" objecten voor uw nieuwe macro en druk op "Volgende".

source: Final Object
ar: الكائن النّهائيّ
de: Endobjekt
ja: 結果のオブジェクト
nl: Doelobject

source: Select the final object(s) for your new macro.
ar: اختر الكائن (الكائنات) النّهائيّ للماكرو الجديد الخاصّ بك.
de: Wählen Sie das Endobjekt für Ihr neues Makro.
ja: 新しいマクロの計算結果に相当するオブジェクトを選択してください。
nl: Selecteer doelobject(en) voor uw nieuwe macro.

source: Enter a name and description for your new type.
ar: أدخل اسمًا ووصفًا لنوعك الجديد.
de: Geben Sie einen Namen und eine Beschreibung für den neuen Typ ein.
ja: 新しいタイプの名前と説明を入力してください。
nl: Voer naam en beschrijving in van uw nieuwe type.

source: &Name:
ar: الا&سم:
ja: 名前(&N):
nl: &Naam:

source: &Description:
ar: الو&صف:
de: &Beschreibung:
ja: 説明(&D):
nl: &Beschrijving:

source: &Icon:
ar: الأي&قونة:
de: &Symbol:
ja: アイコン(&I):
nl: &Pictogram:

# @title:window
source: Define New Macro
ar: عرّف ماكرو جديدًا
de: Neues Makro definieren
nl: Nieuwe macro maken

source: Move %1 Object
ar: انقل %1 كائن
de: %1 Objekt verschieben
ja: %1 個のオブジェクトを移動
nl: %1 object verplaatsen

source: Redefine Point
ar: أعد تعريف النّقطة
de: Punkt neu definieren
ja: 点の再定義
nl: Punt opnieuw definiëren

source: Black
ar: أسود
de: Schwarz
ja: 黒
nl: Zwart

source: Gray
ar: الرّصاصيّ
de: Grau
ja: グレー
nl: Grijs

source: Red
ar: أحمر
de: Rot
ja: 赤
nl: Rood

source: Green
ar: أخضر
de: Grün
ja: 緑
nl: Groen

source: Cyan
ar: سماوي
ja: シアン
nl: Cyaan

source: Yellow
ar: أصفر
de: Gelb
ja: 黄色
nl: Geel

source: Dark Red
ar: أحمر داكن
de: Dunkelrot
ja: えんじ
nl: Donkerrood

source: &Hide
ar: أ&خفِ
de: &Ausblenden
ja: 隠す(&H)
nl: Ver&bergen

source: &Show
ar: ا&عرض
de: &Zeigen
ja: 表示(&S)
nl: T&onen

source: &Move
ar: ا&نقل
de: &Verschieben
ja: 移動(&M)
nl: Ver&plaatsen

source: &Delete
ar: ا&حذف
de: &Löschen
ja: 削除(&D)
nl: &Wissen

source: &Custom Color
ar: لون &مخصّص
de: &Eigene Farbe
ja: カスタム色(&C)
nl: &Eigen kleur

source: Change Object Color
ar: غيّر لون الكائن
de: Objektfarbe verändern
ja: オブジェクト色を変更
nl: Bewerk kleur van object

source: Change Object Width
ar: غيّر عرض الكائن
de: Objektbreite verändern
ja: オブジェクト幅を変更
nl: Bewerk breedte van object

source: Change Point Style
ar: غيّر نمط النّقطة
de: Punktstil verändern
ja: 点のスタイルを変更
nl: Bewerk eigenschappen punt

source: Change Object Style
ar: غيّر نمط الكائن
de: Objektstil verändern
ja: オブジェクトのスタイルを変更
nl: Bewerk eigenschappen object

source: Set &Name...
ar: &ضع الاسم...
de: &Name einstellen ...
ja: 名前を設定(&N)...
nl: Geef &Naam...

source: &Name
ar: الا&سم:
ja: 名前(&N)
nl: &Naam

source: Set Object Name
ar: اضبط اسم الكائن
de: Objektname festlegen
ja: オブジェクト名を設定
nl: Object een naam geven

source: Set Name of this Object:
ar: اضبط اسم هذا الكائن:
de: Name dieses Objektes festlegen:
ja: このオブジェクトの名前を設定:
nl: Geef dit object een naam:

source: %1 Object
ar: جرم
de: Ein Objekt
ja: %1 個のオブジェクト

source: Kig Document
ar: مستند كيج
de: Kig-Dokument
ja: Kig 文書

source: &Transform
ar: &تحويل
de: &Umformen
ja: 変換(&T)
nl: &Transformeren

source: T&est
ar: ا&ختبر
ja: テスト(&E)

source: Const&ruct
ar: ا&نشئ
de: Konst&ruieren
ja: 作成(&R)
nl: Teke&nen

source: &Start
ar: ا&بدأ
ja: 開始(&S)

source: Add Te&xt Label
ar: أضف و&سمًا نصّيًّا
de: Te&xtfeld hinzufügen
ja: テキストラベルを追加(&X)
nl: &Bijschrift toevoegen

source: Set Co&lor
ar: ا&ضبط اللّون
de: Farbe wäh&len
ja: 色を設定(&L)
nl: K&leur instellen

source: Set &Pen Width
ar: اضبط عرض الق&لم
de: Stift&breite festlegen
ja: ペン幅を設定(&P)
nl: &Lijnbreedte instellen

source: Set St&yle
ar: اضبط النّم&ط
de: Stil &einrichten
ja: スタイルを設定(&Y)
nl: St&ijl instellen

source: Set Coordinate S&ystem
ar: اضبط نظام الإ&حداثيات
de: &Koordinatensystem wählen
ja: 座標系を設定(&Y)
nl: &Coördinatenstelsel instellen

# More menu items
source: More...
ar: المزيد…
de: Weitere ...
nl: En meer...

source: Edit Script...
ar: حرّر السّكربت...
de: Skript bearbeiten ...
nl: Script bewerken...

source: Enter Label Text
ar: أدخل نصّ الوسم
de: Geben Sie den Text ein
ja: ラベルのテキストを入力
nl: Voer bijschrift in

source: Enter the text for your label here and press "Next". If you want to show variable parts, then put %1, %2, ... at the appropriate places (e.g. "This segment is %1 units long.").
ar: أدخل نصّ وسمك هنا واضغط على «التّالي». إذا أردت عرض أجزاء متغيّرة، فضع %1، %2، … في الأماكن المناسبة (مثال: «هذه القطعة طولها %1 وحدة.»).
de: Geben Sie hier einen Text für Ihr Textfeld ein und drücken Sie „Weiter“ bzw. „Abschließen“. Wenn Sie veränderliche Teile zeigen möchten, fügen Sie %1, %2, an der passenden Stelle ein (z. B. „Diese Strecke ist %1 Einheiten lang.“).
ja: ここにラベルのテキストを入力して「次へ」を押してください。 変数を表示する場合は、%1, %2, ... を適切な場所に入れます。 例: この線分の長さは %1
nl: Voer de tekst in voor het bijschrift en druk op "Volgende". Als u variabele onderdelen wilt tonen, plaats dan %1, %2, ... op de juiste plaats (zoals "Dit lijnstuk is %1 eenheden lang.").

source: Show text in a frame
ar: اعرض النّصّ في إطار
de: Text in einem Rahmen anzeigen
ja: テキストを枠で囲む
nl: Tekst in een kader tonen

source: Select Arguments
ar: اختر الوسائط
de: Argumente auswählen
ja: 変数を設定
nl: Selecteer argumenten

source: Now select the argument(s) you need. For every argument, click on it, select an object and a property in the Kig window, and click finish when you are done...
ar: الآن اختر الوسيط (الوسائط) الذي تحتاجه. لكلّ وسيط، انقر عليه، اختر كائنًا وخاصّيّة في نافذة كيج، وانقر على «إنهاء» عند الانتهاء…
de: Nun wählen Sie die Argumente, die Sie brauchen. Klicken Sie auf das Argument, wählen Sie ein Objekt und eine Eigenschaft im Kig-Fenster und klicken auf „Abschließen“, wenn Sie fertig sind ...
ja: ここで変数の内容を設定します。設定する変数をクリックしたあと Kig ウィンドウ中のオブジェクトをクリックしてプロパティを選びます。すべての変数を設定したら「完了」をクリックしてください。
nl: Selecteer nu de benodigde argument(en). Voor elk argument:klik erop, selecteer in het Kig-venster een object en een eigenschap en klik op Voltooien als u klaar bent...

# @title:window
source: Construct Label
ar: أنشئ وسمًا
de: Textfeld konstruieren
nl: Maak een bijschrift

source: Macro
ar: ماكرو
de: Makro
ja: マクロ

source: Type
ar: النّوع
de: Typ
ja: タイプ

source: Description
ar: الوصف
de: Beschreibung
ja: 説明
nl: Beschrijving

# @title:window
source: Manage Types
ar: أدِر الأنواع
de: Typen verwalten
nl: Typen beheren

source: &Edit...
ar: &حرّر...
de: &Bearbeiten ...
ja: 編集(&E)...
nl: B&ewerken...

source: E&xport...
ar: ص&در...
de: E&xportieren ...
ja: エクスポート(&X)...
nl: E&xporteren...

source: Are you sure you want to delete this type?
ar: هل أنت متأكّد من حذف هذا النّوع؟
de: Möchten Sie diesen Typ wirklich löschen?
ja: 本当にこのタイプを削除しますか？
nl: Wilt u dit type echt wissen?

source: Are You Sure?
ar: هل أنت متأكد؟
de: Sind Sie sicher?
ja: 本当によろしいですか？
nl: Weet u het zeker?

source: Export Types
ar: صدّر الأنواع
de: Typen exportieren
ja: タイプをエクスポート
nl: Typen exporteren

source: Kig Types Files (*.kigt);;All Files (*)
ar: ملفّات أنواع كيج (*.kigt);;كلّ الملفّات (*)
de: Kig-Typdateien (*.kigt);;All Files (*)
nl: Kig-typen-bestanden (*.kigt);;Alle bestanden (*)

source: Kig Types Files (*.kigt)
ar: ملفّات أنواع كيج (*.kigt)
de: Kig-Typdateien (*.kigt)
nl: Kig-typen-bestanden (*.kigt)

source: Geogebra Tool Files (*.ggt)
ar: ملفّات أدوات جيوجبرا (*.ggt)
de: Geogebra-Extradateien (*.ggt)
nl: Geogebra Tool-bestanden (*.ggt)

source: All Files (*)
ar: كلّ الملفّات (*)
de: Alle Dateien (*)
nl: Alle bestanden (*)

source: Import Types
ar: استورد الأنواع
de: Typen importieren
ja: タイプをインポート
nl: Typen importeren

source: There is more than one type selected. You can only edit one type at a time. Please select only the type you want to edit and try again.
ar: يوجد أكثر من نوع واحد مختار. يمكنك تحرير نوع واحد في المرّة. رجاءً، اختر فقط النّوع الذي تريد تحريره وحاول ثانية.
de: Es ist mehr als ein Typ ausgewählt. Sie können nur einen Typ gleichzeitig bearbeiten. Bitte wählen Sie den Typ, den Sie bearbeiten möchten, und versuchen Sie es erneut.
ja: 2 つ以上のタイプが選択されています。一度に 1 つのタイプしか編集できません。編集するタイプのみを選んでやり直してください。
nl: Er zijn meerdere typen geselecteerd. U kunt per keer slechts één type bewerken. Selecteert u alleen het type dat u wilt bewerken en probeer het nog een keer.

source: More Than One Type Selected
ar: أكثر من نوع واحد مختار
de: Mehr als ein Typ ausgewählt
ja: 2 つ以上のタイプが選択されています
nl: Meer dan één type geselecteerd

source: Select types here...
ar: اختر الأنواع هنا…
de: Wählen Sie hier die Typen ...
ja: ここにあるタイプを選択...
nl: Typen hier selecteren...

source: This is a list of the current macro types... You can select, edit, delete, export and import them...
ar: هذه قائمة بأنواع الماكرو الحاليّة… يمكنك اختيارها، وتحريرها، وحذفها، وتصديرها، واستيرادها…
de: Das ist eine Liste der aktuellen Makrotypen. Sie können sie auswählen, bearbeiten, löschen, exportieren und importieren.
ja: これは現在のマクロタイプの一覧です... これらの選択、編集、削除、インポート、エクスポートができます...
nl: Dit is een lijst met de huidige macrotypen... U kunt ze selecteren, bewerken, verwijderen, exporteren en importeren...

source: Edit the selected type.
ar: حرّر النّوع المختار.
de: Bearbeitet den ausgewählten Typ.
ja: 選択したタイプを編集します。
nl: Het geselecteerde type bewerken.

source: Delete all the selected types in the list.
ar: احذف كلّ الأنواع المختارة في القائمة.
de: Löscht alle ausgewählten Typen in der Liste.
ja: 選択したすべてのタイプをリストから削除します。
nl: Alle geselecteerde objecten in deze lijst verwijderen.

source: Export all the selected types to a file.
ar: صدّر كلّ الأنواع المختارة إلى ملفّ.
de: Exportiert alle ausgewählten Typen in eine Datei.
ja: 選択したすべてのタイプをファイルにエクスポートします。
nl: Alle geselecteerde typen naar een bestand exporteren.

source: Import macros that are contained in one or more files.
ar: استورد الماكرو التي يحتويها ملفّ أو أكثر.
de: Importiert Makros, die in einer oder mehreren Dateien enthalten sind.
ja: 1 つまたは複数のファイルからマクロをインポートします。
nl: Importeer macro's in een of meer bestanden.

source: &Import...
ar: ا&ستورد...
de: &Importieren ...
ja: インポート(&I)...
nl: &Importeren...

source: Construct an angle through this point
ar: أنشئ زاوية عبر هذه النّقطة
de: Einen Winkel durch diesen Punkt konstruieren
ja: この点を通る角を作成
nl: Teken een hoek door dit punt

source: Select a point that the first half-line of the angle should go through...
ar: اختر نقطة ينبغي أن يمرّ نصف الخطّ الأوّل للزّاوية عبرها…
de: Wählen Sie den Punkt, durch den der erste Schenkel des Winkels gehen soll ...
ja: 角をなす半直線の 1 番目が通るべき点を選択...
nl: Selecteer een punt dat op het eerste been van de hoek ligt...

source: Construct an angle at this point
ar: أنشئ زاوية عند هذه النّقطة
de: Einen Winkel an diesem Punkt konstruieren
ja: この点における角を作成
nl: Teken een hoek in dit punt

source: Select the point to construct the angle in...
ar: اختر النّقطة لإنشاء الزّاوية فيها…
de: Wählen Sie den Punkt, in dem der Winkel konstruiert werden soll.
ja: 角を作成する点を選択...
nl: Selecteer het punt dat het hoekpunt is...

source: Select a point that the second half-line of the angle should go through...
ar: اختر نقطة ينبغي أن يمرّ نصف الخطّ الثّاني للزّاوية عبرها…
de: Wählen Sie den Punkt, durch den der zweite Schenkel des Winkels gehen soll ...
ja: 角をなす半直線の 2 番目が通るべき点を選択...
nl: Selecteer een punt dat op het tweede been van de hoek ligt...

source: Set Si&ze
ar: اضبط الح&جم
de: &Größe ändern
ja: サイズを設定(&Z)
nl: Grootte in&stellen

source: Toggle &Right Angle Mark
ar: بدّل علامة الزّاوية الي&مين
de: Markierung für &Rechten Winkeln ein-/ausschalten
nl: Driehoek naar &rechts omschakelen
