Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Construct a hyperbola through this point
ar: أنشئ قطعًا زائدًا يمر بهذه النقطة
de: Eine Hyperbel durch diesen Punkt konstruieren
ja: この点を通る双曲線を作成
nl: Teken een hyperbool door dit punt

source: Select a point for the new hyperbola to go through...
ar: اختر نقطة ليمر بها القطع الزائد الجديد...
de: Wählen Sie einen Punkt, durch den die neue Hyperbel gehen soll ...
ja: 新しい双曲線が通る点を選択...
nl: Selecteer een punt dat op de nieuwe hyperbool ligt...

source: Construct a conic with this line as directrix
ar: أنشئ قطعًا مخروطيًا بهذا الخط كدليل
de: Konstruiert einen Kegelschnitt mit dieser Gerade als Leitlinie
ja: この直線を準線として二次曲線を作成
nl: Teken een kegelsnede met deze richtlijn

source: Select the directrix of the new conic...
ar: اختر دليل القطع المخروطي الجديد...
de: Wählen Sie die Leitlinie für den neuen Kegelschnitt ...
ja: 新しい二次曲線の準線を選択...
nl: Selecteer de richtlijn van de nieuwe kegelsnede...

source: Construct a conic with this point as focus
ar: أنشئ قطعًا مخروطيًا بهذه النقطة كبؤرة
de: Einen Kegelschnitt mit diesem Punkt als Brennpunkt konstruieren
ja: この点を焦点として二次曲線を作成
nl: Teken een kegelsnede met dit brandpunt

source: Select the focus of the new conic...
ar: اختر بؤرة القطع المخروطي الجديد...
de: Wählen Sie den Brennpunkt des neuen Kegelschnittes ...
ja: 新しい二次曲線の焦点を選択...
nl: Selecteer het brandpunt van de nieuwe kegelsnede...

source: Construct a parabola through this point
ar: أنشئ قطعًا مكافئًا يمر بهذه النقطة
de: Eine Parabel durch diesen Punkt konstruieren
ja: この点を通る放物線を作成
nl: Teken een parabool door dit punt

source: Select a point for the new parabola to go through...
ar: اختر نقطة ليمر بها القطع المكافئ الجديد...
de: Wählen Sie einen Punkt, durch den die neue Parabel gehen soll ...
ja: 新しい放物線が通る点を選択...
nl: Selecteer een punt dat op de nieuwe parabool ligt...

source: Construct a polar point wrt. this conic
ar: أنشئ نقطة قطبية بالنسبة إلى هذا القطع المخروطي
de: Konstruiert einen Polpunkt anhand dieses Kegelschnittes
ja: この二次曲線に関する極点を作成
nl: Teken een poolpunt bij deze kegelsnede

source: Select the conic wrt. which you want to construct a polar point...
ar: اختر القطع المخروطي الذي تريد إنشاء نقطة قطبية بالنسبة إليه...
de: Wählen Sie den Kegelschnitt, mit dem Sie den Polpunkt konstruieren möchten ...
ja: 極点を作成する二次曲線を選択...
nl: Selecteer de kegelsnede ten opzichte waarvan u een poolpunt wilt tekenen...

source: Construct the polar point of this line
ar: أنشئ النقطة القطبية لهذا الخط
de: Den Polpunkt dieser Gerade konstruieren
ja: この直線の極点を作成
nl: Teken het poolpunt van deze lijn

source: Select the line of which you want to construct the polar point...
ar: اختر الخط الذي تريد إنشاء نقطة قطبية له...
de: Wählen Sie die Gerade, von der Sie den Polpunkt konstruieren möchten ...
ja: 極点を作成する直線を選択...
nl: Selecteer de lijn waarvan u het poolpunt wilt tekenen...

source: Construct a polar line wrt. this conic
ar: أنشئ خطًا قطبيًا بالنسبة إلى هذا القطع المخروطي
de: Konstruiert eine Pollinie anhand dieses Kegelschnittes
ja: この二次曲線に関する極線を作成
nl: Teken een poollijn bij deze kegelsnede

source: Construct the polar line of this point
ar: أنشئ الخط القطبي لهذه النقطة
de: Konstruiert eine Pollinie dieses Punktes
ja: この点の極線を作成
nl: Teken de poollijn van dit punt

source: Construct the directrix of this conic
ar: أنشئ دليل هذا القطع المخروطي
de: Konstruiert die Leitlinie dieses Kegelschnittes
ja: この二次曲線の準線を作成
nl: Teken de richtlijn van deze kegelsnede

source: Select the conic of which you want to construct the directrix...
ar: اختر القطع المخروطي الذي تريد إنشاء دليله...
de: Wählen Sie den Kegelschnitt, dessen Leitlinie Sie konstruieren möchten ...
ja: 準線を作成する二次曲線を選択...
nl: Selecteer de kegelsnede waarvan u de richtlijn wilt tekenen...

source: Construct a parabola with this directrix
ar: أنشئ قطعًا مكافئًا بهذا الدليل
de: Konstruiert eine Parabel mit dieser Leitlinie
ja: この準線による放物線を作成
nl: Teken een parabool met deze richtlijn

source: Select the directrix of the new parabola...
ar: اختر دليل القطع المكافئ الجديد...
de: Wählen Sie die Leitlinie für die neue Parabel ...
ja: 新しい放物線の準線を選択...
nl: Selecteer de richtlijn van de nieuwe parabool...

source: Construct a parabola with this focus
ar: أنشئ قطعًا مكافئًا بهذه البؤرة
de: Konstruiert eine Parabel mit diesem Brennpunkt
ja: この焦点で放物線を作成
nl: Teken een parabool met dit brandpunt

source: Select the focus of the new parabola...
ar: اختر بؤرة القطع المكافئ الجديد...
de: Wählen Sie den Brennpunkt der neuen Parabel ...
ja: 新しい放物線の焦点を選択...
nl: Selecteer het brandpunt van de nieuwe parabool...

source: Construct the asymptotes of this conic
ar: أنشئ محاذيات هذا القطع المخروطي
de: Konstruiert die Asymptoten dieses Kegelschnittes
ja: この二次曲線の漸近線を作成
nl: Teken de asymptoten van deze kegelsnede

source: Select the conic of which you want to construct the asymptotes...
ar: اختر القطع المخروطي الذي تريد إنشاء محاذياته...
de: Wählen Sie den Kegelschnitt, dessen Asymptoten Sie konstruieren möchten ...
ja: 漸近線を作成する二次曲線を選択...
nl: Selecteer de kegelsnede waarvan u de asymptoten wilt tekenen...

source: Construct the radical lines of this conic
ar: أنشئ الخطوط الجذرية لهذا القطع المخروطي
de: Konstruiert die Wurzellinien dieses Kegelschnittes
ja: この二次曲線の根軸を作成
nl: Teken de machtlijnen van deze kegelsnede

source: Select the first of the two conics of which you want to construct the radical line...
ar: اختر الأول من القطعين المخروطيين اللذين تريد إنشاء الخط الجذري لهما...
de: Wählen Sie den ersten der zwei Kegelschnitte, deren Wurzellinien Sie konstruieren möchten ...
ja: 根軸を作成する 2 つの二次曲線の 1 番目を選択...
nl: Selecteer de eerste van de twee kegelsneden waarvan u de machtlijn wilt tekenen...

source: Select the other of the two conic of which you want to construct the radical line...
ar: اختر الآخر من القطعين المخروطيين اللذين تريد إنشاء الخط الجذري لهما...
de: Wählen Sie den zweiten der zwei Kegelschnitte, deren Wurzellinie Sie konstruieren möchten ...
ja: 根軸を作成する 2 つの二次曲線の 2 番目を選択...
nl: Selecteer de tweede van de twee kegelsneden waarvan u de machtlijn wilt tekenen...

source: Switch Radical Lines
ar: بدّل الخطوط الجذرية
de: Wurzellinien umschalten
ja: 二次曲線の根軸を切り替え
nl: Verwissel machtlijnen

source: Switch Conic Radical Lines
ar: بدّل الخطوط الجذرية للقطع المخروطي
de: Wurzellinien für Kegelschnitte umschalten
nl: Verwissel conische machtlijnen

source: cubic curve
ar: منحنى تكعيبي
de: kubische Kurve
ja: 三次曲線
nl: derdegraads kromme

source: Select this cubic curve
ar: اختر هذا المنحنى التكعيبي
de: Diese kubische Kurve auswählen
ja: この三次曲線を選択
nl: Selecteer deze derdegraads kromme

source: Select cubic curve %1
ar: اختر المنحنى التكعيبي %1
de: Kubische Kurve %1 auswählen
ja: 三次曲線 %1 を選択
nl: Selecteer derdegraads kromme %1

source: Remove a Cubic Curve
ar: أزل منحنى تكعيبي
de: Eine kubische Kurve entfernen
ja: 三次曲線を削除
nl: Verwijder een Derdegraads kromme

source: Add a Cubic Curve
ar: أضف منحنى تكعيبي
de: Eine kubische Kurve hinzufügen
ja: 三次曲線を追加
nl: Voeg een derdegraads kromme toe

source: Move a Cubic Curve
ar: حرّك منحنى تكعيبي
de: Eine kubische Kurve verschieben
ja: 三次曲線を移動
nl: Verplaats een derdegraads kromme

source: Attach to this cubic curve
ar: ارفق بهذا المنحنى التكعيبي
de: Zu dieser kubischen Kurve hinzufügen
ja: この三次曲線に付ける
nl: Teken op deze derdegraads kromme

source: Show a Cubic Curve
ar: أظهر منحنى تكعيبي
de: Eine kubische Kurve anzeigen
ja: 三次曲線を表示
nl: Toon een derdegraads kromme

source: Hide a Cubic Curve
ar: أخفِ منحنى تكعيبي
de: Eine kubische Kurve ausblenden
ja: 三次曲線を隠す
nl: Verberg een derdegraads kromme

source: Construct a cubic curve through this point
ar: أنشئ منحنى تكعيبيًا يمر بهذه النقطة
de: Konstruiert eine kubische Kurve durch diesen Punkt
ja: この点を通る三次曲線を作成
nl: Teken een derdegraads kromme door dit punt

source: Select a point for the new cubic to go through...
ar: اختر نقطة ليمر بها المنحنى التكعيبي الجديد...
de: Wählen Sie einen Punkt, durch den die neue kubische Kurve gehen soll ...
ja: 新しい三次曲線が通る点を選択...
nl: Selecteer een punt dat op de nieuwe derdegraads kromme ligt...

source: curve
ar: منحنى
de: Kurve
ja: 曲線
nl: kromme

source: Select this curve
ar: حدد هذا المنحنى
de: Diese Kurve auswählen
ja: この曲線を選択
nl: Selecteer deze kromme

source: Select curve %1
ar: اختر المنحنى %1
de: Kurve %1 auswählen
ja: 曲線 %1 を選択
nl: Selecteer kromme %1

source: Remove a Curve
ar: أزل منحنى
de: Eine Kurve entfernen
ja: 曲線を削除
nl: Verwijder een kromme

source: Add a Curve
ar: أضف منحنى
de: Eine Kurve hinzufügen
ja: 曲線を追加
nl: Voeg een kromme toe

source: Move a Curve
ar: حرّك منحنى
de: Eine Kurve verschieben
ja: 曲線を移動
nl: Verplaats een kromme

source: Attach to this curve
ar: ارفق بهذا المنحنى
de: Dieser Kurve hinzufügen
ja: この曲線に付ける
nl: Teken op deze kromme

source: Show a Curve
ar: أظهر منحنى
de: Eine Kurve anzeigen
ja: 曲線を表示
nl: Toon een kromme

source: Hide a Curve
ar: أخفِ منحنى
de: Eine Kurve ausblenden
ja: 曲線を隠す
nl: Verberg een kromme

source: Possibly transcendental curve
ar: منحنى محتمل أن يكون متعاليًا
nl: Mogelijk transcendente kromme

source: Already computed intersection point
ar: نقطة التقاطع محسوبة بالفعل
de: Der Schnittpunkt wurde schon berechnet
ja: 既に計算された交点
nl: Reeds berekend snijpunt

source: Intersect with this cubic curve
ar: تقاطع مع هذا المنحنى التكعيبي
de: Schnittpunkt mit dieser kubische Kurve
ja: この三次曲線との交点
nl: Snijden met deze derdegraads kromme

source: Intersect with this arc
ar: تقاطع مع هذا القوس
de: Schnittpunkt mit diesem Kreisbogen
ja: この弧との交点
nl: Snijden met deze cirkelboog

source: Invert with respect to this circle
ar: اعكس بالنسبة إلى هذه الدائرة
de: Im Hinblick auf diesen Kreis invertieren
ja: この円に関して反転
nl: Inverteer ten opzichte van deze cirkel

source: Select the circle we want to invert against...
ar: اختر الدائرة التي نريد الانعكاس حولها...
de: Wählen Sie den Kreis, nach dem invertiert werden soll ...
ja: 反転円となる円を選択...
nl: Selecteer de cirkel ten opzichte waarvan de inversie moet worden berekend...

source: Compute the inversion of this object
ar: احسب انعكاس هذا الكائن
de: Die Umkehrung dieses Objektes berechnen
ja: このオブジェクトの反転計算をする
nl: Bereken de inversie van dit object

source: Select the object to invert...
ar: اختر الكائن المراد عكسه...
de: Wählen Sie das Objekt, das umgekehrt werden soll ...
ja: 反転させるオブジェクトを選択...
nl: Selecteer het te inverteren object...

source: Compute the inversion of this point
ar: احسب انعكاس هذه النقطة
de: Die Umkehrung dieses Punktes berechnen
ja: この点の反転計算をする
nl: Bereken de inversie van dit punt

source: Select the point to invert...
ar: اختر النقطة المراد عكسها...
de: Wählen Sie den Punkt, der umgekehrt werden soll ...
ja: 反転させる点を選択...
nl: Selecteer het te inverteren punt...

source: Compute the inversion of this line
ar: احسب انعكاس هذا الخط
de: Die Umkehrung dieser Geraden berechnen
ja: この直線の反転計算をする
nl: Bereken de inversie van deze lijn

source: Select the line to invert...
ar: اختر الخط المراد عكسه...
de: Wählen Sie die Gerade, die umgekehrt werden soll ...
ja: 反転させる直線を選択...
nl: Selecteer de te inverteren lijn...

source: Compute the inversion of this segment
ar: احسب انعكاس هذه القطعة
de: Die Umkehrung dieser Strecke berechnen
ja: この線分の反転計算をする
nl: Bereken de inversie van dit lijnstuk

source: Select the segment to invert...
ar: اختر القطعة المراد عكسها...
de: Wählen Sie die Strecke, die umgekehrt werden soll ...
ja: 反転させる線分を選択...
nl: Selecteer het te inverteren lijnstuk...

source: Compute the inversion of this circle
ar: احسب انعكاس هذه الدائرة
de: Die Umkehrung dieses Kreises berechnen
ja: この円の反転計算をする
nl: Bereken de inversie van deze cirkel

source: Select the circle to invert...
ar: اختر الدائرة المراد عكسها...
de: Wählen Sie den Kreis, der umgekehrt werden soll ...
ja: 反転する円を選択...
nl: Selecteer de te inverteren cirkel...

source: Compute the inversion of this arc
ar: احسب انعكاس هذا القوس
de: Berechnet die Umkehrung dieses Bogens
ja: この弧の反転計算をする
nl: Bereken de inversie van deze cirkelboog

source: Select the arc to invert...
ar: اختر القوس المراد عكسه...
de: Wählen Sie den Bogen der umgekehrt werden soll ...
ja: 反転する弧を選択...
nl: Selecteer de te inverteren cirkelboog...

source: Slope
ar: ميل
de: Steigung
ja: 傾き
nl: Hellingshoek

source: Equation
ar: معادلة رياضية
de: Gleichung
ja: 方程式
nl: Vergelijking

source: Length
ar: طول
de: Länge
ja: 長さ
nl: Lengte

source: Support Line
ar: خط دعم
de: Hilfslinie
nl: Ondersteunende lijn

source: End Point
ar: نقطة نهاية
de: Endpunkt
ja: 終点
nl: Eindpunt

source: line
ar: خطّ
de: Linie
ja: 直線
nl: lijn

source: Select a Line
ar: حدد خطاً
de: Eine Gerade auswählen
ja: 直線を選択
nl: Selecteer een Lijn

source: Select this line
ar: اختر هذا الخط
de: Diese Gerade auswählen
ja: この直線を選択
nl: Selecteer deze lijn

source: Select line %1
ar: اختر الخط %1
de: Gerade %1 auswählen
ja: 直線 %1 を選択
nl: Selecteer lijn %1

source: Remove a Line
ar: أزل خطًا
de: Eine Gerade entfernen
ja: 直線を削除
nl: Verwijder een Lijn

source: Add a Line
ar: أضف خطًا
de: Eine Gerade hinzufügen
ja: 直線を追加
nl: Voeg een Lijn toe

source: Move a Line
ar: حرّك خطًا
de: Eine Gerade verschieben
ja: 直線を移動
nl: Verplaats een Lijn

source: Attach to this line
ar: ارفق بهذا الخط
de: Dieser Geraden hinzufügen
ja: この直線に付ける
nl: Teken op deze lijn

source: Show a Line
ar: أظهر خطًا
de: Eine Gerade anzeigen
ja: 直線を表示
nl: Toon een lijn

source: Hide a Line
ar: أخفِ خطًا
de: Eine Gerade ausblenden
ja: 直線を隠す
nl: Verberg een lijn

source: segment
ar: قطعة
de: Strecke
ja: 線分
nl: lijnstuk

source: Select this segment
ar: اختر هذه القطعة المستقيمة
de: Diese Strecke auswählen
ja: この線分を選択
nl: Selecteer dit lijnstuk

source: Select segment %1
ar: اختر القطعة المستقيمة %1
de: Strecke %1 auswählen
ja: 線分 %1 を選択
nl: Selecteer lijnstuk %1

source: Remove a Segment
ar: أزل قطعة مستقيمة
de: Eine Strecke entfernen
ja: 線分を削除
nl: Verwijder een Lijnstuk

source: Add a Segment
ar: أضف قطعة مستقيمة
de: Eine Strecke hinzufügen
ja: 線分を追加
nl: Voeg een lijnstuk toe

source: Move a Segment
ar: حرّك قطعة مستقيمة
de: Eine Strecke verschieben
ja: 線分を移動
nl: Verplaats een lijnstuk

source: Attach to this segment
ar: ارفق بهذه القطعة المستقيمة
de: Dieser Strecke hinzufügen
ja: この線分に付ける
nl: Teken op dit lijnstuk

source: Show a Segment
ar: أظهر قطعة مستقيمة
de: Eine Strecke anzeigen
ja: 線分を表示
nl: Toon een lijnstuk

source: Hide a Segment
ar: أخفِ قطعة مستقيمة
de: Eine Strecke ausblenden
ja: 線分を隠す
nl: Verberg een lijnstuk

source: half-line
ar: نصف خط
de: Strahl
ja: 半直線
nl: halve rechte lijn

source: Select this half-line
ar: اختر هذا نصف الخط
de: Diesen Strahl auswählen
ja: この半直線を選択
nl: Selecteer deze halve rechte lijn

source: Select half-line %1
ar: اختر نصف الخط %1
de: Strahl %1 auswählen
ja: 半直線 %1 を選択
nl: Selecteer halve rechte lijn %1

source: Remove a Half-Line
ar: أزل نصف خط
de: Einen Strahl entfernen
ja: 半直線を削除
nl: Verwijder een halve rechte lijn

source: Add a Half-Line
ar: أضف نصف خط
de: Einen Strahl hinzufügen
ja: 半直線を追加
nl: Voeg een halve rechte lijn toe

source: Move a Half-Line
ar: حرّك نصف خط
de: Einen Strahl verschieben
ja: 半直線を移動
nl: Verplaats een halve rechte lijn

source: Attach to this half-line
ar: ارفق بهذا نصف الخط
de: Zu diesem Strahl hinzufügen
ja: この半直線に付ける
nl: Teken op deze halve rechte lijn

source: Show a Half-Line
ar: أظهر نصف خط
de: Einen Strahl anzeigen
ja: 半直線を表示
nl: Toon een halve rechte lijn

source: Hide a Half-Line
ar: أخفِ نصف خط
de: Einen Strahl ausblenden
ja: 半直線を隠す
nl: Verberg een halve rechte lijn

source: Construct a segment starting at this point
ar: أنشئ قطعة مستقيمة تبدأ من هذه النقطة
de: Konstruiert eine Strecke, die an diesem Punkt beginnt
ja: この点で始まる線分を作成
nl: Teken een lijnstuk dat in dit punt begint

source: Select the start point of the new segment...
ar: اختر نقطة بداية القطعة المستقيمة الجديدة...
de: Wählen Sie den Startpunkt der neuen Strecke ...
ja: 新しい線分の始点を選択...
nl: Selecteer het beginpunt van het nieuwe lijnstuk...

source: Construct a segment ending at this point
ar: أنشئ قطعة مستقيمة تنتهي عند هذه النقطة
de: Konstruiert eine Strecke mit diesem Endpunkt
ja: この点で終わる線分を作成
nl: Teken een lijnstuk dat in dit punt eindigt

source: Select the end point of the new segment...
ar: اختر نقطة نهاية القطعة المستقيمة الجديدة...
de: Wählen Sie den Endpunkt der neuen Strecke ...
ja: 新しい線分の終点を作成...
nl: Selecteer het eindpunt van het nieuwe lijnstuk...

source: Construct a line through this point
ar: أنشئ خطًا يمر بهذه النقطة
de: Eine Gerade durch diesen Punkt konstruieren
ja: この点を通る直線を作成
nl: Teken een lijn door dit punt

source: Select a point for the line to go through...
ar: اختر نقطة ليمر بها الخط...
de: Wählen Sie einen Punkt, durch den die Gerade gehen soll ...
ja: 直線が通る点を選択...
nl: Selecteer een punt dat op de lijn ligt...

source: Select another point for the line to go through...
ar: اختر نقطة أخرى ليمر بها الخط...
de: Wählen Sie einen weiteren Punkt, durch den die Gerade gehen soll ...
ja: 直線が通る他の点を選択...
nl: Selecteer een tweede punt dat op de lijn ligt...

source: Construct a half-line starting at this point
ar: أنشئ نصف خط يبدأ من هذه النقطة
de: Konstruiert einen Strahl, der in diesem Punkt startet
ja: この点で始まる半直線を作成
nl: Teken een halve rechte lijn die begint in dit punt

source: Select the start point of the new half-line...
ar: اختر نقطة بداية نصف الخط الجديد...
de: Wählen Sie den Startpunkt des neuen Strahls ...
ja: 新しい半直線の始点を選択...
nl: Selecteer het beginpunt van de nieuwe halve rechte lijn...

source: Construct a half-line through this point
ar: أنشئ نصف خط يمر بهذه النقطة
de: Konstruiert einen Strahl durch diesen Punkt
ja: この点を通る半直線を作成
nl: Teken een halve rechte lijn door dit punt

source: Select a point for the half-line to go through...
ar: اختر نقطة ليمر بها نصف الخط...
de: Wählen Sie einen Punkt, durch den der Strahl gehen soll ...
ja: 半直線が通る点を選択...
nl: Selecteer een punt dat op de halve rechte lijn ligt...

source: Construct the axis of this segment
ar: أنشئ محور هذه القطعة المستقيمة
de: Die Mittelsenkrechte dieser Strecke konstruieren
ja: この線分の軸を作成
nl: Teken de middelloodlijn van dit lijnstuk

source: Select the segment of which you want to draw the axis...
ar: اختر القطعة المستقيمة التي تريد رسم محورها...
de: Wählen Sie die Strecke, zu der Sie die Mittelsenkrechte zeichnen möchten ...
ja: 軸を描く線分を選択...
nl: Selecteer het lijnstuk waarvan u de middelloodlijn wilt tekenen...

source: Construct a line parallel to this line
ar: أنشئ خطًا موازيًا لهذا الخط
de: Konstruiert eine Parallele zu dieser Geraden
ja: この直線の平行線を作成
nl: Teken een lijn evenwijdig aan deze lijn

source: Select a line parallel to the new line...
ar: اختر خطًا موازيًا للخط الجديد...
de: Wählen Sie die Gerade, zu der die Parallele konstruiert werden soll ...
ja: 新しい直線の平行線を選択...
nl: Selecteer een lijn evenwijdig aan de nieuwe lijn...

source: Construct the parallel line through this point
ar: أنشئ الخط الموازي الذي يمر بهذه النقطة
de: Konstruiert die Parallele durch diesen Punkt
ja: この点を通る平行線を作成
nl: Teken de evenwijdige lijn door dit punt

source: Select a point for the new line to go through...
ar: اختر نقطة ليمر بها الخط الجديد...
de: Wählen Sie einen Punkt, durch den die Parallele gehen soll ...
ja: 新しい直線が通る点を選択...
nl: Selecteer een punt dat op de nieuwe lijn ligt...

source: Construct a line perpendicular to this line
ar: أنشئ خطًا عموديًا على هذا الخط
de: Konstruiert eine Senkrechte zu dieser Geraden
ja: この直線の垂線を作成
nl: Teken een lijn loodrecht op deze lijn

source: Select a line perpendicular to the new line...
ar: اختر خطًا عموديًا على الخط الجديد...
de: Wählen Sie die Gerade, zu der die Senkrechte konstruiert werden soll ...
ja: 新しい直線の垂線を選択...
nl: Selecteer een lijn loodrecht op de nieuwe lijn...

source: Construct a perpendicular line through this point
ar: أنشئ خطًا عموديًا يمر بهذه النقطة
de: Konstruiert eine Senkrechte durch diesen Punkt
ja: この点を通る垂線を作成
nl: Teken een loodrechte lijn door dit punt

source: Set &Length...
ar: اضبط ال&طول...
de: &Länge festlegen ...
ja: 長さを設定(&L)...
nl: &Lengte kiezen...

source: Set Segment Length
ar: اضبط طول القطعة المستقيمة
de: Streckenlänge festlegen
ja: 線分の長さを設定
nl: Kies lengte lijnstuk

source: Choose the new length:
ar: اختر الطول الجديد:
de: Neue Länge wählen:
ja: 新しい長さを入力:
nl: Voer de nieuwe lengte in:

source: Resize Segment
ar: غيّر حجم القطعة المستقيمة
de: &Streckenlänge neu wählen
ja: 線分をリサイズ
nl: Lengte van lijnstuk wijzigen

source: Construct a line by this vector
ar: أنشئ خطًا بهذا المتجه
de: Konstruiert eine Gerade mit diesem Vektor
ja: このベクトルで直線を作成
nl: Teken een lijn evenwijdig aan deze vector

source: Select a vector in the direction of the new line...
ar: اختر متجهًا في اتجاه الخط الجديد...
de: Wählen Sie einen Vektor in der Richtung der neuen Gerade ...
ja: 新しい直線の方向ベクトルを選択...
nl: Selecteer een vector met de richting van de nieuwe lijn...

source: Construct a half-line by this vector
ar: أنشئ نصف خط بهذا المتجه
de: Konstruiert einen Strahl mit diesem Vektor
ja: このベクトルで半直線を作成
nl: Teken een halve rechte lijn evenwijdig aan deze vector

source: Select a vector in the direction of the new half-line...
ar: اختر متجهًا في اتجاه نصف الخط الجديد...
de: Wählen Sie einen Vektor in der Richtung des neuen Strahls ...
ja: 新しい半直線の方向ベクトルを選択...
nl: Selecteer een vector met de richting van de nieuwe halve rechte lijn...

source: locus
ar: محل هندسي
de: Geometrischer Ort
ja: 軌跡
nl: meetkundige plaats

source: Select this locus
ar: اختر هذا المحل الهندسي
de: Diesen geometrischen Ort auswählen
ja: この軌跡を選択
nl: Selecteer deze meetkundige plaats

source: Select locus %1
ar: اختر المحل الهندسي %1
de: Geometrischen Ort %1 auswählen
ja: 軌跡 %1 を選択
nl: Selecteer meetkundige plaats %1

source: Remove a Locus
ar: أزل محلًا هندسيًا
de: Einen geometrischen Ort entfernen
ja: 軌跡を削除
nl: Verwijder een meetkundige plaats

source: Add a Locus
ar: أضف محلًا هندسيًا
de: Einen geometrischen Ort hinzufügen
ja: 軌跡を追加
nl: Voeg een meetkundige plaats toe

source: Move a Locus
ar: حرّك محلًا هندسيًا
de: Einen geometrischen Ort verschieben
ja: 軌跡を移動
nl: Verplaats een meetkundige plaats

source: Attach to this locus
ar: ارفق بهذا المحل الهندسي
de: Diesem geometrischen Ort hinzufügen
ja: この軌跡に付ける
nl: Teken op deze meetkundige plaats

source: Show a Locus
ar: أظهر محلًا هندسيًا
de: Einen geometrischen Ort anzeigen
ja: 軌跡を表示
nl: Toon een meetkundige plaats

source: Hide a Locus
ar: أخفِ محلًا هندسيًا
de: Einen geometrischen Ort ausblenden
ja: 軌跡を隠す
nl: Verberg een meetkundige plaats

source: Object Type
ar: نوع الكائن
de: Objekttyp
ja: オブジェクトタイプ

source: Object
ar: الكائن
de: Objekt
ja: オブジェクト

source: Select this object
ar: اختر هذا الجرم
de: Dieses Objekt auswählen
ja: このオブジェクトを選択
nl: Selecteer dit object

source: Select object %1
ar: اختر الكائن %1 ...
de: Objekt %1 auswählen
ja: オブジェクト %1 を選択
nl: Selecteer object %1

source: Remove an object
ar: أزل كائنًا
de: Ein Objekt entfernen
ja: オブジェクトを削除
nl: Verwijder een object

source: Add an object
ar: أضف كائنًا
de: Ein Objekt hinzufügen
ja: オブジェクトを追加
nl: Voeg een object toe

source: Move an object
ar: حرّك كائنًا
de: Ein Objekt verschieben
ja: オブジェクトの移動
nl: Verplaats een object

source: Attach to this object
ar: ارفق بهذا الكائن
de: Diesem Objekt hinzufügen
ja: このオブジェクトに付ける
nl: Teken op dit object

source: Show an object
ar: أظهر كائنًا
de: Ein Objekt anzeigen
ja: オブジェクトを表示
nl: Toon een object

source: Hide an object
ar: أخفِ كائنًا
de: Ein Objekt ausblenden
ja: オブジェクトを隠す
nl: Verberg een object

source: Angle in Radians
ar: الزاوية بالراديان
de: Winkel im Bogenmaß
ja: 角度 (ラジアン)
nl: Hoek in radialen

source: Angle in Degrees
ar: الزاوية بالدرجات
de: Winkel in Grad
ja: 角度 (度)
nl: Hoek in graden

source: Midpoint
ar: منتصف
de: Mittelpunkt
ja: 中点
nl: Midden

source: X length
ar: طول س
de: X-Länge
ja: X 方向の長さ
nl: X-lengte

source: Y length
ar: طول ص
de: Y-Länge
ja: Y 方向の長さ
nl: Y-lengte

source: Opposite Vector
ar: المتجه المعاكس
de: Gegenvektor
ja: 逆ベクトル
nl: Tegengestelde vector

source: Angle
ar: الزاوية
de: Winkel
ja: 角
nl: Hoek

source: Sector Surface
ar: سطح القطاع
de: Sektoroberfläche
ja: 扇形の面積
nl: Oppervlak cirkelsector

source: Arc Length
ar: طول قوس
de: Bogenlänge
ja: 弧の長さ
nl: Booglengte
