Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: &Polar
ar: &قطب
ja: 極座標系(&P)
nl: &Polair

source: Set Euclidean Coordinate System
ar: اضبط نظام إحداثيّ إقليديّ
de: Wählt das Euklidische Koordinatensystem
ja: 直交座標系に設定
nl: Kies Cartesische coördinaten

source: Set Polar Coordinate System
ar: اضبط نظام إحداثيّ قطبيّ
de: Wählt das Polare Koordinatensystem
ja: 極座標系に設定
nl: Kies Poolcoördinaten

# Translators: Degrees
source: Deg
ar: درجات
de: Grad
ja: 度
nl: Graden

# Translators: Radians
source: Rad
ar: راديان
ja: ラジアン

# Translators: Gradians
source: Grad
ar: غراد
de: Gon
ja: グラード
nl: Grads

source: A normal point, i.e. one that is either independent or attached to a line, circle, segment.
ar: نقطة عاديّة، أيّ مستقلّة أو مرتبطة بخطّ، أو دائرة، أو قطعة.
de: Ein normaler Punkt, also ein Punkt, der entweder unabhängig ist oder einer Gerade, einem Kreis oder einer Strecke anhaftet.
ja: 普通の点 (独立点、または線・円・線分などに付いている従属点)
nl: Een gewoon punt, bijv. een los punt of een punt op een lijn, cirkelomtrek of lijnstuk.

source: Point
ar: نقطة
de: Punkt
ja: 点
nl: Punt

source: Construct a text label.
ar: أنشئ وسمًا نصّيًّا.
de: Ein Textfeld konstruieren.
ja: テキストラベルを作成
nl: Teken een bijschrift.

source: Text Label
ar: وسم نصّيّ
de: Textfeld
ja: テキストラベル
nl: Bijschrift

source: Construct a Point by its Coordinates
ar: أنشئ نقطة بإحداثياتها
de: Einen Punkt mittels seiner Koordinaten konstruieren
ja: 座標を入力して点を作成
nl: Teken een punt aan de hand van zijn coördinaten

source: Point by Coordinates
ar: نقطة بإحداثيات
de: Punkt mittels Koordinaten
ja: 座標の点
nl: Punt met coördinaten

source: Fixed Point
ar: نقطة ثابتة
de: Fester Punkt
ja: 定点
nl: Vast punt

source: Enter the coordinates for the new point.
ar: أدخل إحداثيات النّقطة الجديدة.
de: Geben Sie die Koordinaten für den neuen Punkt ein.
ja: 新しい点の座標を入力してください。
nl: Voer de coördinaten in van het nieuwe punt.

source: Construct a Numeric Value
ar: أنشئ قيمة عدديّة
de: Einen numerischen Wert konstruieren
ja: 数値を作成
nl: Teken een getalswaarde

source: Numeric Value
ar: قيمة عددية
de: Numerischer Wert
ja: 数値
nl: Getalswaarde

source: &Use default coordinate precision
ar: ا&ستخدم دقّة الإحداثيات الافتراضيّة
de: Standard-Koordinatengenauigkeit &verwenden
nl: De standaard precisie van coördinaten gebr&uiken

source: &Specify coordinate precision:
ar: &حدّد دقّة الإحداثيات:
de: &Koordinatengenauigkeit angeben:
nl: De precisie van coördinaten &specificeren:

# @title:window
source: Set Angle Size
ar: اضبط حجم الزّاوية
de: Winkelgröße wählen
nl: Kies hoekgrootte

source: Insert the new size of this angle:
ar: أدخل الحجم الجديد لهذه الزّاوية:
de: Geben Sie die neue Größe des Winkels ein:
ja: この角の大きさの新しい値を入力:
nl: Voeg de nieuwe grootte in van deze hoek:

source: Use this edit field to modify the size of this angle.
ar: استخدم هذا الحقل لتحوير حجم هذه الزّاوية.
de: Benutzen Sie dieses Eingabefeld, um die Größe des Winkels zu verändern.
ja: この角の大きさを修正するには、この編集フィールドを使います。
nl: In dit veld kunt u de grootte van deze hoek wijzigen.

source: Choose from this list the goniometric unit you want to use to modify the size of this angle.<br /> If you switch to another unit, the value in the edit field on the left will be converted to the new selected unit.
ar: اختر من هذه القائمة الوحدة الجيبيّة التي تريد استخدامها لتحوير حجم هذه الزّاوية.<br /> إذا غيّرت إلى وحدة أخرى، فسيحوَّل الحجم في حقل التّحرير على اليسار إلى الوحدة الجديدة المختارة.
de: Wählen Sie aus der Liste die Einheit, die Sie benutzen möchten, um die Größe des Winkels zu verändern.<br /> Wenn Sie zu einer anderen Einheit wechseln, dann wird der Wert im Eingabefeld automatisch zur neuen Einheit konvertiert.
ja: <qt>角の大きさの修正に使う角度の単位を、このリストから選択します。<br /> 別の単位に切り替えると、左の編集フィールドの値は新しく選んだ単位に変換されます。</qt>
nl: Kies in deze lijst de hoekeenheid waarin u de grootteverandering van de hoek wilt uitdrukken.<br /> Als u de eenheid wijzigt wordt de waarde in het linker bewerkingsvak omgerekend naar de nieuwe geselecteerde eenheid.

source: Could not open macro file '%1'
ar: فشل فتح ملفّ ماكرو «%1»
de: Die Makrodatei „%1“ kann nicht geöffnet werden
ja: マクロファイル ‘%1’ を開けません
nl: Kon macrobestand '%1' niet openen

source: Kig cannot open the macro file "%1".
ar: لا يستطيع كيج فتح ملفّ الماكرو «%1».
de: Die Makrodatei „%1“ kann nicht geöffnet werden.
ja: Kig はマクロファイル ‘%1’ を開けません。
nl: Kig kan het macrobestand "%1" niet openen.

source: This file was created by a very old Kig version (pre-0.4). Support for this format has been removed from recent Kig versions. You can try to import this macro using a previous Kig version (0.4 to 0.6) and then export it again in the new format.
ar: أُنشئ هذا الملفّ بإصدار قديم جدًّا من كيج (قبل 0.4). أُزيل دعم هذا التّنسيق من إصدارات كيج الحديثة. يمكنك استيراد هذا الماكرو باستخدام إصدار سابق من كيج (0.4 إلى 0.6) ثمّ تصديره ثانية بالتّنسيق الجديد.
de: Diese Datei wurde von einer sehr alten Kig-Version erzeugt (vor 0.4). Die Unterstützung für dieses Format wurde aus neueren Kig-Versionen entfernt. Sie können versuchen, dieses Makro mit einer früheren Kig-Version (0.4 bis 0.6) zu öffnen und es dann im neuen Format zu exportieren.
ja: このファイルは Kig の非常に古いバージョン (0.4 よりも前) で作成されています。このフォーマットはもうサポートしていません。このマクロをバージョン 0.4 から 0.6 の Kig でインポートして、新しいフォーマットで再度保存してみてください。
nl: Dit bestand is gemaakt met een erg oude versie van Kig (ouder dan versie 0.4) De nieuwe versies van Kig kunnen hiermee niet overweg. U kunt proberen of u deze macro kunt importeren in een vorige versie (0.4 tot 0.6) van Kig, en het daarna weer exporteren in het nieuwe formaat.

source: Unnamed Macro #%1
ar: ماكرو غير مسمّى #%1
de: Unbenanntes Makro Nr. %1
ja: 名前なしのマクロ #%1
nl: Onbenoemde macro #%1

source: This Kig file uses an object of type "%1", which this Kig version does not support. Perhaps you have compiled Kig without support for this object type, or perhaps you are using an older Kig version.
ar: يستخدم ملفّ كيج هذا كائنًا من النّوع «%1»، وهو نوع لا يدعمه إصدار كيج هذا. ربّما صنّفت كيج بلا دعم لهذا النّوع من الكائنات، أو ربّما أنت تستخدم إصدارًا أقدم من كيج.
de: Diese Kig-Datei benutzt ein Objekt des Typs „%1“, das diese Kig-Version nicht unterstützt. Vielleicht haben Sie Kig ohne Unterstützung dieses Objekttyps kompiliert oder vielleicht benutzen Sie eine ältere Kig-Version.
ja: この Kig ファイルは、このバージョンの Kig ではサポートしていないタイプ “%1” のオブジェクトを使っています。おそらく、このオブジェクトタイプをサポートせずに Kig をコンパイルしたか、Kig の古いバージョンを使っていると思われます。
nl: Dit Kig-bestand bevat een object van het type "%1". Uw versie van Kig heeft hiervoor geen ondersteuning. Mogelijk is uw versie van Kig gecompileerd zonder ondersteuning voor dit objecttype, of gebruikt u een oudere versie van Kig.

source: Radical Lines for Conics
ar: خطوط الجذر للمقاطع المخروطيّة
de: Wurzellinie für Kegelschnitte
ja: 二次曲線の根軸
nl: Machtlijnen van kegelsneden

source: The lines constructed through the intersections of two conics. This is also defined for non-intersecting conics.
ar: الخطوط المنشأة عبر تقاطعات مقطعين مخروطيّين. تُعرَّف هذه الخطوط كذلك للمقاطع المخروطيّة غير المتقاطعة.
de: Die Linien, die durch die Schnittpunkte zweier Kegelschnitte konstruiert werden. Das ist auch für sich nicht schneidende Kegelschnittfunktionen definiert.
ja: 2 つの二次曲線の交点を通って作られる直線。これは交点を持たない二次曲線でも定義されます。
nl: Teken de machtlijnen, deze gaan meestal door de snijpunten van twee kegelsneden. Zij zijn echter ook gedefinieerd voor niet-snijdende kegelsneden.

source: Moving Point
ar: نقطة متحرّكة
de: Bewegender Punkt
ja: 動点
nl: Bewegend punt

source: Select the moving point, which will be moved around while drawing the locus...
ar: اختر النّقطة المتحرّكة، التي ستُحرّك في أثناء رسم المحلّ الهندسيّ…
de: Wählen Sie den Bewegungspunkt, der zum Zeichnen des Ort-Objektes bewegt werden soll ...
ja: 動点 (軌跡を描く一方で動かす点) を選択...
nl: Selecteer het bewegende punt, dat zal worden verplaatst terwijl de meetkundige plaats wordt getekend...

source: Following Point
ar: نقطة التّتبع
de: Folgepunkt
ja: 追従点
nl: Volgende punt

source: Select the following point, whose locations the locus will be drawn through...
ar: اختر نقطة التّتبع التي سيرسم المحلّ الهندسيّ عبر مواقعها…
de: Wählen Sie den Folgepunkt, durch dessen Aufenthaltsort das Orts-Objekt gezeichnet wird ...
ja: 追従点 (軌跡を描く点) を選択...
nl: Selecteer het volgende punt, de meetkundige plaats zal door de posities daarvan worden getekend...

source: Locus
ar: محلّ هندسيّ
de: Geometrischer Ort
ja: 軌跡
nl: Meetkundige plaats

source: A locus
ar: محلّ هندسيّ
de: Ein geometrischer Ort
ja: 軌跡
nl: Een meetkundige plaats

source: Dependent Point
ar: نقطة تابعة
de: Abhängiger Punkt
ja: 従属点
nl: Afhankelijk punt

source: Polygon by Its Vertices
ar: مضلّع برؤوسه
de: Polygon durch seine Eckpunkte
ja: その頂点による多角形
nl: Veelhoek met zijn hoekpunten

source: Construct a polygon by giving its vertices
ar: أنشئ مضلّعًا بتعيين رؤوسه
de: Konstruiert ein Polygon mit gegebenen Eckpunkten
ja: 与えられた頂点による多角形を作成
nl: Teken een veelhoek door zijn hoekpunten te geven

source: ... with this vertex (click on the first vertex to terminate construction)
ar: ... بهذا الرّأس (انقر على الرّأس الأوّل لإنهاء الإنشاء)
de: ... mit diesem Eckpunkt (klicken Sie auf den ersten, um die Konstruktion zu beenden)
ja: この頂点で多角形を作成 (最初の頂点をクリックして終了)
nl: ... met dit hoekpunt (klik op het eerste hoekpunt om het tekenen te beëindigen)

source: Construct a polygon with this vertex
ar: أنشئ مضلّعًا بهذا الرّأس
de: Konstruiert ein Polygon mit diesem Eckpunkt
ja: この頂点で多角形を作成
nl: Teken een veelhoek met dit hoekpunt

source: Select a point to be a vertex of the new polygon...
ar: اختر نقطة لتكون رأسًا للمضلّع الجديد…
de: Wählen Sie einen Eckpunkt für das neue Polygon ...
ja: 新しい多角形の頂点となる点を選択...
nl: Selecteer een punt dat een hoekpunt wordt van de nieuwe veelhoek...

source: Open Polygon (Polygonal Line)
ar: مضلّع مفتوح (خطّ مضلّع)
de: Offene Polylinie
nl: Open veelhoek (veelhoekige lijn)

source: Construct an open polygon
ar: أنشئ مضلّعًا مفتوحًا
de: Konstruiert eine offene Polylinie
nl: Teken een open veelhoek

source: ... with this vertex (click again on the last vertex to terminate construction)
ar: ... بهذا الرّأس (انقر ثانيةً على الرّأس الأخير لإنهاء الإنشاء)
de: ... mit diesem Eckpunkt (klicken Sie wieder auf den letzten Punkt, um die Konstruktion zu beenden)
nl: ... met dit hoekpunt (klik opnieuw op het laatste hoekpunt om het tekenen te beëindigen)

source: Construct a polygonal line with this vertex
ar: أنشئ خطًّا مضلّعًا بهذا الرّأس
de: Konstruiert eine Polylinie mit diesem Eckpunkt
nl: Teken een veelhoekige lijn met dit hoekpunt

source: Select a point to be a vertex of the new polygonal line...
ar: اختر نقطة لتكون رأسًا للخطّ المضلّع الجديد…
de: Wählen Sie einen Eckpunkt für die neue Polylinie ...
nl: Selecteer een punt dat een hoekpunt wordt van de nieuwe veelhoekige lijn...

source: Polygon
ar: مضلّع
ja: 多角形
nl: Veelhoek

source: Construct the vertices of this polygon...
ar: أنشئ رؤوس هذا المضلّع…
de: Konstruiert die Eckpunkte dieses Polygons ...
ja: この多角形の頂点を作成...
nl: Teken de hoekpunten van deze veelhoek...

source: Vertices of a Polygon
ar: رؤوس مضلّع
de: Eckpunkte eines Polygons
ja: 多角形の頂点
nl: Hoekpunten van een veelhoek

source: The vertices of a polygon.
ar: رؤوس مضلّع.
de: Die Eckpunkte eines Polygons
ja: 多角形の頂点に相当する点を作成
nl: De hoekpunten van een veelhoek.

source: Construct the sides of this polygon...
ar: أنشئ أضلاع هذا المضلّع…
de: Konstruiert die Seiten dieses Polygons ...
ja: この多角形の辺を作成...
nl: Teken de zijden van deze veelhoek...

source: Sides of a Polygon
ar: أضلاع مضلّع
de: Seiten eines Polygons
ja: 多角形の辺に相当する線分を作成
nl: Zijden van een veelhoek

source: The sides of a polygon.
ar: أضلاع مضلّع.
de: Die Seiten eines Polygons
ja: 多角形の辺
nl: De zijden van een veelhoek.

source: Regular Polygon with Given Center
ar: مضلّع منتظم بمركز معطى
de: Reguläres Polygon mit gegebenem Mittelpunkt
ja: 与えられた中心を持つ正多角形
nl: Regelmatige veelhoek met gegeven midden

source: Construct a regular polygon with a given center and vertex
ar: أنشئ مضلّعًا منتظمًا بمركز ورأس معطى
de: Konstruiert ein reguläres Polygon mit einem gegebenen Mittelpunkt und Eckpunkt
ja: 与えられた中心と頂点を持つ正多角形を作成
nl: Teken een regelmatige veelhoek met een gegeven midden en hoekpunt

source: Construct a regular polygon with this center
ar: أنشئ مضلّعًا منتظمًا بهذا المركز
de: Konstruiert ein reguläres Polygon mit diesem Mittelpunkt
ja: ここを中心とする正多角形を作成
nl: Teken een regelmatige veelhoek met dit midden

source: Construct a regular polygon with this vertex
ar: أنشئ مضلّعًا منتظمًا بهذا الرّأس
de: Konstruiert ein reguläres Polygon mit diesem Eckpunkt
ja: ここを頂点とする正多角形を作成
nl: Teken een regelmatige veelhoek met dit hoekpunt

source: Adjust the number of sides (%1/%2)
ar: اضبط عدد الأضلاع (%1/%2)
de: Anzahl der Seiten anpassen (%1/%2)
ja: 辺の数を調整 (%1/%2)
nl: Pas het aantal zijden aan (%1/%2)

source: Adjust the number of sides (%1)
ar: اضبط عدد الأضلاع (%1)
de: Anzahl der Seiten anpassen (%1)
ja: 辺の数を調整 (%1)
nl: Pas het aantal zijden aan (%1)

source: Select the center of the new polygon...
ar: اختر مركز المضلّع الجديد…
de: Wählen Sie den Mittelpunkt des neuen Polygons ...
ja: 新しい多角形の中心を選択...
nl: Selecteer het midden van de nieuwe veelhoek...

source: Select a vertex for the new polygon...
ar: اختر رأسًا للمضلّع الجديد…
de: Wählen Sie einen Eckpunkt für das neue Polygon ...
ja: 新しい多角形の頂点を選択...
nl: Selecteer een hoekpunt van de nieuwe veelhoek...

source: Move the cursor to get the desired number of sides...
ar: حرّك المؤشّر للحصول على العدد المطلوب من الأضلاع…
de: Bewegen Sie den Mauszeiger, um die gewünschte Anzahl von Seiten zu erreichen ...
ja: カーソルを移動して辺の数を調整...
nl: Verplaats de muisaanwijzer om het gewenste aantal zijden te verkrijgen...

source: Bézier Curve by its Control Points
ar: منحنى بيزيه بنقاط التّحكّم فيه
de: Bézierkurve durch Kontrollpunkte
nl: Bézier kromme door zijn controlepunten

source: Construct a Bézier curve by giving its control points
ar: أنشئ منحنى بيزيه بتعيين نقاط التّحكّم فيه
de: Konstruiert eine Bézierkurve durch Eingabe von Kontrollpunkten
nl: Teken een Bézier kromme door de controlepunten ervan te geven

source: ... with this control point (click again on the last control point to terminate construction)
ar: ... بنقطة التّحكّم هذه (انقر ثانيةً على نقطة التّحكّم الأخيرة لإنهاء الإنشاء)
de: ... mit diesem Kontrollpunkt (klicken Sie auf den letzten Kontrollpunkt, um die Konstruktion zu beenden)
nl: ... met dit controlepunt (klik opnieuw op het laatste controlepunt om het tekenen te beëindigen)

source: Construct a Bézier curve with this control point
ar: أنشئ منحنى بيزيه بنقطة التّحكّم هذه
de: Eine Bézierkurve mit diesem Kontrollpunkt konstruieren
nl: Teken een Bézier kromme met dit controlepunt

source: Select a point to be a control point of the new Bézier curve...
ar: اختر نقطة لتكون نقطة تحكّم لمنحنى بيزيه الجديد…
de: Wählen Sie einen Punkt, der ein Kontrollpunkt der neuen Bézierkurve wird ...
nl: Selecteer een controlepunt van de nieuwe Bézier kromme...

source: Rational Bézier Curve by its Control Points
ar: منحنى بيزيه كسريّ بنقاط التّحكّم فيه
de: Rationale Bézierkurve durch Kontrollpunkte
nl: Rationele Bézier kromme door zijn controlepunten.

source: Construct a Bézier curve by giving its control points and positive weights
ar: أنشئ منحنى بيزيه بتعيين نقاط التّحكّم فيه وأوزانه الموجبة
de: Konstruiert eine Bézierkurve durch Eingabe ihrer Kontrollpunkte und positiven Gewichte
nl: Teken een Bézier kromme aan de hand van controlepunten en positieve gewichtsfactoren

source: ... assign this weight to last selected control point
ar: ... اسند هذا الوزن إلى آخر نقطة تحكّم مختارة
de: ... dieses Gewicht dem letzten ausgewählten Kontrollpunkt zuweisen
nl: ... ken deze gewichtsfactor toe aan het laatste controlepunt

source: ... with this control point (click again on the last control point or weight to terminate construction)
ar: ... بنقطة التّحكّم هذه (انقر ثانيةً على آخر نقطة تحكّم أو وزن لإنهاء الإنشاء)
de: ... mit diesem Kontrollpunkt (klicken Sie nochmals auf den letzten Kontrollpunkt oder das letzte Gewicht, um die Konstruktion zu beenden)
nl: ... met dit controlepunt (klik opnieuw op het laatste controlepunt of gewichtsfactor om het tekenen te beëindigen)

source: Construct a rational Bézier curve with this control point
ar: أنشئ منحنى بيزيه كسريّ بنقطة التّحكّم هذه
de: Konstruiert eine rationale Bézierkurve mit diesem Kontrollpunkt
nl: Teken een rationele Bézier kromme met dit controlepunt

source: Select a point to be a control point of the new rational Bézier curve...
ar: اختر نقطة لتكون نقطة تحكّم لمنحنى بيزيه الكسريّ الجديد…
de: Wählen Sie einen Punkt als Kontrollpunkt für die neue rationale Bézierkurve ...
nl: Selecteer een punt als controlepunt van de nieuwe rationele Bézier kromme...

source: Select a numeric label to be a weight of last selected point...
ar: اختر وسمًا عدديًّا ليكون وزنًا لآخر نقطة مختارة…
de: Wählen Sie ein numerisches Feld als Gewicht für den letzten ausgewählten Punkt ...
nl: Selecteer een getal als gewicht van het laatst geselecteerde punt...

source: Construct the Radical Lines of This Circle
ar: أنشئ خطوط الجذر لهذه الدّائرة
de: Konstruiert die Wurzellinien dieses Kreises
ja: この円の根軸を作成
nl: Teken de machtlijnen van deze cirkel

source: Construct the Radical Lines of This Conic
ar: أنشئ خطوط الجذر لهذا المقطع المخروطيّ
de: Konstruiert die Wurzellinien dieses Kegelschnittes
ja: この二次曲線の根軸を作成
nl: Teken de machtlijnen van deze kegelsnede

source: Generic Affinity
ar: تحويل تآلفيّ عامّ
de: Generische Affinität
ja: 一般的なアフィン変換
nl: Algemene affiniteit

source: The unique affinity that maps three points (or a triangle) onto three other points (or a triangle)
ar: التّحويل التّآلفيّ الفريد الذي يربط ثلاث نقاط (أو مثلّث) بثلاث نقاط أخرى (أو مثلّث)
de: Die eindeutige Abbildung, die 3 gegebene Punkte (oder ein Dreieck) auf 3 andere gegebene Punkte (oder ein Dreieck) abbildet.
ja: 3 点 (または三角形) を、他の 3 点 (または三角形) に写す、一意的なアフィン変換
nl: De unieke affiene afbeelding van drie punten (of een driehoek) op drie andere punten (of driehoek)

source: Generic Projective Transformation
ar: تحويل إسقاطيّ عامّ
de: Generische Projektive Transformation
ja: 一般的な射影変換
nl: Algemene projectieve transformatie

source: The unique projective transformation that maps four points (or a quadrilateral) onto four other points (or a quadrilateral)
ar: التّحويل الإسقاطيّ الفريد الذي يربط أربع نقاط (أو شكلًا رباعيًّا) بأربع نقاط أخرى (أو شكل رباعيّ)
de: Die eindeutige projektive Transformation bildet 4 gegebene Punkte (oder ein Viereck) auf vier andere gegebene Punkte (oder ein Viereck) ab.
ja: 4 点 (または四角形) を、他の 4 点 (または四角形) に写す、一意的な射影変換
nl: De unieke projectieve transformatie die vier punten (of een vierhoek) afbeeldt op vier andere punten (of vierhoek)

source: Inversion of Point, Line or Circle
ar: عكس نقطة، أو خطّ، أو دائرة
de: Umkehrung eines Punktes, einer Geraden oder eines Kreises
ja: 点、直線、円の反転
nl: Inversie van punt, lijn of cirkel

source: The inversion of a point, line or circle with respect to a circle
ar: عكس نقطة، أو خطّ، أو دائرة بالنّسبة لدائرة
de: Die Umkehrung eines Punktes, einer Geraden oder eines Kreises im Hinblick auf einen Kreis
ja: 円に関する点、直線、円の反転
nl: De inversie van een gegeven punt, lijn of cirkel ten opzichte van een cirkel

source: Measure Transport
ar: نقل قياس
de: Maßtransport
ja: 長さを移す
nl: Lengte afpassen

source: Transport the measure of a segment or arc over a line or circle.
ar: انقل قياس قطعة أو قوس على خطّ أو دائرة.
de: Transportiert die Länge einer Strecke oder eines Bogens oder einen numerischen Wert auf eine Gerade oder einen Kreis.
ja: 線分または弧の長さを直線上または円周上に移します。
nl: Afpassen van de lengte van een lijnstuk of booglengte op een lijn of cirkel.

source: Segment to transport
ar: قطعة للنّقل
de: Zu transportierende Strecke
ja: 長さを移す線分
nl: Lijnstuk waarvan de lengte moet worden afgepast

source: Arc to transport
ar: قوس للنّقل
de: Zu transportierender Bogen
ja: 長さを移す弧
nl: Cirkelboog die moet worden afgepast

source: Value to transport
ar: قيمة للنّقل
de: Zu transportierender Wert
ja: 移す値
nl: Waarde die moet worden afgepast

source: Transport a measure on this line
ar: انقل قياسًا على هذا الخطّ
de: Transportiert ein Maß auf diese Gerade
ja: この直線上に長さを移す
nl: Pas een lengte af op deze lijn

source: Transport a measure on this circle
ar: انقل قياسًا على هذه الدّائرة
de: Transportiert ein Maß auf diesen Kreis
ja: この円周上に長さを移す
nl: Pas een lengte af op deze cirkel

source: Start transport from this point of the circle
ar: ابدأ النّقل من هذه النّقطة من الدّائرة
de: Startet einen Transport von diesem Punkt des Kreises
ja: 円周上のこの点に移す
nl: Begin het afpassen in dit punt op de cirkel

source: Start transport from this point of the line
ar: ابدأ النّقل من هذه النّقطة من الخطّ
de: Startet einen Transport von diesem Punkt der Gerade
ja: 直線上のこの点に移す
nl: Begin het afpassen in dit punt op de lijn

source: Start transport from this point of the curve
ar: ابدأ النّقل من هذه النّقطة من المنحنى
de: Startet einen Transport von diesem Punkt der Kurve
ja: 曲線上のこの点に移す
nl: Begin het afpassen in dit punt op de kromme

source: Select a segment, arc or numeric label to be transported...
ar: اختر قطعة، أو قوسًا، أو وسمًا عدديًّا لنقله…
de: Wählen Sie ein Segment, einen Bogen oder ein numerisches Feld für den Transport ...
nl: Selecteer een lijnstuk, boog of tekst dat moet worden verplaatst...

source: Select a destination line or circle...
ar: اختر خطّ وجهة أو دائرة وجهة…
de: Wählen Sie eine Ziellinie oder Zielkreis ...
nl: Selecteer een lijn of cirkel waar naar toe...

source: Choose a starting point on the line/circle...
ar: اختر نقطة بدء على الخطّ/الدّائرة…
de: Wählen Sie einen Startpunkt auf der Linie / dem Kreis ...
nl: Selecteer een beginpunt op de lijn/cirkel...

source: Intersect with this conic
ar: قاطع بهذا المقطع المخروطيّ
de: Schnittpunkt mit diesem Kegelschnitt
ja: この二次曲線との交点
nl: Snijden met deze kegelsnede

source: Intersect with this line
ar: قاطع بهذا الخطّ
de: Schnittpunkt mit dieser Geraden
ja: この直線との交点
nl: Snijden met deze lijn

source: Intersect with this cubic
ar: قاطع بهذا المكعّب
de: Schnittpunkt mit diesem Würfel
ja: この三次曲線との交点
nl: Snijden met deze derdegraads kromme

source: Intersect with this circle
ar: قاطع بهذه الدّائرة
de: Schnittpunkt mit diesem Kreis
ja: この円との交点
nl: Snijden met deze cirkel

source: Intersect
ar: قاطع
de: Schnittpunkt
ja: 交点
nl: Snijpunt

source: The intersection of two objects
ar: تقاطع كائنين
de: Der Schnittpunkt zweier Objekte
ja: 2 つのオブジェクトの交点
nl: Het snijden van twee objecten

source: Intersect this Circle
ar: قاطع هذه الدّائرة
de: Schnittpunkt dieses Kreises
ja: この円が
nl: Deze cirkel snijden

source: Intersect this Conic
ar: قاطع هذا المقطع المخروطيّ
de: Schnittpunkt dieses Kegelschnitts
ja: この二次曲線が
nl: Deze kegelsnede snijden

source: Intersect this Segment
ar: قاطع هذه القطعة
de: Schnittpunkt dieser Strecke
nl: Dit lijnstuk snijden

source: Intersect this Half-line
ar: قاطع هذا نصف الخطّ
de: Schnittpunkt dieses Strahls
nl: Deze halve lijn snijden

source: Intersect this Line
ar: قاطع هذا الخطّ
de: Schnittpunkt dieser Geraden
ja: この直線が
nl: Deze lijn snijden

source: Intersect this Cubic Curve
ar: قاطع منحنى المكعّب هذا
de: Schnittpunkt dieser kubischen Kurve
ja: この三次曲線が
nl: Deze derdegraads kromme snijden

source: Intersect this Arc
ar: قاطع هذا القوس
de: Schnittpunkt dieses Kreisbogens
ja: この弧が
nl: Deze cirkelboog snijden

source: Intersect this Polygon
ar: قاطع هذا المضلّع
de: Schnittpunkt dieses Polygons
ja: この多角形が
nl: Deze veelhoek snijden

source: Intersect this Polygonal
ar: قاطع هذا الخطّ المضلّع
de: Schnittpunkt mit dieser Polylinie
nl: Deze veelhoek snijden

source: with this Circle
ar: بهذه الدّائرة
de: mit diesem Kreis
ja: この円と交わる
nl: met deze cirkel

source: with this Conic
ar: بهذا المقطع المخروطيّ
de: mit diesem Kegelschnitt
ja: この二次曲線と交わる
nl: met deze deze kegelsnede

source: with this Segment
ar: بهذه القطعة
de: mit dieser Strecke
nl: met dit lijnstuk

source: with this Half-line
ar: بهذا نصف الخطّ
de: mit diesem Strahl
nl: met deze halve lijn

source: with this Line
ar: بهذا الخطّ
de: mit dieser Geraden
ja: この直線と交わる
nl: met deze lijn
