Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
de: Thorsten Mürell
ja: Shushi Kurose,KIMIZUKA Tomokazu
nl: Dominique Devriese,Rinse de Vries,Jaap Woldringh,Tom Albers,Freek de Kruijf t/m 2024

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
de: thorsten@muerell.de
ja: md81@bird.email.ne.jp,sgtom@pluto.dti.ne.jp
nl: devriese@kde.org,rinse@kde.nl,,tomalbers@kde.nl,freekdekruijf@kde.nl

source: Circle by Center && Line
ar: دائرة بمركز وخط
de: Kreis durch Mittelpunkt && Gerade
ja: 中心と直線による円
nl: Cirkel met middelpunt && lijn

source: A circle constructed by its center and tangent to a given line
ar: دائرة إنشِئَت من مركزها ومماسّة لخط معيّن
de: Konstruiert mittels eines Mittelpunktes einen Kreis, der von einer gegebenen Geraden tangiert wird.
ja: 与えられた中心と接線から作図される円
nl: Teken een cirkel met gegeven middelpunt en raaklijn

source: Construct a circle tangent to this line
ar: أنشِئ دائرة مماسّة لهذا الخط
de: Konstruiert einen Kreis, der diese Gerade tangiert
ja: この直線に接する円を作成
nl: Teken een cirkel die deze lijn raakt

source: Select the line that the new circle should be tangent to...
ar: اختر الخط الذي ينبغي أن تماسّه الدائرة الجديدة...
de: Wählen Sie die Gerade, die den neuen Kreis tangieren soll ...
ja: 新しい円の接線となる直線を選択...
nl: Selecteer de raaklijn van de nieuwe cirkel...

source: Circle by Point && Segment (as the Diameter)
ar: دائرة بنقطة وقطعة (كقطر)
de: Kreis durch Punkt und Strecke (als Durchmesser)
ja: 点と線分 (直径) による円
nl: Cirkel met punt && lijnstuk (voor de diameter)

source: A circle defined by its center and the length of a segment as the diameter
ar: دائرة حُدِّدَت بمركزها وطول قطعة كقطر
de: Ein Kreis, der durch seinen Mittelpunkt und die Länge einer Strecke als Durchmesser bestimmt wird.
ja: 中心と直径となる線分の長さで定義される円
nl: Een cirkel met gegeven middelpunt en diameter ( gegeven als de lengte van een lijnstuk)

source: Construct a circle with the diameter given by the length of this segment
ar: أنشِئ دائرةً بقطر مُعطىً بطول هذه القطعة
de: Konstruiert einen Kreis mit dem Durchmesser, der durch die Länge dieser Strecke bestimmt wird.
ja: この線分の長さで与えられた直径で円を作成
nl: Teken een cirkel met een diameter die gelijk is aan de lengte van het gegeven lijnstuk

source: Select the segment whose length gives the diameter of the new circle...
ar: اختر القطعة التي يحدد طولها قطر الدائرة الجديدة...
de: Wählen Sie die Strecke, deren Länge den Durchmesser des neuen Kreises bestimmt ...
ja: 新しい円の直径を与える長さの線分を選択...
nl: Selecteer het lijnstuk waarvan de lengte de diameter is van de nieuwe cirkel...

source: Equilateral Triangle
ar: مثلث متساوي الأضلاع
de: Gleichseitiges Dreieck
ja: 正三角形
nl: Gelijkzijdige driehoek

source: Equilateral triangle with given two vertices
ar: مثلث متساوي الأضلاع برأسين معطيين
de: Gleichseitiges Dreieck mit zwei gegebenen Eckpunkten
ja: 与えられた 2 点を頂点とする正三角形
nl: Gelijkzijdige driehoek met twee gegeven hoekpunten

source: Evolute
ar: منشئ المنحنى
de: Krümmungsmittelpunktskurve
ja: 縮閉線

source: Evolute of a curve
ar: منشئ منحنى
de: Krümmungsmittelpunktskurve einer Kurve
ja: 曲線の縮閉線
nl: Evolute van een kromme

source: Evolute of this curve
ar: منشئ هذا المنحنى
de: Krümmungsmittelpunktskurve dieser Kurve
ja: この曲線の縮閉線
nl: Evolute van deze kromme

source: Osculating Circle
ar: دائرة تقبيل
de: Schmiegungskurve
ja: 接触円
nl: Osculerende cirkel

source: Osculating circle of a curve at a point
ar: دائرة تقبيل لمنحنى عند نقطة
de: Schmiegungskurve einer Kurve an einem Punkt
ja: 曲線上の点において二次の接触をする円
nl: Osculerende cirkel van een kromme in een punt

source: Osculating circle of this curve
ar: دائرة تقبيل هذا المنحنى
de: Schmiegungskurve dieser Kurve
ja: この曲線の接触円
nl: Osculerende cirkel van deze kromme

source: Osculating circle at this point
ar: دائرة تقبيل عند هذه النقطة
de: Schmiegungskreis an diesem Punkt
ja: この点における接触円
nl: Osculerende cirkel in dit punt

source: Select the point...
ar: اختر النقطة...
de: Wählen Sie den Punkt ...
ja: 点を選択...
nl: Selecteer het punt...

source: Square
ar: مربع
de: Quadrat
ja: 正方形
nl: Vierkant

source: Square with two given adjacent vertices
ar: مربع برأسين متجاورين معطيين
de: Quadrat durch zwei gegebene benachbarte Eckpunkte
ja: 隣り合う 2 頂点を与えられた正方形
nl: Vierkant met twee gegeven naastgelegen hoekpunten

source: Vector Difference
ar: فرق المتجه
de: Vektordifferenz
ja: ベクトルの差
nl: Vectorverschil

source: Construct the vector difference of two vectors.
ar: أنشِئ فرق المتجه لمتجهين.
de: Eine Vektordifferenz aus zwei gegebenen Vektoren konstruieren.
ja: 2 つのベクトルの差ベクトルを作成します。
nl: Teken het verschil van twee vectoren.

source: Construct the vector difference of this vector and another one.
ar: أنشِئ فرق المتجه لهذا المتجه ومتجه آخر.
de: Konstruiert die Vektordifferenz dieses Vektors und eines anderen.
ja: このベクトルともう 1 つのベクトルの差ベクトルを作成します。
nl: Teken de verschilvector van deze en een andere vector.

source: Construct the vector difference of the other vector and this one.
ar: أنشِئ فرق المتجه للمتجه الآخر وهذا المتجه.
de: Konstruiert die Vektordifferenz zwischen einem anderen Vektor und diesem.
ja: 先のベクトルとこのベクトルの差ベクトルを作成します。
nl: Teken de verschilvector van de andere vector en deze.

source: Construct the vector difference starting at this point.
ar: أنشِئ فرق المتجه بدءًا من هذه النقطة.
de: Konstruiert die Vektordifferenz mit diesem Startpunkt.
ja: この点を差ベクトルの始点とします。
nl: Teken de verschilvector vanuit dit punt.

source: Select the first of the two vectors of which you want to construct the difference...
ar: اختر المتجه الأول من المتجهين الذي تريد أن تنشِئ فرق المتجه الخاص به...
de: Wählen Sie den ersten der zwei Vektoren, von denen Sie die Differenz konstruieren möchten ...
ja: 差をとる 2 つのベクトルの 1 番目のベクトルを選択...
nl: Selecteer de eerste van de twee vectoren waarvan u de verschilvector wilt tekenen...

source: Select the other of the two vectors of which you want to construct the difference...
ar: اختر المتجه الآخر من المتجهين الذي تريد أن تنشِئ فرق المتجه الخاص به...
de: Wählen Sie den zweiten der beiden Vektoren, deren Differenz Sie konstruieren möchten ...
ja: 差をとる 2 つのベクトルの 2 番目のベクトルを選択...
nl: Selecteer de tweede van de twee vectoren waarvan u de verschilvector wilt tekenen...

source: Select the point to construct the difference vector in...
ar: اختر النقطة لإنشاء فرق المتجه فيها...
de: Wählen Sie einen Punkt, in dem der Differenzvektor konstruiert wird ...
ja: 差ベクトルを作成する点を選択...
nl: Selecteer het beginpunt van de verschilvector...

source: Export to &Asymptote...
ar: ص&دِّر إلى Asymptote...
de: Als &Asymptote exportieren ...
nl: Exporteren naar &Asymptoot...

source: &Asymptote...
ar: &خط مقارب...
nl: &Asymptoot...

source: Asymptote Documents (*.asy)
ar: مستندات Asymptote (*.asy)
de: Asymptote-Dokument (*.asy)
nl: Asymptoot-documenten (*.asy)

source: Export as Asymptote script
ar: صدِّر كبرنامج نصي Asymptote
de: Als Asymptotenskript exportieren
nl: Exporteren als Asymptootscript

source: Asymptote Options
ar: خيارات Asymptote
de: Einstellungen für Asymptote
nl: Asymptootopties

source: The file "%1" could not be opened. Please check if the file permissions are set correctly.
ar: لم أستطع فتح الملف "%1". رجاء، افحص إعدادات صلاحيات الملف.
de: Die Datei „%1“ kann nicht geöffnet werden. Bitte überprüfen Sie, ob die Dateirechte korrekt eingestellt sind.
ja: ファイル ‘%1’ を開けませんでした。ファイルのパーミッションが正しく設定されているか確認してください。
nl: Het bestand "%1" kon niet worden geopend. Controleer of de toegangsrechten goed zijn ingesteld.

source: Options
ar: خيارات
de: Einstellungen
ja: オプション
nl: Opties

source: Show Extra Frame
ar: أظهِر إطارًا إضافيًا
de: Zusatzrahmen anzeigen
ja: ページの外枠を表示
nl: Extra kader tonen

source: Show Axes
ar: إظهر المحاور
de: Achsen anzeigen
ja: 軸を表示
nl: Assen tonen

source: Show Grid
ar: اعرض الشبكة
de: Gitternetzlinien anzeigen
ja: グリッドを表示
nl: Raster tonen

source: This is an XFig file, not a Cabri figure.
ar: هذا ملف XFig، وليس رسم Cabri.
de: Dies ist eine XFig-Datei, nicht eine Cabri-Zeichnung
ja: これは XFig のファイルです。Cabri のデータではありません。
nl: Dit is een XFig-bestand, en niet een Cabri-figuur.

source: This Cabri version (%1) is not supported yet. Please contact the Kig authors to help supporting this Cabri version.
ar: إصدار Cabri هذا (%1) غير متاح بعد. يرجى الاتصال بمؤلفي كيج للمساعدة في دعم إصدار Cabri هذا.
de: Diese Version von Cabri (%1) wird noch nicht unterstützt. Bitte kontaktieren Sie die Kig-Autoren, um Ihnen bei der Unterstützung dieser Cabri-Version zu helfen.
ja: この Cabri バージョン (%1) はまだサポートしていません。 このバージョンの Cabri をサポートする手助けをするには、Kig の作者に連絡してください。
nl: Deze versie (%1) van Cabri wordt nu nog niet ondersteund. Neem contact op met de auteurs van Kig als u wilt helpen met de ondersteuning van deze versie van Cabri.

source: This Cabri file contains a "%1" object, which Kig does not currently support.
ar: يحتوي ملف Cabri هذا على كائن "%1"، والذي لا يدعمه كيج حاليًا.
de: Diese Cabri-Datei enthält ein „%1“-Objekt, das Kig noch nicht unterstützt.
ja: この Cabri ファイルは、現在 Kig ではサポートしていないオブジェクト “%1” を含んでいます。
nl: Dit Cabri-bestand bevat een "%1"-object, dit wordt door Kig momenteel niet ondersteund.

source: An error was encountered at line %1 in file %2.
ar: حدث خطأ في السطر %1 في الملف %2.
de: Es ist ein Fehler in Zeile %1 der Datei %2 aufgetreten.
ja: ファイル ‘%2’ の %1 行目でエラーが発生しました。
nl: Er deed zich een fout voor in regel %1 in het bestand %2.

source: The Dr. Geo file "%1" is a macro file so it contains no figures.
ar: ملف Dr. Geo هذا "%1" هو ملف ماكرو لذا لا يحتوي على أي رسوم.
de: Die Dr. Geo-Datei „%1“ ist eine Makrodatei, die keine Zeichnungen enthält.
ja: Dr. Geo のファイル ‘%1’ はマクロファイルのため、図形を含んでいません。
nl: Het Dr. Geo-bestand "%1" is een macro-bestand en bevat dus geen figuren.

source: There are no figures in Dr. Geo file "%1".
ar: لا يوجد أي رسوم في ملف Dr. Geo هذا "%1".
de: Es sind keine Zeichnungen in der Dr. Geo-Datei „%1“.
ja: Dr. Geo のファイル ‘%1’ には図形がありません。
nl: Er zijn geen figuren in het Dr. Geo-bestand "%1".

source: Dr. Geo Filter
ar: مرشّح Dr. Geo
ja: Dr. Geo のフィルタ

source: The current Dr. Geo file contains more than one figure. Please select which to import:
ar: ملف Dr. Geo الحالي يحتوي على أكثر من رسم واحد. يرجى اختيار أي منها تريد استيراده:
de: Die aktuelle Dr. Geo-Datei enthält mehr als eine Zeichnung. Bitte wählen Sie die zu importierende:
ja: 現在の Dr. Geo のファイルは 2 つ以上の図形を含んでいます。 どれをインポートするか選んでください:
nl: In het huidige Dr. Geo-bestand zijn meerdere figuren aanwezig. Kies welke u wilt importeren:

source: This Dr. Geo file contains a "%1 %2" object, which Kig does not currently support.
ar: يحتوي ملف Dr. Geo هذا على كائن "%1 %2"، والذي لا يدعمه كيج حاليًا.
de: Diese Dr. Geo-Datei enthält ein „%1 %2“-Objekt, das Kig noch nicht unterstützt.
ja: この Dr. Geo のファイルは、現在 Kig ではサポートしていないオブジェクト “%1 %2” を含んでいます。
nl: Dit Dr. Geo-bestand bevat een "%1 %2"-object, dit wordt door Kig momenteel niet ondersteund.

source: This Dr. Geo file contains an intersection type, which Kig does not currently support.
ar: يحتوي ملف Dr. Geo هذا على نوع تقاطع لا يدعمه كيج حاليًا.
de: Diese Dr. Geo-Datei enthält einen Überschneidungstyp, den Kig zurzeit nicht unterstützt.
ja: この Dr. Geo のファイルは、現在 Kig ではサポートしていない交点タイプを含んでいます。
nl: Dit Dr. Geo-bestand bevat objecten die elkaar snijden, dit wordt door Kig momenteel niet ondersteund.

source: &Export to image
ar: ص&دِّر إلى صورة
de: In Bild &exportieren
ja: 画像にエクスポート(&E)
nl: Naar afbeeldingsbestand &exporteren

source: &Image...
ar: &صورة...
de: B&ild ...
ja: 画像(&I)...
nl: Afbeeld&ing...

source: Export as Image
ar: صدِّر كصورة
de: Als Bild exportieren
ja: 画像としてエクスポート
nl: Als afbeelding exporteren

source: Image Options
ar: خيارات الصّورة
de: Bildeinstellungen
ja: 画像オプション
nl: Afbeeldingsopties

source: Sorry, this file format is not supported.
ar: عذرًا، صيغة الملف هذه غير متاحة.
de: Dieses Dateiformat wird nicht unterstützt.
ja: 残念ながら、このファイルフォーマットはサポートしていません。
nl: Helaas, dit bestandstype wordt niet ondersteund.

source: Sorry, something went wrong while saving to image "%1"
ar: عذراً هناك خطأ حدث أثناء حفظ الصورة "%1"
de: Beim Speichern in das Bild „%1“ ist ein Fehler aufgetreten.
ja: 残念ながら、画像 “%1” への保存中に問題が発生しました。
nl: Helaas, er ging iets fout bij het opslaan naar de afbeelding "%1"

source: &Export To
ar: ص&دِّر إلى
de: &Exportieren nach
ja: エクスポート(&E)
nl: &Exporteren naar

source: The file "%1" could not be opened. This probably means that it does not exist, or that it cannot be opened due to its permissions
ar: تعذر فتح الملف "%1". هذا يعني على الأرجح أنه غير موجود، أو أنه لا يمكن فتحه بسبب أذوناته
de: Die Datei „%1“ kann nicht geöffnet werden. Das bedeutet vielleicht, dass sie nicht existiert, oder dass sie aufgrund ihrer Rechte nicht geöffnet werden kann.
ja: ファイル ‘%1’ を開けませんでした。おそらくファイルが存在しないか、アクセス許可がありません。
nl: Het bestand "%1" kon niet worden geopend. Dit betekent waarschijnlijk dat het niet bestaat, of dat uw toegangsrechten ontoereikend zijn om het te openen

source: An error was encountered while parsing this file. It cannot be opened.
ar: حدث خطأ أثناء تحليل هذا الملف. لا يمكن فتحه.
de: Beim Einlesen dieser Datei ist ein Fehler aufgetreten. Sie kann nicht geöffnet werden.
nl: Er deed zich een fout voor tijdens het ontleen van dit bestand. Het kan niet worden geopend.

source: Parse Error
ar: خطأ في التحليل
de: Lesefehler
ja: 解析エラー
nl: Leesfout

source: Not Supported
ar: غير متاح
de: Nicht unterstützt
ja: サポートされていません
nl: Niet ondersteund

source: Kig cannot open this file.
ar: لا يستطيع كيج فتح هذا الملف.
de: Kig kann die Datei nicht öffnen.
nl: Kig kan dit bestand niet openen.

source: Resolution
ar: الدقّة
de: Auflösung
ja: 解像度
nl: Resolutie

source: &Keep Aspect Ratio
ar: أ&بقِ النّسبة الباعيّة
de: &Seitenverhältnis beibehalten
ja: アスペクト比を保つ(&K)
nl: Aspectverhouding &behouden

source: Height:
ar: الارتفاع:
de: Höhe:
ja: 高さ:
nl: Hoogte:

source: Width:
ar: العرض:
de: Breite:
ja: 幅:
nl: Breedte:

source: This KSeg document uses a scaling transformation, which Kig currently cannot import.
ar: يستخدم مستند KSeg هذا تحويلًا بالقياس، والذي لا يستطيع كيج استيراده حاليًا.
de: Dieses KSeg-Dokument benutzt eine Skalierungstransformation, die Kig zurzeit nicht importieren kann.
ja: この KSeg 文書は、現在 Kig では読み込めないスケーリング変換を使っています。
nl: In dit KSeg-document wordt een vermenigvuldigingstransformatie toegepast, het kan momenteel niet door Kig worden geïmporteerd.

source: This KSeg file contains a filled circle, which Kig does not currently support.
ar: يحتوي ملف KSeg هذا على دائرة ممتلئة، والتي لا يدعمها كيج حاليًا.
de: Diese KSeg-Datei enthält einen gefüllten Kreis, den Kig zurzeit nicht unterstützt.
ja: この KSeg ファイルは、現在 Kig ではサポートしていない黒丸を含んでいます。
nl: Dit KSeg-bestand bevat een ingevulde cirkel, dit wordt door Kig momenteel niet ondersteund.

source: This KSeg file contains an arc sector, which Kig does not currently support.
ar: يحتوي ملف KSeg هذا على قطاع قوس، والذي لا يدعمه كيج حاليًا.
de: Diese KSeg-Datei enthält einen Bogensektor, den Kig zurzeit nicht unterstützt.
ja: この KSeg ファイルは、現在 Kig ではサポートしていない扇形を含んでいます。
nl: Dit KSeg-bestand bevat een boogsector, dit wordt door Kig momenteel niet ondersteund.

source: This KSeg file contains an arc segment, which Kig does not currently support.
ar: يحتوي ملف KSeg هذا على قطعة قوس، والتي لا يدعمها كيج حاليًا.
de: Diese KSeg-Datei enthält ein Bogensegment, das Kig zurzeit nicht unterstützt.
ja: この KSeg ファイルは、現在 Kig ではサポートしていない弧の線分を含んでいます。
nl: Dit KSeg-bestand bevat een boogsegment, dit wordt door Kig momenteel niet ondersteund.

source: Export to &Latex...
ar: ص&دِّر إلى لاتخ...
de: Als &LaTeX exportieren ...
ja: LaTeX にエクスポート(&L)...
nl: Exporteren naar &Latex...

source: &Latex...
ar: &لاتخ...
ja: LaTeX(&L)...

source: Latex Documents (*.tex)
ar: مستندات لاتخ (*.tex)
de: LaTeX-Dokument (*.tex)
nl: Latex documenten (*.tex)

source: Export as Latex
ar: صدِّر كلاتخ
de: Als LaTeX exportieren
ja: LaTeX としてエクスポート
nl: Exporteren als Latex

source: Latex Options
ar: خيارات لاتخ
de: LaTeX-Einstellungen
ja: LaTeX オプション
nl: Latex-opties

source: Output format
ar: هيئة المخرجات
de: Ausgabeformat
nl: Uitvoerformaat

source: Asymptote
ar: خط مقارب
nl: Asymptoot

source: Document options
ar: خيارات المستند
de: Dokumenteinstellungen
ja: 文書オプション
nl: Documentopties

source: Picture only
ar: الصورة فقط
de: Nur Bild
nl: Alleen plaatje

source: Standalone document
ar: مستند مستقل
de: Selbstständiges Dokument
ja: スタンドアローンの文書
nl: Afzonderlijk document

source: This file was created by Kig version "%1", which this version cannot open.
ar: أُنشِئ هذا الملف بواسطة إصدار كيج "%1"، والذي لا يمكن فتحُه بواسطة هذا الإصدار.
de: Diese Datei wurde von Kig-Version „%1“ erstellt, sie kann mit dieser Kig-Version nicht geöffnet werden.
ja: このファイルは Kig バージョン %1 で作成されているので開くことができません。
nl: Dit bestand is gemaakt met Kig-versie "%1". Deze versie van Kig kan dit niet openen.

source: This file was created by Kig version "%1". Support for older Kig formats (pre-0.4) has been removed from Kig. You can try to open this file with an older Kig version (0.4 to 0.6), and then save it again, which will save it in the new format.
ar: أُنشِئ هذا الملف بواسطة إصدار كيج "%1". أُزيل الدعم لصيغ كيج القديمة (ما قبل 0.4) من كيج. يمكنك محاولة فتح هذا الملف باستخدام إصدار كيج أقدم (0.4 إلى 0.6)، ومن ثم حفظه مرة أخرى، مما سيحفظه بالصيغة الجديدة.
de: Diese Datei wurde von Kig der Version „%1“ erzeugt. Unterstützung für ältere Kig-Formate (vor 0.4) wurde aus Kig entfernt. Sie können versuchen, diese Datei mit einer älteren Version (0.4 bis 0.6) zu öffnen, und dann neu zu speichern, was im neuen Format geschieht.
ja: このファイルは Kig バージョン %1 で作成されています。 Kig のバージョン 0.4 より前のフォーマットはもうサポートしていません。 このファイルをバージョン 0.4 から 0.6 の Kig で開いて、 新しいフォーマットで再度保存してみてください。
nl: Dit bestand is gemaakt met Kig-versie "%1" Kig ondersteunt niet meer de oudere Kig-bestanden (ouder dan versie 0.4) U kunt proberen of u het bestand kunt openen met een oudere versie (0.4 tot 0.6) van Kig, en het daarna weer opslaan, het wordt dan in het nieuwe formaat opgeslagen.

source: This Kig file has a coordinate system that this Kig version does not support. A standard coordinate system will be used instead.
ar: يحتوي ملف كيج هذا على نظام إحداثيات لا يدعمه إصدار كيج هذا. سيُستَخدم نظام إحداثيات قياسي بدلاً من ذلك.
de: Diese Kig-Datei hat ein Koordinatensystem, das diese Kig-Version nicht unterstützt. Ein normales Koordinatensystem wird stattdessen benutzt.
ja: この Kig ファイルには、このバージョンの Kig ではサポートされていない座標系があります。代わりに標準の座標系を使います。
nl: Dit Kig-bestand gebruikt een coördinatenstelsel dat niet wordt ondersteund door deze Kig-versie. In plaats daarvan zal een standaard coördinatenstelsel worden gebruikt.

source: This Kig file uses an object of type "%1", which this Kig version does not support.Perhaps you have compiled Kig without support for this object type,or perhaps you are using an older Kig version.
ar: يستخدم ملف كيج هذا كائنًا من النوع "%1"، والذي لا يدعمه إصدار كيج هذا. ربما قمتَ بتجميع كيج بدون دعم لنوع الكائن هذا، أو ربما تستخدم إصدار كيج أقدم.
de: Diese Kig-Datei benutzt ein Objekt des Typs „%1“, das diese Kig-Version nicht unterstützt. Vielleicht haben Sie Kig ohne Unterstützung dieses Objekttyps kompiliert oder vielleicht benutzen Sie eine ältere Kig-Version.
ja: この Kig ファイルは、このバージョンの Kig ではサポートしていないタイプ “%1” のオブジェクトを使っています。おそらく、このオブジェクトタイプをサポートせずに Kig をコンパイルしたか、Kig の古いバージョンを使っていると思われます。
nl: Dit Kig-bestand bevat een object van het type "%1". Uw versie van Kig heeft hiervoor geen ondersteuning. Mogelijk is uw versie van Kig gecompileerd zonder ondersteuning voor dit objecttype, of gebruikt u een oudere versie van Kig.

source: This Kig file uses an object of type "%1", which is obsolete, you should save the construction with a different name and check that it works as expected.
ar: يستخدم ملف كيج هذا كائنًا من النوع "%1"، والذي هو عفا عليه الزمن، ينبغي عليك حفظ الإنشَاء باسم مختلف والتحقق من أنه يعمل كما هو متوقع.
de: Diese Kig-Datei benutzt ein Objekt des Typs „%1“, das veraltet ist. Sie sollten die Konstruktion unter einem anderen Namen speichern und testen, ob sie wie erwartet funktioniert.
ja: この Kig ファイルは、廃止されたタイプ “%1” のオブジェクトを使っています。作成を別の名前で保存して期待どおりに動くか確認してください。
nl: In dit Kig-bestand komt een object voor van het verouderde type "%1". U moet de constructie met een andere naam opslaan en nagaan of het naar verwachting werkt.

source: &Export to SVG...
ar: ال&تصدير إلى SVG...
de: In SVG &exportieren ...
ja: SVG にエクスポート(&E)...
nl: &Exporteren naar SVG...

source: Scalable Vector Graphics (*.svg)
ar: رسوميات متجهية متدرّجة (*.svg)
de: Skalierbare Vektorgrafik (*.svg)

source: Export as SVG
ar: صدِّر كـ SVG
de: Als SVG exportieren
ja: SVG としてエクスポート
nl: Exporteren als SVG

source: SVG Options
ar: خيارات SVG
de: SVG-Einstellungen
ja: SVG オプション
nl: SVG-opties

source: Sorry, something went wrong while saving to SVG file "%1"
ar: عذرًا، حدث خطأ أثناء الحفظ في ملف SVG "%1"
de: Das Speichern in die SVG-Datei „%1“ kann nicht abgeschlossen werden.
ja: 残念ながら、SVG ファイル ‘%1’ への保存中に問題が発生しました。
nl: Helaas, er ging iets fout bij het opslaan in SVG-bestand "%1"

source: Export to &XFig file
ar: ص&دِّر إلى ملف XFig
de: E&xport in eine XFig-Datei
ja: XFig ファイルにエクスポート(&X)
nl: Exporteren naar &XFig-bestand

source: &XFig File...
ar: ملف &XFig...
de: &XFig-Datei ...
ja: XFig ファイル(&X)...
nl: &XFig-bestand...

source: XFig Documents (*.fig)
ar: مستندات XFig (*.fig)
de: XFig-Dokument (*.fig)
nl: XFig-documenten (*.fig)

source: Export as XFig File
ar: صدِّر كملف XFig
de: E&xport als XFig-Datei
ja: XFig ファイルとしてエクスポート
nl: Exporteren als XFig-bestand

source: Kig
ar: كيج

source: KDE Interactive Geometry
ar: هندسة تفاعلية من كيدي
de: Interaktive Geometrie für KDE
ja: KDE インタラクティブ・デザイナー

source: (C) 2002-2005, The Kig developers
ar: (C) 2002-2005، مطورو كيج
de: © 2002–2005, Die Kig-Entwickler
ja: (C) 2002-2005, Kig 開発チーム
nl: (C) 2002-2005, De Ontwikkelaars van Kig

source: David E. Narvaez
ar: ديفيد إي. نارفيز

source: Current maintainer.
ar: الصائن الحاليّ
de: Aktueller Betreuer
nl: Huidige onderhouder

source: Dominique Devriese
ar: دومينيك ديفريز

source: Original author, former maintainer, design and lots of code.
ar: المؤلف الأصلي، والصائن السابق، والتصميم والكثير من الشيفرة.
de: Ursprünglicher Autor, früherer Betreuer, Design und Berge von Quellcode.
nl: Originele auteur, voormalige onderhouder, ontwerp en veel programmacode.

source: Maurizio Paolini
ar: ماوريتسيو باوليني

source: Did a lot of important work all around Kig, including, but not limited to conics, cubics, transformations and property tests support.
ar: أنجز الكثير من العمل الهام حول كيج، بما في ذلك، على سبيل المثال لا الحصر، المخروطات، التكعيبات، التحويلات ودعم اختبارات الخصائص.
de: Hat den mathematikintensiven Teil der Arbeit übernommen, inklusive den Kegelschnitten, Kubischen Funktionen, Transformationen und Eigenschaften-Tests.
ja: 二次曲線、三次曲線、変換、プロパティテストのサポートをはじめとする、Kig 全般にわたる多くの重要な作業を行った。
nl: Deed veel belangrijk werk voor Kig, onder andere kegelsneden, derdegraads krommen, transformaties en het testen van eigenschappen.

source: Pino Toscano
ar: بينو توسكانو

source: Former maintainer, Dr. Geo import filter, point and line styles, Italian translation, miscellaneous stuff here and there.
ar: الصائن السابق، مرشّح استيراد Dr. Geo، أنماط النقاط والخطوط، الترجمة الإيطالية، وأشياء متفرقة هنا وهناك.
de: Früherer Betreuer, Dr. Geo Importfilter, Punkt- und Linienstile, italienische Übersetzung, viele nützliche Sachen hier und da.
nl: Voormalige onderhouder, het importfilter voor Dr. Geo, weergave met punten en lijnen, de Italiaanse vertaling en nog het een en ander.

source: Franco Pasquarelli
ar: فرانكو باسكواريلي
