Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Hyperbola by Asymptotes && Point
ar: قطع زائد بمقاربات ونقطة
de: Hyperbel durch Asymptoten && Punkt
ja: 漸近線と点による双曲線
nl: Hyperbool met asympoten && punt

source: A hyperbola with given asymptotes through a point
ar: قطع زائد بمقاربات معطاة من خلال نقطة
de: Eine Hyperbel mit den gegebenen Asymptoten durch einen Punkt
ja: 1 点を通り、与えられた漸近線を持つ双曲線
nl: Een hyperbool met gegeven asymptoten, en door een punt

source: Ellipse by Focuses && Point
ar: قطع ناقص ببؤرتين ونقطة
de: Ellipse durch Brennpunkte && Punkt
ja: 焦点と点による楕円
nl: Ellips met brandpunten && punt

source: An ellipse constructed by its focuses and a point that pertains to it
ar: قطع ناقص أنشِئَ ببؤرتيه ونقطة تنتمي إليه
de: Eine Ellipse konstruiert durch ihre Brennpunkte und einen Punkt, der zu ihr gehört
ja: 焦点と内包点によって作られる楕円
nl: Een ellips met gegeven brandpunten, en door een punt

source: Hyperbola by Focuses && Point
ar: قطع زائد ببؤرتين ونقطة
de: Hyperbel durch Brennpunkte && Punkt
ja: 焦点と点による双曲線
nl: Hyperbool met brandpunten && punt

source: A hyperbola constructed by its focuses and a point that pertains to it
ar: قطع زائد أنشِئَ ببؤرتيه ونقطة تنتمي إليه
de: Eine Hyperbel konstruiert durch ihre Brennpunkte und einen Punkt, der zu ihr gehört
ja: 焦点と内包点によって作られる双曲線
nl: Een hyperbool met geven brandpunten, en door een punt

source: Conic by Directrix, Focus && Point
ar: مخروط بدليل وبؤرة ونقطة
de: Kegelschnitt mittels Leitlinie, Brennpunkt && Punkt
ja: 準線と焦点と点による二次曲線
nl: Kegelsnede met richtlijn, brandpunt && punt

source: A conic with given directrix and focus, through a point
ar: مخروط بدليل وبؤرة معطيين، من خلال نقطة
de: Ein Kegelschnitt mit gegebener Leitlinie und Brennpunkt, der durch einen Punkt verläuft
ja: 1 点を通り、与えられた準線と焦点を持つ二次曲線
nl: Een kegelsnede met gegeven richtlijn en brandpunt, en door een punt

source: Vertical Parabola by Three Points
ar: قطع مكافئ عمودي بثلاث نقاط
de: Vertikale Parabel durch drei Punkte
ja: 3 点による垂直放物線
nl: Verticale parabool door drie punten

source: A vertical parabola constructed through three points
ar: قطع مكافئ عمودي أنشِئَ من خلال ثلاث نقاط
de: Eine vertikale Parabel konstruiert durch drei Punkte
ja: 3 点を通って作られる垂直放物線
nl: Een verticale parabool door drie punten

source: Cubic Curve by Nine Points
ar: منحنى تكعيبي بتسع نقاط
de: Kubische Kurve durch neun Punkte
ja: 9 点による三次曲線
nl: Derdegraads kromme door negen Punten

source: A cubic curve constructed through nine points
ar: منحنى تكعيبي أنشِئَ من خلال تسع نقاط
de: Eine kubische Kurve konstruiert durch neun Punkte
ja: 9 点を通って作られる三次曲線
nl: Een derdegraads kromme door negen punten

source: Polar Point of a Line
ar: نقطة قطبية لخط
de: Polpunkt einer Gerade
ja: 直線の極点
nl: Poolpunt van een lijn

source: The polar point of a line with respect to a conic.
ar: النقطة القطبية لخط بالنسبة لمخروط.
de: Der Polpunkt einer Gerade relativ zu einem Kegelschnitt.
ja: 二次曲線に関する直線の極点
nl: Het poolpunt van een gegeven lijn, bij een kegelsnede.

source: Polar Line of a Point
ar: خط قطبي لنقطة
de: Pollinie eines Punktes
ja: 点の極線
nl: Poollijn van een punt

source: The polar line of a point with respect to a conic.
ar: الخط القطبي لنقطة بالنسبة لمخروط.
de: Die Pollinie eines Punktes relativ zu einem Kegelschnitt.
ja: 二次曲線に関する点の極線
nl: De poollijn van een gegeven punt, bij een kegelsnede.

source: Cubic Curve with Node by Six Points
ar: منحنى تكعيبي بعقدة وست نقاط
de: Kubische Kurve mit Knoten durch sechs Punkte
ja: 6 点を通り節点を持つ三次曲線
nl: Derdegraads kromme met knooppunt, door zes punten

source: A cubic curve with a nodal point at the origin through six points
ar: منحنى تكعيبي بنقطة عقدية عند الأصل من خلال ست نقاط
de: Eine kubische Kurve mit einem Knotenpunkt am Ursprung durch sechs Punkte
ja: 6 点を通り、原点に節点を持つ三次曲線
nl: Een derdegraads kromme met een knooppunt in de oorsprong, en door zes punten

source: Cubic Curve with Cusp by Four Points
ar: منحنى تكعيبي بنقطة شائكة وأربع نقاط
de: Kubische Kurve mit Scheitelpunkt durch vier Punkte
ja: 4 点を通り尖点を持つ三次曲線
nl: Derdegraads kromme met keerpunt door vier punten

source: A cubic curve with a horizontal cusp at the origin through four points
ar: منحنى تكعيبي بنقطة شائكة أفقية عند الأصل من خلال أربع نقاط
de: Eine kubische Kurve mit einem horizontalen Scheitelpunkt am Ursprung durch vier Punkte
ja: 4 点を通り、原点に水平尖点を持つ三次曲線
nl: Een derdegraads kromme met keerpunt in de oorsprong, door vier punten

source: Cubic Function by Four Points
ar: دالة تكعيبية بأربع نقاط
de: Kubische Funktion mittels vier Punkten
ja: 4 点による三次関数
nl: Derdegraads kromme door vier punten

source: A cubic function through four points
ar: دالة تكعيبية من خلال أربع نقاط
de: Eine kubische Funktion durch vier Punkte
ja: 4 点を通る三次関数
nl: Derdegraads kromme door vier punten

source: Directrix of a Conic
ar: دليل مخروط
de: Leitlinie eines Kegelschnitts
ja: 二次曲線の準線
nl: Richtlijn van een kegelsnede

source: The directrix line of a conic.
ar: خط دليل مخروط.
de: Die Leitlinie eines Kegelschnitts.
ja: 二次曲線の準線
nl: De richtlijn van een kegelsnede.

source: Angle by Three Points
ar: زاوية بثلاث نقاط
de: Winkel durch drei Punkte
ja: 3 点による角
nl: Hoek met drie punten

source: An angle defined by three points
ar: زاوية حُدِّدَت بثلاث نقاط
de: Ein Winkel definiert durch drei Punkte
ja: 3 点で定義される角
nl: Een hoek bepaald door drie punten

source: Equilateral Hyperbola by Four Points
ar: قطع زائد متساوي الأضلاع بأربع نقاط
de: Gleichseitige Hyperbel durch vier Punkte
ja: 4 点による直角双曲線
nl: Rechthoekige hyperbool door vier punten

source: An equilateral hyperbola constructed through four points
ar: قطع زائد متساوي الأضلاع أنشِئَ من خلال أربع نقاط
de: Eine gleichseitige Hyperbel konstruiert durch vier Punkte
ja: 4 点によって作られる直角双曲線
nl: Een hyperbool met loodrecht op elkaar staande asymptoten getekend door vier punten

source: Construct the midpoint of this segment
ar: أنشِئ نقطة منتصف هذه القطعة
de: Den Mittelpunkt dieser Strecke konstruieren
ja: この線分の中点を作成
nl: Teken het midden van dit lijnstuk

source: Mid Point
ar: نقطة منتصف
de: Mittelpunkt
ja: 中点
nl: Midden

source: The midpoint of a segment or two other points
ar: نقطة منتصف لقطعة أو نقطتين أخريين
de: Mittelpunkt einer Strecke oder zweier Punkte
ja: 線分または異なる 2 点の中点
nl: Het midden van een lijnstuk of van twee andere punten

source: Construct the golden ratio point of this segment
ar: أنشِئ نقطة النسبة الذهبية لهذه القطعة
de: Den goldenen Schnitt dieser Strecke konstruieren
nl: Teken de gulden snede van dit lijnstuk

source: Golden Ratio Point
ar: نقطة النسبة الذهبية
de: Goldener Schnitt
nl: Gulden snede

source: The golden ratio point of a segment or two other points
ar: نقطة النسبة الذهبية لقطعة أو نقطتين أخريين
de: Goldener Schnitt einer Strecke oder zweier Punkte
nl: De gulden snede van een lijnstuk of twee andere punten

source: Vector
ar: متجه
de: Vektor
ja: ベクトル

source: Construct a vector from two given points.
ar: أنشِئ متجهًا من نقطتين معطاة.
de: Einen Vektor aus zwei gegebenen Punkten konstruieren.
ja: 与えられた 2 点からベクトルを作成
nl: Teken een vector met begin- en eindpunt.

source: Vector Sum
ar: جمع المتجهات
de: Vektorsumme
ja: ベクトルの和
nl: Somvector

source: Construct the vector sum of two vectors.
ar: أنشِئ جمع المتجهات لمتجهين.
de: Eine Vektorsumme aus zwei gegebenen Vektoren konstruieren.
ja: 2 つのベクトルの和ベクトルを作成
nl: Teken de somvector van twee vectoren.

source: Line by Vector
ar: خط بمتجه
de: Gerade durch Vektor
ja: ベクトルによる直線
nl: Lijn evenwijdig aan vector

source: Construct the line by a given vector though a given point.
ar: أنشِئ الخط بمتجه معطى من خلال نقطة معطاة.
de: Konstruiert eine Gerade an einem gegebenen Vektor durch einen gegebenen Punkt
ja: 与えられた 1 つの通過点と方向ベクトルから直線を作成
nl: Teken een lijn door een gegeven punt, evenwijdig aan een gegeven vector.

source: Half-Line by Vector
ar: نصف خط بمتجه
de: Strahl durch Vektor
ja: ベクトルによる半直線
nl: Halve rechte lijn evenwijdig aan vector

source: Construct the half-line by a given vector starting at given point.
ar: أنشِئ نصف الخط بمتجه معطى بدءًا من نقطة معطاة.
de: Konstruiert einen Strahl durch einen gegebenen Vektor, der an einem gegebenen Punkt beginnt
ja: 与えられた始点と方向ベクトルから半直線を作成
nl: Teken een halve rechte lijn vanuit een gegeven punt, in de richting van een gegeven vector.

source: Arc by Three Points
ar: قوس بثلاث نقاط
de: Kreisbogen durch drei Punkte
ja: 3 点による弧
nl: Cirkelboog door drie punten

source: Construct an arc through three points.
ar: أنشِئ قوسًا من خلال ثلاث نقاط.
de: Einen Kreisbogen durch drei Punkte konstruieren.
ja: 3 点を通る弧を作成
nl: Teken een cirkelboog door drie punten.

source: Conic Arc by Center and Three Points
ar: قوس مخروطي بمركز وثلاث نقاط
de: Konischen Bogen durch Mittelpunkt und drei Punkte
ja: 中心と 3 点による二次曲線の弧
nl: Kegelsnedeboog door middelpunt en drie punten

source: Construct a conic arc with given center through three points.
ar: أنشِئ قوسًا مخروطيًا بمركز معطى من خلال ثلاث نقاط.
de: Einen konischen Bogen mit gegebenem Mittelpunkt durch drei Punkte konstruieren.
ja: 3 点を通り、与えられた中心を持つ二次曲線の弧を作成
nl: Teken een kegelsnedeboog door een gegeven middelpunt drie punten.

source: Conic Arc by Five Points
ar: قوس مخروطي بخمس نقاط
de: Konischer Bogen mittels fünf Punkten
ja: 5 点による二次曲線の弧
nl: Kegelsnedeboog door vijf punten

source: Construct a conic arc through five points.
ar: أنشِئ قوسًا مخروطيًا من خلال خمس نقاط.
de: Einen konischen Bogen durch fünf Punkte konstruieren.
ja: 5 点を通る二次曲線の弧を作成
nl: Teken een kegelsnedeboog door vijf punten.

source: Arc by Center, Angle && Point
ar: قوس بمركز وزاوية ونقطة
de: Kreisbogen durch Mittelpunkt, Winkel && Punkt
ja: 中心と角と点による弧
nl: Cirkelboog met middelpunt, hoek && punt

source: Construct an arc by its center and a given angle, starting at a given point
ar: أنشِئ قوسًا بمركزه وزاوية معطاة، بدءًا من نقطة معطاة
de: Einen Kreisbogen durch Mittelpunkt, Winkel und Startpunkt konstruieren
ja: 与えられた中心と中心角による、与えられた 1 点から始まる弧を作成
nl: Teken een cirkelboog met gegeven middelpunt, gegeven hoekgrootte en die begint in een gegeven punt

source: Parabola by Directrix && Focus
ar: قطع مكافئ بدليل وبؤرة
de: Parabel durch Leitlinie && Brennpunkt
ja: 準線と焦点による放物線
nl: Parabool met richtlijn && brandpunt

source: A parabola defined by its directrix and focus
ar: قطع مكافئ حُدِّدَ بدليله وبؤرته
de: Eine Parabel definiert durch ihre Leitlinie und ihren Brennpunkt
ja: 準線と焦点によって定義される放物線
nl: Een parabool bepaald door gegeven richtlijn en brandpunt

source: Translate
ar: ترجم
de: Verschieben
ja: 平行移動
nl: Translaties

source: The translation of an object by a vector
ar: إزاحة كائن بمتجه
de: Die Verschiebung eines Objektes mittels eines Vektors
ja: ベクトルによるオブジェクトの平行移動
nl: Teken de translatie ( verschuiving ) van een gegeven object volgens een vector

source: Reflect in Point
ar: اعكس في نقطة
de: In einem Punkt spiegeln
ja: 点対称移動
nl: Spiegelen in punt

source: An object reflected in a point
ar: كائن معكوس في نقطة
de: Ein Objekt in einem Punkt spiegeln
ja: 点に関して対称なオブジェクト
nl: Een object gespiegeld in een punt

source: Reflect in Line
ar: اعكس في خط
de: An Gerade spiegeln
ja: 線対称移動
nl: Lijnspiegelen

source: An object reflected in a line
ar: كائن معكوس في خط
de: Ein Objekt an einer Geraden spiegeln
ja: 直線に関して対称なオブジェクト
nl: Een object gespiegeld in een lijn

source: Rotate
ar: دوّر
de: Drehen
ja: 回転
nl: Roteren

source: An object rotated by an angle around a point
ar: كائن دوِّرَ بزاوية حول نقطة
de: Ein Objekt in einem Winkel um einen Punkt drehen
ja: 点の周りに角で回転させたオブジェクト
nl: Roteer een object om een punt, over een hoek

source: Scale
ar: حجّم
de: Skalieren
ja: 拡大縮小
nl: Vermenigvuldigen

source: Scale an object over a point, by the ratio given by the length of a segment
ar: حجّم كائنًا فوق نقطة، بنسبة معطاة بطول قطعة
de: Skaliert ein Objekt an einem Punkt, der Faktor wird durch die Länge einer Strecke bestimmt
ja: 線分の長さで与えられる比率で、点に関して拡大縮小したオブジェクト
nl: Vermenigvuldig een object vanuit een punt, met een factor die gegeven is door de lengte van een lijnstuk

source: Scale over Line
ar: حجّم فوق خط
de: An einer Geraden skalieren
ja: 直線に関して拡大縮小
nl: Vermenigvuldigen in Lijn

source: An object scaled over a line, by the ratio given by the length of a segment
ar: كائن حُجِّمَ فوق خط، بنسبة معطاة بطول قطعة
de: Ein Objekt skaliert an einer Linie, der Faktor wird durch die Länge einer Strecke bestimmt
ja: 線分の長さで与えられる比率で、直線に関して拡大縮小したオブジェクト
nl: Een object, vermenigvuldigd in een lijn, met een factor die gegeven is door de lengte van een lijnstuk

source: Scale (ratio given by two segments)
ar: حجّم (نسبة معطاة بقطعتين)
de: Skalieren (Verhältnis bestimmt durch zwei Strecken)
ja: 拡大縮小 (比率は 2 つの線分で与えられる)
nl: Vermenigvuldigen (verhouding gegeven met twee lijnstukken)

source: Scale an object over a point, by the ratio given by the length of two segments
ar: حجّم كائنًا فوق نقطة، بنسبة معطاة بطول قطعتين
de: Skaliert ein Objekt an einem Punkt, der Faktor wird durch die Länge zweier Strecken bestimmt
ja: 2 つの線分の長さで与えられる比率で、点に関して拡大縮小したオブジェクト
nl: Vermenigvuldig een object vanuit een punt, met een factor die gegeven wordt door de verhouding van de lengtes van twee lijnstukken

source: Scale over Line (ratio given by two segments)
ar: حجّم فوق خط (نسبة معطاة بقطعتين)
de: Skalieren an einer Geraden (Verhältnis gegeben durch zwei Segmente)
ja: 直線に関して拡大縮小 (比率は 2 つの線分で与えられる)
nl: Vermenigvuldigen in een lijn (verhouding gegeven met twee lijnstukken)

source: An object scaled over a line, by the ratio given by the length of two segments
ar: كائن حُجِّمَ فوق خط، بنسبة معطاة بطول قطعتين
de: Ein Objekt skaliert an einer Geraden, der Faktor wird durch die Länge zweier Strecken bestimmt
ja: 2 つの線分の長さで与えられる比率で、直線に関して拡大縮小したオブジェクト
nl: Een object, vermenigvuldigd in een lijn, met een factor die gegeven wordt door de verhouding van de lengtes van twee lijnstukken

source: Apply Similitude
ar: طبّق تشابهًا
de: Ähnlichkeit anwenden
ja: 相似変換
nl: Toepassen van gelijkvormigheidstransformatie

source: Apply a similitude to an object (the sequence of a scaling and rotation around a center)
ar: طبّق تشابهًا على كائن (تسلسل قياس ودوران حول مركز)
de: Wendet Ähnlichkeit auf ein Objekt an (Die Abfolge von Skalierung und Drehung um einen Mittelpunkt)
ja: オブジェクトの相似変換 (中心の周りに拡大縮小および回転させたもの)
nl: Pas een gelijkvormigheidstransformatie toe op een object (door het object te vermenigvuldigen en te roteren vanuit/om een punt)

source: Harmonic Homology
ar: تجانس توافقي
de: Harmonische Homologie
ja: 調和ホモロジー
nl: Harmonische homologie

source: The harmonic homology with a given center and a given axis (this is a projective transformation)
ar: التجانس التوافقي بمركز معطى ومحور معطى (هذا تحويل إقلاعي)
de: Die harmonische Homologie mit einem gegeben Mittelpunkt und einer gegebenen Achse (Dies ist eine projektive Transformation)
ja: 与えられた中心および軸からなる調和ホモロジー
nl: De harmonische homologie vanuit een gegeven punt en met een gegeven as (dit is een projectieve transformatie)

source: Draw Projective Shadow
ar: ارسم ظلًا إقلاعيًا
de: Projektionsschatten zeichnen
ja: 投影の影を描く
nl: Projectieschaduw tekenen

source: The shadow of an object with a given light source and projection plane (indicated by a line)
ar: ظل كائن بمصدر ضوء معطى ومستوى إقلاعي (يُشار إليه بخط)
de: Der Schatten eines Objektes mit einer gegebenen Lichtquelle und einer Projektionsfläche (dargestellt durch eine Gerade)
ja: 任意の光源と投影面 (線で示される) によるオブジェクトの影
nl: De schaduw van een object, met een gegeven lichtbron en projectievlak (weergegeven door een lijn)

source: Asymptotes of a Hyperbola
ar: مقاربات قطع زائد
de: Asymptoten einer Hyperbel
ja: 双曲線の漸近線
nl: Asymptoten van een hyperbool

source: The two asymptotes of a hyperbola.
ar: مقاربي قطع زائد.
de: Die zwei Asymptoten einer Hyperbel.
ja: 双曲線の 2 つの漸近線
nl: De twee asymptoten van een hyperbool.

source: Triangle by Its Vertices
ar: مثلث برؤوسه
de: Dreieck durch seine Eckpunkte
ja: 3 頂点による三角形
nl: Driehoek met zijn hoekpunten

source: Construct a triangle given its three vertices.
ar: أنشِئ مثلثًا برؤوسه الثلاثة المعطاة.
de: Konstruiert ein Dreieck mit drei gegebenen Eckpunkten.
ja: 与えられた 3 つの頂点から三角形を作成
nl: Teken een driehoek als de drie hoekpunten gegeven zijn.

source: Convex Hull
ar: انغلاق محدب
de: Konvexkörper
ja: 凸包
nl: Convexe omhulling

source: A polygon that corresponds to the convex hull of another polygon
ar: مضلع يوافق الانغلاق المحدب لمضلع آخر
de: Ein Polygon, das der Konvexhülle eines anderen entspricht
ja: 与えられた多角形の凸包に相当する多角形を作成
nl: Een veelhoek die overeenkomt met de convexe omhulling van een andere veelhoek

source: Bézier Quadratic by its Control Points
ar: بيزييه تربيعي بنقاط تحكمه
de: Quadratische Bézierkurve durch ihre Kontrollpunkte
nl: Bézier kwadratische functie door zijn controlepunten

source: Construct a Bézier quadratic given its three control points.
ar: أنشِئ بيزييه تربيعيًا بنقاط تحكمه الثلاثة المعطاة.
de: Eine Quadratische Bézierkurve konstruiert durch ihre drei Kontrollpunkte
nl: Teken een Bézier kwadratische kromme door drie controlepunten.

source: Bézier Cubic by its Control Points
ar: بيزييه تكعيبي بنقاط تحكمه
de: Kubische Bézierkurve durch ihre Kontrollpunkte
nl: Bézier derdegraads functie door zijn controlepunten

source: Construct a Bézier cubic given its four control points.
ar: أنشِئ بيزييه تكعيبيًا بنقاط تحكمه الأربعة المعطاة.
de: Konstruiert eine kubische Bézierkurve mittels ihrer vier Kontrollpunkte
nl: Teken een Bézier derdegraads kromme door zijn vier controlepunten.

source: Rational Bézier Quadratic by its Control Points
ar: بيزييه تربيعي نسبي بنقاط تحكمه
de: Rationale Quadratische Bézierkurve durch ihre Kontrollpunkte
nl: Rationele Bézier kwadratische kromme door zijn controlepunten

source: Construct a Rational Bézier quadratic given its three control points.
ar: أنشِئ بيزييه تربيعيًا نسبيًا بنقاط تحكمه الثلاثة المعطاة.
de: Konstruiert eine rationale quadratische Bézierkurve mittels ihrer drei Kontrollpunkte
nl: Teken een rationele Bézier kwadratische kromme door zijn drie controlepunten.

source: Rational Bézier Cubic by its Control Points
ar: بيزييه تكعيبي نسبي بنقاط تحكمه
de: Rationale kubische Bézierkurve durch ihre Kontrollpunkte
nl: Rationele Bézier derdegraads kromme door zijn controlepunten.

source: Construct a Rational Bézier cubic given its four control points.
ar: أنشِئ بيزييه تكعيبيًا نسبيًا بنقاط تحكمه الأربعة المعطاة.
de: Konstruiert eine rationale kubische Bézierkurve mittels ihrer vier Kontrollpunkte
nl: Teken een rationele Bézier derdegraads kromme door zijn vier controlepunten.

source: Parallel Test
ar: اختبار التوازي
de: Parallelentest
ja: 平行性テスト
nl: Evenwijdigheidstest

source: Test whether two given lines are parallel
ar: اختبر ما إذا كان خطان معطيان متوازيين
de: Überprüft, ob zwei gegebene Geraden parallel sind
ja: 与えられた 2 つの直線が平行かどうかをテスト
nl: Testen of twee gegeven lijnen evenwijdig zijn

source: Orthogonal Test
ar: اختبار التعامد
ja: 直交性テスト
nl: Test op loodrecht zijn

source: Test whether two given lines are orthogonal
ar: اختبر ما إذا كان خطان معطيان متعامدين
de: Prüft, ob zwei gegebene Geraden senkrecht zueinander stehen
ja: 与えられた 2 つの直線が直交するかどうかをテスト
nl: Testen of twee gegeven lijnen loodrecht zijn

source: Collinear Test
ar: اختبار التوازي
de: Kollinear-Test
ja: 共線性テスト
nl: Test van op een lijn liggen

source: Test whether three given points are collinear
ar: اختبر ما إذا كانت ثلاث نقاط معطاة متوازية
de: Prüft, ob drei gegebene Punkte kollinear sind
ja: 与えられた 3 点が同一線上にあるかどうかをテスト
nl: Testen of drie gegeven punten op een rechte lijn liggen

source: Contains Test
ar: اختبار الاحتواء
de: Test auf Beinhaltung
ja: 内包性テスト
nl: Liggingstest

source: Test whether a given curve contains a given point
ar: اختبر ما إذا كان منحنى معطى يحتوي على نقطة معطاة
de: Prüft, ob eine gegeben Kurve einen gegebenen Punkt enthält
ja: 与えられた曲線が与えられた点を含むかどうかをテスト
nl: Testen of een gegeven punt op een gegeven kromme ligt

source: In Polygon Test
ar: اختبار في المضلع
de: Im-Polygon-Test
ja: 多角形内包性テスト
nl: Test op ligging binnen veelhoek

source: Test whether a given polygon contains a given point
ar: اختبر ما إذا كان المضلّع المعطى يحتوي على النّقطة المعطاة
de: Test, ob ein gegebenes Polygon einen gegebenen Punkt enthält
ja: 与えられた多角形が与えられた点を含むかどうかをテスト
nl: Testen of een gegeven punt binnen een gegeven veelhoek ligt

source: Convex Polygon Test
ar: اختبار تحدّب المضلّع
de: Konvexer Polygontest
ja: 多角形凸面性テスト
nl: Test voor convexe veelhoek

source: Test whether a given polygon is convex
ar: اختبر ما إذا كان المضلّع المعطى محدّبًا
de: Prüft, ob ein gegebenes Polygon konvex ist
ja: 与えられた多角形が凸であるかどうかをテスト
nl: Testen of een gegeven gegeven veelhoek convex is

source: Existence Test
ar: اختبار الوجود
de: Existenztest
ja: 存在テスト
nl: Test op bestaan

source: Test whether a given object is constructible
ar: اختبر ما إذا كان الكائن المعطى قابلا للإنشاء
de: Prüft, ob ein gegebenes Objekt konstruierbar ist
ja: 与えられたオブジェクトが作成可能かどうかをテスト
nl: Test of een gegeven object wel te construeren is

source: Distance Test
ar: اختبار المسافة
de: Abstandstest
ja: 距離テスト
nl: Afstandstest

source: Test whether a given point have the same distance from a given point and from another given point
ar: اختبر ما إذا كانت لنقطة معطاة نفس المسافة عن نقطتين معطاتين
de: Prüft, ob ein gegebener Punkt denselben Abstand von einem zweiten gegebenen Punkt hat wie von einem dritten gegebenen Punkt
ja: 与えられた点からの距離が、別の点からの距離と同じかどうかをテスト
nl: Testen of een gegeven punt even ver ligt van twee andere gegeven punten

source: Vector Equality Test
ar: اختبار تساوي المتّجهين
de: Vektorgleichheitstest
ja: ベクトル相等性テスト
nl: Vectorgelijkheidstest

source: Test whether two vectors are equal
ar: اختبر ما إذا كان المتّجهان متساويان
de: Überprüft, ob zwei Vektoren gleich sind
ja: 2 つのベクトルが等しいかどうかをテスト
nl: Testen of twee gegeven vectoren gelijk zijn aan elkaar

source: Point Projection
ar: إسقاط نقطة
de: Punktprojektion
nl: Projectie van punt

source: Project a point on a line
ar: أسقط نقطة على خطّ
de: Projiziert einen Punkt auf eine Linie
nl: Projecteer een punt op lijnstuk

source: Python Script
ar: سكربت بايثون
de: Python-Skript
ja: Python スクリプト

source: Construct a new Python script.
ar: أنشئ سكربت بايثون جديدًا.
de: Konstruiert ein neues Python-Skript
ja: 新しい Python スクリプトを作成
nl: Maken van een nieuwe Pythonscript.

source: Enter coordinates in the following format: "x;y", where x is the x coordinate, and y is the y coordinate.
ar: أدخل الإحداثيات بالشّكل: "x;y"، حيث x هو الإحداثي السّينيّ، وy هو الإحداثي الصّاديّ.
de: Geben Sie Koordinaten in der folgenden Form ein: „x;y“, wobei x die x-Koordinate und y die y-Koordinate ist.
ja: “x;y” の形式で座標を入力してください。 x は x 座標、y は y 座標です。
nl: Voer de coördinaten in in de vorm: "x;y", met x de x-coördinaat, en y de y-coördinaat.

source: Enter coordinates in the following format: <b>"x;y"</b>,<br />where x is the x coordinate, and y is the y coordinate.
ar: أدخل الإحداثيات بالشّكل: <b>"x;y"</b>،<br />حيث x هو الإحداثي السّينيّ، وy هو الإحداثي الصّاديّ.
de: Geben Sie Koordinaten in der folgenden Form ein: <b>„x;y“</b>,<br /> wobei x die x-Koordinate und y die y-Koordinate ist.
ja: <qt><b>“x;y”</b> の形式で座標を入力してください。<br />x は x 座標、y は y 座標です。</qt>
nl: Voer de coördinaten in in de vorm: <b>"x;y"</b>,<br />, met x de x-coördinaat, en y de y-coördinaat.

source: Enter coordinates in the following format: "r; θ°", where r and θ are the polar coordinates.
ar: أدخل الإحداثيات بالشّكل: "r; θ°"، حيث r وθ هما الإحداثيان القطبيّان.
de: Geben Sie die Koordinaten in der folgenden Form ein: „r;θ°“, wobei r und θ die Polarkoordinaten sind.
ja: “r; θ°” の形式で座標を入力してください。 r と θ は極座標です。
nl: Voer de coördinaten in in de vorm: "r; θ°", met r en θ de poolcoördinaten.

source: Enter coordinates in the following format: <b>"r; θ°"</b>,<br />where r and θ are the polar coordinates.
ar: أدخل الإحداثيات بالشّكل: <b>"r; θ°"</b>،<br />حيث r وθ هما الإحداثيان القطبيّان.
de: Geben Sie die Koordinaten in der folgenden Form ein: <b>„r;θ°“</b>,<br />wobei r und θ die Polarkoordinaten sind.
ja: <qt><b>“r; θ°”</b> の形式で座標を入力してください。<br />r と θ は極座標です。</qt>
nl: Voer de coördinaten in in de vorm: <b>"r; θ°"</b>,<br />met r en θ de poolcoördinaten.

source: &Euclidean
ar: إقليديّ
de: &Euklidisch
ja: 直交座標系(&E)
nl: Cart&esisch
