Repository: KDE/kig
Catalog: po/*/kig.po
Languages: ar, de, ja, nl

source: Helped a lot with the implementation of the Locus object, there's quite some math involved in doing it right, and Franco wrote the most difficult parts.
ar: ساعد كثيرًا في تنفيذ كائن المحل الهندسي، هناك قدر كبير من الرياضيات متضمنة في فعله بشكل صحيح، وكتب فرانكو الأجزاء الأكثر صعوبة.
de: Half bei der Implementation des Ort-Objektes, es steckt einige Mathematik darin und Franco hat im Prinzip die schwierigen Teile geschrieben.
ja: 軌跡オブジェクトの実装を大いに手伝ってくれた。正しく実装するにはかなりの数学が必要で、Franco がその最も難しい部分を書いた。
nl: Gaf heel wat hulp bij het implementeren van meetkundige plaatsen, er kwam nogal wat wiskunde bij kijken om het goed te krijgen, en Franco schreef de moeilijkste onderdelen hiervoor.

source: Francesca Gatti
ar: فرانشيسكا جاتي

source: Responsible for the computation of the algebraic equation of a locus.
ar: مسؤولة عن حساب المعادلة الجبرية للمحل الهندسي.
de: Verantwortlich für die Berechnung der Gleichung eines Geometrischen Ortes.
nl: Verantwoordelijk voor de bepaling van de vergelijking bij een meetkundige plaats.

source: Petr Gajdos
ar: بيتر غايدوس

source: Contributed the Bézier curves and related icons.
ar: ساهم بمنحنيات بيزييه والأيقونات ذات الصلة.
de: Steuerte die Bézierkurvenfunktion und die dazugehörigen Symbole bei.
nl: Verzorgde de Bézier krommen en de bijbehorende pictogrammen.

source: Raoul Bourquin
ar: راؤول بوركوين

source: Contributed the 'asymptote' export filter.
ar: ساهم بمرشح التصدير 'asymptote'.
de: Hat den Asymptoten-Exportfilter beigesteuert.
nl: Zorgde voor het filter voor 'asymptoot' exporteren

source: Eric Depagne
ar: إريك ديباني

source: The French translator, who also contributed some useful feedback, like feature requests and bug reports.
ar: المترجم الفرنسي، والذي ساهم أيضًا ببعض الملاحظات المفيدة، مثل طلبات الميزات وتقارير الأخطاء.
de: Der französische Übersetzer, der mir auch einige nützliche Tipps in Form von Funktionswünschen und Fehlerberichten gab.
nl: De Franse vertaler, die ook enige bruikbare terugkoppeling bijdroeg, zoals bepaalde functionaliteitsverzoeken en meldingen van programmafouten.

source: Marc Bartsch
ar: مارك بارتش

source: Author of KGeo, where I got inspiration, some source, and most of the artwork from.
ar: مؤلف KGeo، حيث حصلت على الإلهام، وبعض المصدر، ومعظم الأعمال الفنية منه.
de: Autor von KGeo, von dem ich die Inspiration, einigen Quellcode und große Teile der Optik übernommen habe
ja: KGeo の作者であり、ソースの一部と大部分のアートワークからインスピレーションをもたらしてくれた。
nl: Auteur van KGeo, dat als bron van inspiratie, enige programmacode en het meeste van het uiterlijk heeft gediend.

source: Christophe Devriese
ar: كريستوف ديفريز

source: Domi's brother, who he got to write the algorithm for calculating the center of the circle with three points given.
ar: أخ دومي، الذي جعله يكتب الخوارزمية لحساب مركز الدائرة بثلاث نقاط معطاة.
de: Domis Bruder, der den Algorithmus geschrieben hat, der den Mittelpunkt eines Kreises aus drei gegebenen Punkten berechnet.
ja: Domi の兄弟で、3 点が与えられた時に円の中心を計算するアルゴリズムを書いてくれた。
nl: Domi's broer, die het algoritme heeft geschreven voor het berekenen van het middelpunt van de cirkel als er drie punten zijn gegeven.

source: Christophe Prud'homme
ar: كريستوف برودوم

source: Contributed a patch for some bugs.
ar: ساهم برقعة لبعض الأخطاء.
de: Hat einige Fehler bereinigt.
nl: Droeg een reparatie ("patch") bij voor enkele programmafouten ("bugs").

source: Robert Gogolok
ar: روبرت جوغولوك

source: Contributed some good feedback on Kig, some feature requests, cleanups and style fixes, and someone to chat with on irc :)
ar: ساهم ببعض الملاحظات الجيدة على كيج، وبعض طلبات الميزات، وعمليات التنظيف وإصلاحات الأنماط، وشخص للتحدث معه على irc :)
de: Gab mir gute Rückmeldungen, einige Funktionswünsche, Bereinigungen und Designverbesserungen und war jemand, mit dem ich mich über IRC unterhalten konnte :)
nl: Droeg goede terugkoppeling bij op Kig, enkele functionaliteitsverzoeken, verbeteringen van de programmacode en was iemand waarmee via IRC gechat kon worden :)

source: David Vignoni
ar: ديفيد فيجنوني

source: Responsible for the nice application SVG Icon.
ar: مسؤول عن أيقونة تطبيق SVG الجميلة.
de: Verantwortlich für das schöne SVG-Symbol
ja: すてきな SVG アイコンを作ってくれた。
nl: Verantwoordelijk voor het fraaie SVG-pictogram van het programma.

source: Danny Allen
ar: داني ألين

source: Responsible for the new object action icons.
ar: مسؤول عن أيقونات إجراءات الكائنات الجديدة.
de: Verantwortlich für die neuen Objektaktionen-Symbole
ja: 新しいオブジェクト動作のアイコンを作ってくれた。
nl: Verantwoordelijk voor de nieuwe actiepictogrammen voor objecten.

source: Could not find the necessary Kig library, check your installation.
ar: تعذر العثور على مكتبة كيج الضرورية، تحقق من تثبيتك.
de: Die notwendige Kig-Bibliothek wurde nicht gefunden. Bitte überprüfen Sie Ihre Installation.
ja: 必要な Kig のライブラリが見つかりません。正しくインストールされているかをチェックしてください。
nl: Kon de benodigde Kig-bibliotheek niet vinden, controleer of Kig goed is geïnstalleerd.

# @title:window
source: Open File
ar: افتح ملفاً
de: Datei öffnen
nl: Bestand openen

source: Remove %1 Object
ar: أزل %1 كائن
de: %1 Objekt entfernen
ja: %1 個のオブジェクトを削除
nl: %1 Object verwijderen

source: Add %1 Object
ar: أضف %1 كائن
de: %1 Objekt hinzufügen
ja: %1 個のオブジェクトを追加
nl: %1 Object toevoegen

source: &Set Coordinate System
ar: ض&ع نظام الإحداثيات
de: Koordinatensystem &festlegen
ja: 座標系を設定(&S)
nl: Coördinaten&stelsel instellen

# @title:window
source: Kig Options
ar: خيارات كيج
de: Kig-Einstellungen
nl: Opties voor Kig

source: Show grid
ar: اعرض الشّبكة
de: Gitternetzlinien anzeigen
ja: グリッドを表示
nl: Raster tonen

source: Show axes
ar: أظهر المحاور
de: Achsen anzeigen
ja: 軸を表示
nl: Assen tonen

source: Invert Selection
ar: اعكس التّحديد
de: Auswahl umkehren
ja: 選択反転
nl: Selectie omkeren

source: &Delete Objects
ar: ا&حذف الكائنات
de: Objekte &löschen
ja: オブジェクトを削除|/|$[~setProps ~label '削除']
nl: Objecten &wissen

source: Delete the selected objects
ar: احذف الكائنات المختارة
de: Löscht die ausgewählten Objekte
ja: 選択したオブジェクトを削除
nl: De geselecteerde objecten wissen

source: Cancel Construction
ar: ألغِ الإنشَاء
de: Konstruktion abbrechen
ja: 作成をキャンセル|/|$[~setProps ~label 'キャンセル']
nl: Tekenen annuleren

source: Cancel the construction of the object being constructed
ar: ألغِ إنشَاء الكائن الذي يجري إنشاؤه
de: Bricht die Konstruktion des gerade in Konstruktion befindlichen Objektes ab
ja: 作成途中のオブジェクトの作成をキャンセル
nl: Annuleer het tekenen van het huidige object

source: Repeat Construction
ar: كرّر الإنشَاء
de: Konstruktion wiederholen
ja: 作成を繰り返し|/|$[~setProps ~label '繰り返し']
nl: Constructie nog eens toepassen

source: Repeat the last construction (with new data)
ar: كرّر الإنشَاء الأخير (ببيانات جديدة)
de: Letzte Konstruktion (mit neuen Daten) wiederholen
ja: 最後の作成を繰り返し (新しいデータで)
nl: Herhaal de laatste constructie (met nieuwe gegevens)

source: U&nhide All
ar: أ&ظهِر الكل
de: &Alle zeigen
ja: すべて表示(&U)
nl: &Alles tonen

source: Show all hidden objects
ar: أظهِر كل الكائنات المخفية
de: Alle ausgeblendeten Objekte anzeigen
ja: すべての隠しオブジェクトを表示
nl: Toon alle verborgen objecten

source: &New Macro...
ar: &ماكرو جديد...
de: &Neues Makro ...
ja: 新しいマクロ(&N)...
nl: &Nieuwe macro...

source: Define a new macro
ar: عرّف ماكرو جديدًا
de: Ein neues Makro definieren
ja: 新しいマクロを定義
nl: Maak een nieuwe macro

source: Manage &Types...
ar: أدِر الأ&نواع...
de: &Typen verwalten ...
ja: タイプの管理(&T)...
nl: &Typen beheren...

source: Manage macro types.
ar: أدر أنواع الماكرو.
de: Makrotypen verwalten.
ja: マクロタイプの管理を行います。
nl: Macrotypen beheren.

source: &Browse History...
ar: &تصفّح السجل...
de: &Verlauf anzeigen ...
ja: 履歴をブラウズ(&B)...
nl: &Geschiedenis doorzoeken...

source: Browse the history of the current construction.
ar: تصفّح سجل الإنشَاء الحالي.
de: Verlauf der aktuellen Konstruktion anzeigen.
ja: 現在の作成の履歴を閲覧します。
nl: Doorzoek de geschiedenis van de huidige constructie.

source: Zoom in on the document
ar: قرّب في المستند
de: Das Dokument vergrößern
ja: 文書のズームイン
nl: Inzoomen in het document

source: Zoom out of the document
ar: بعّد من المستند
de: Das Dokument verkleinern
ja: 文書のズームアウト
nl: Uitzoomen in het document

source: Recenter the screen on the document
ar: أعد توسيط الشاشة على المستند
de: Ansicht auf Seite anpassen
ja: ビューを文書に合わせる
nl: Opnieuw centreren op het document

source: View this document full-screen.
ar: اعرض هذا المستند بملء الشاشة.
de: Dieses Dokument auf dem vollen Bildschirm anzeigen.
ja: この文書をフルスクリーン表示
nl: Dit document in het volledige scherm weergeven.

source: &Select Shown Area
ar: ا&ختر المنطقة المعروضة
de: Bereich vergrößert dar&stellen
ja: 表示領域を選択(&S)
nl: &Selecteer zichtbaar gebied

source: Select the area that you want to be shown in the window.
ar: اختر المنطقة التي تريد عرضها في النافذة.
de: Wählen Sie mit der Maus den Bereich aus, der im Fenster angezeigt werden soll.
ja: 表示領域を選択範囲に合わせる
nl: Selecteer het gebied dat u wilt zien in het scherm.

source: S&elect Zoom Area
ar: ا&ختر منطقة التكبير
de: Vergrößerungsbereich auswähl&en
ja: 表示領域を座標で指定(&E)
nl: S&electeer zoomgebied

source: Set Coordinate &Precision...
ar: ض&ع دقة الإحداثيات...
de: Koordinatengenauigkeit &einstellen ...
nl: De &precisie van coördinaten instellen...

source: Set the floating point precision of coordinates in the document.
ar: ضع دقة النقطة العائمة للإحداثيات في المستند.
de: Bestimmt die Fließkommazahl-Genauigkeit der Koordinaten im Dokument.
nl: De drijvende-komma-precisie van coördinaten in het document instellen.

source: Show &Grid
ar: اعرض ال&شبكة
de: &Gitternetzlinien anzeigen
ja: グリッドを表示(&G)
nl: &Raster tonen

source: Show or hide the grid.
ar: اعرض أو اخفِ الشبكة.
de: Zeigt die Gitternetzlinien an oder blendet sie aus.
ja: グリッドの表示/非表示を切り替え
nl: Toon of verberg het rooster.

source: Show &Axes
ar: أ&ظهر المحاور
de: &Achsen anzeigen
ja: 軸を表示(&A)
nl: &Assen tonen

source: Show or hide the axes.
ar: أظهِر أو اخفِ المحاور.
de: Achsen ein- bzw. ausblenden
ja: 軸の表示/非表示を切り替え
nl: Toon of verberg het assenstelsel.

source: Wear Infrared Glasses
ar: ارتدِ نظارات الأشعة تحت الحمراء
de: Nachtsichtmodus
ja: 赤外線鏡を装着(&W)
nl: Infrarode bril

source: Enable/disable hidden objects' visibility.
ar: فعّل/عطّل رؤية الكائنات المخفية.
de: Ausgeblendete Objekte sichtbar machen/ausblenden.
ja: 隠れたオブジェクトの可視性を有効/無効にします。
nl: Aan/uitzetten zichtbaarheid verborgen objecten.

source: Repeat Construction (%1)
ar: كرّر الإنشَاء (%1)
de: Konstruktion wiederholen (%1)
ja: 作成を繰り返し (%1)
nl: Herhaal constructie (%1)

source: Repeat %1 (with new data)
ar: كرّر %1 (ببيانات جديدة)
de: %1 wiederholen (mit neuen Daten)
ja: 繰り返し %1 (新しいデータで)
nl: Herhaal %1 (met nieuwe gegevens)

source: The file "%1" you tried to open does not exist. Please verify that you entered the correct path.
ar: الملف "%1" الذي حاولت فتحه غير موجود. يرجى التحقق من أنك أدخلت المسار الصحيح.
de: Die Datei „%1“, die Sie öffnen wollten, existiert nicht. Bitte überprüfen Sie, ob Sie den richtigen Pfad eingegeben haben.
ja: あなたが開こうとしているファイル ‘%1’ は存在しません。正しいパスを入力しているか確認してください。
nl: Het bestand "%1" dat u wilt openen bestaat niet. Controleer of het juiste pad is ingevoerd.

source: File Not Found
ar: لم يوجد الملفّ
de: Datei nicht gefunden
ja: ファイルが見つかりません
nl: Bestand niet gevonden

source: You tried to open a document of type "%1"; unfortunately, Kig does not support this format. If you think the format in question would be worth implementing support for, you can open a feature request in <a href="https://bugs.kde.org/enter_bug.cgi?product=kig&bug_severity=wishlist">KDE's bug tracking system</a>
ar: حاولت فتح مستند من النوع "%1"؛ للأسف، كيج لا يدعم هذه الصيغة. إذا كنت تعتقد أن الصيغة المعنية تستحق تنفيذ دعم لها، يمكنك فتح طلب ميزة في <a href="https://bugs.kde.org/enter_bug.cgi?product=كيج&bug_severity=wishlist">نظام تتبع أخطاء كيدي</a>
de: Sie haben versucht ein Dokument des Typs „%1“ zu öffnen. Kig unterstützt dieses Format nicht. Möchten Sie dieses Format implementiert haben, wenden Sie sich bitte mit diesem Wunsch an das <a href="http://bugs.kde.org/">KDE-Fehlerverfolgungs-System</a>.
nl: Het document dat u probeert te openen is van het type "%1". Dit formaat wordt helaas niet door Kig ondersteund. Als u vindt dat dit formaat de moeite waard is de ondersteuning ervan te implementeren, kunt u daartoe een verzoek daartoe doen in het <a href="https://bugs.kde.org/enter_bug.cgi?product=kig&bug_severity=wishlist">"bug tracking" systeem van KDE</a>

source: Format Not Supported
ar: الصيغة غير متاحة
de: Format nicht unterstützt
ja: サポートしていません
nl: Formaat niet ondersteund

source: Kig does not support saving to any other file format than its own. Save to Kig's format instead?
ar: لا يتيح كيج الحفظ في أي صيغة ملف أخرى غير صيغته الخاصة. هل تريد الحفظ بصيغة كيج بدلاً من ذلك؟
de: Kig kann nicht in ein anderes Dateiformat speichern als in das eigene. Möchten Sie im Kig-Format speichern?
ja: Kig は他のファイルフォーマットで保存することをサポートしていません。Kig のフォーマットで保存しますか？
nl: Kig kan alleen maar documenten opslaan in het eigen bestandsformaat. Als Kig-bestand opslaan?

source: Save Kig Format
ar: احفظ بصيغة كيج
de: Kig-Format speichern
ja: Kig のフォーマットで保存
nl: Bewaren als Kig-bestand

source: Kig Documents (*.kig);;Compressed Kig Documents (*.kigz)
ar: مستندات كيج (*.كيج);;مستندات كيج مضغوطة (*.كيجz)
de: Kig-Dokument (*.kig);;Komprimiertes Kig-Dokument (*.kigz)
nl: Kig documenten (*.kig);;Gecomprimeerde Kig documenten (*.kigz)

source: The file "%1" already exists. Do you wish to overwrite it?
ar: الملفّ ”%1“ موجود فعلًا. أتريد الكتابة فوقه؟
de: Die Datei „%1“ existiert bereits. Möchten Sie sie überschreiben?
ja: ファイル ‘%1’ は既に存在します。上書きしますか？
nl: Het bestand "%1" bestaat al. Wilt u het overschrijven?

source: Overwrite File?
ar: أأكتب فوق الملفّ؟
de: Datei überschreiben?
ja: ファイルを上書きしますか？
nl: Bestand overschrijven?

# @title:window
source: Print Geometry
ar: اطبع الهندسة
de: Geometrie drucken
nl: Afdrukafmetingen

source: Hide %1 Object
ar: لا تخفي أي كائن
de: Ein Objekt ausblenden
ja: %1 個のオブジェクトを隠す
nl: %1 object verbergen

source: Show %1 Object
ar: أظهِر %1 كائن
de: %1 Objekt anzeigen
ja: %1 個のオブジェクトを表示
nl: %1 object tonen

source: Zoom In
ar: قرّب
de: Vergrößern
ja: ズームイン
nl: Inzoomen

source: Zoom Out
ar: بعّد
de: Verkleinern
ja: ズームアウト
nl: Uitzoomen

source: Recenter View
ar: أعد توسيط العرض
de: Ansicht zentrieren
ja: 文書に合わせる
nl: Scherm opnieuw centreren

source: Select the rectangle that should be shown.
ar: اختر المستطيل الذي ينبغي عرضه.
de: Wählen Sie das Rechteck, das angezeigt werden soll.
ja: 表示する領域をドラッグして選択してください。
nl: Selecteer rechthoekig gebied dat zichtbaar moet zijn.

source: Change Shown Part of Screen
ar: غيّر الجزء المعروض من الشاشة
de: Den angezeigten Teil des Bildschirms verändern
ja: スクリーンの表示部分を変更
nl: Verander het getoonde deel van het schermbeeld

source: Select Zoom Area
ar: اختر منطقة التكبير
de: Anzeigebereich einstellen
ja: 表示領域を座標で指定
nl: Selecteer zoomgebied

source: Select the zoom area by entering the coordinates<br />of the upper left corner and the lower right corner.
ar: اختر منطقة التكبير عن طريق إدخال إحداثيات<br />الزاوية العلوية اليسرى والزاوية السفلية اليمنى.
de: Wählen Sie einen Anzeigebereich, indem Sie die Koordinaten<br /> der oberen linken Ecke und der unteren rechten Ecke eingeben.
ja: 左上隅と右下隅の座標を入力して表示領域を指定します。
nl: Selecteer het zoomgebied door de coördinaten<br /> van de hoek links boven en de hoek rechts onder in te voeren.

source: &File
ar: &ملف
de: &Datei
ja: ファイル(&F)
nl: &Bestand

source: &Edit
ar: &حرّر
de: &Bearbeiten
ja: 編集(&E)
nl: B&ewerken

source: &View
ar: &عرض
de: &Ansicht
ja: 表示(&V)
nl: Bee&ld

source: &Objects
ar: &كائنات
de: &Objekte
ja: オブジェクト(&O)
nl: &Objecten

source: &Points
ar: &نقاط
de: &Punkte
ja: 点(&P)
nl: &Punten

source: &Lines
ar: &سطور
de: &Linien
ja: 直線(&L)
nl: &Lijnen

source: &Circles && Arcs
ar: &دوائر وأقواس
de: K&reise && Kreisbögen
ja: 円＆弧(&C)
nl: &Cirkels && cirkelbogen

source: Poly&gons
ar: &مضلعات
de: Poly&gone
ja: 多角形(&G)
nl: Veelhoeke&n

source: &Vectors && Segments
ar: م&تجهات وقطع
de: &Vektoren && Strecken
ja: ベクトル＆線分(&V)
nl: &Vectoren && lijnstukken

source: Co&nics && Cubics
ar: م&خروطات وتكعيبات
de: Kegelschnitte && Kubische Funktionen
ja: 二次曲線＆三次曲線(&N)
nl: Kegels&neden && derdegraads krommen

source: More Conics
ar: مخروطات أكثر
de: Weitere Kegelschnitte
ja: その他の二次曲線
nl: Meer kegelsneden

source: Cu&bics
ar: م&كعَبات
de: Ku&bische Funktionen
ja: 三次曲線(&B)
nl: &Derdegraads krommen

source: &Bézier curves
ar: منحنيات &بيزييه
de: &Bézierkurven
nl: &Bézier krommen

source: &Angles
ar: &زوايا
de: Win&kel
ja: 角(&A)
nl: H&oeken

source: &Transformations
ar: &تحويلات
de: &Transformationen
ja: 変換(&T)
nl: &Transformaties

source: &Differential geometry
ar: &هندسة تفاضلية
de: &Differentialgeometrie
ja: 微分幾何(&D)
nl: &Differentiaalmeetkunde

source: T&ests
ar: الا&ختبارات
ja: テスト(&E)

source: &Other
ar: أ&خرى
de: &Weitere
ja: その他(&O)
nl: &Andere

source: &Types
ar: ال&فئات
de: &Typen
ja: タイプ(&Y)
nl: &Typen

source: &Tools
ar: أ&دوات
de: E&xtras
ja: ツール(&T)
nl: &Hulpmiddelen

source: Main Toolbar
ar: شريط الأدوات الرئيس
de: Haupt-Werkzeugleiste
ja: メインツールバー
nl: Hoofdwerkbalk

source: Points
ar: نقاط
de: Punkte
ja: 点
nl: Punten

source: Lines
ar: سطور
de: Linien
ja: 直線
nl: Lijnen

source: Vectors && Segments
ar: متجهات وقطع
de: Vektoren && Strecken
ja: ベクトル＆線分
nl: Vectoren && lijnstukken

source: Circles && Arcs
ar: دوائر وأقواس
de: Kreise && Kreisbögen
ja: 円＆弧
nl: Cirkels && cirkelbogen

source: Conics
ar: مخروطات
de: Kegelschnitte
ja: 二次曲線
nl: Kegelsneden

source: Bézier Curves
ar: منحنيات بيزييه
de: Bézierkurven
ja: ベジエ曲線
nl: Bezier krommen

source: Angles
ar: زوايا
de: Winkel
ja: 角
nl: Hoeken

source: Transformations
ar: التحويلات
de: Transformationen
ja: 変換
nl: Transformaties

source: Tests
ar: الاختبارات
ja: テスト

source: Other Objects
ar: كائنات أخرى
de: Andere Objekte
ja: その他のオブジェクト
nl: Andere objecten

source: View
ar: اعرض
de: Ansicht
ja: 表示
nl: Beeld

source: &Settings
ar: إ&عدادات
de: &Einstellungen
ja: 設定(&S)
nl: &Instellingen

source: Do not show a GUI. Convert the specified file to the native Kig format. Output goes to stdout unless --outfile is specified.
ar: لا تعرض واجهة مستخدم رسومية. حوّل الملف المحدد إلى صيغة كيج الأصلية. يذهب المخرج إلى stdout ما لم يحدد --outfile.
de: Keine Oberfläche anzeigen. Konvertiert die angegebene Datei in das native Kig-Format. Die Ausgabe wird auf die Standardausgabe geschrieben, wenn nicht --outfile angegeben wurde.
ja: GUI を表示しません。指定したファイルを Kig のネイティブフォーマットに変換します。--outfile を指定しない限り、標準出力に出力されます。
nl: Toon geen GUI (Grafische interface). Vertaal het opgegeven bestand naar het Kig-formaat. Uitvoer gaat naar stdout behalve als u --outfile (dat is: uitvoerbestand) heeft opgegeven.

source: File to output the created native file to. '-' means output to stdout. Default is stdout as well.
ar: الملف الذي تريد إخراج الملف الأصلي الذي أنشئ فيه. '-' يعني الإخراج إلى stdout. الافتراضي هو stdout أيضًا.
de: Datei, die als Ausgabe dient. „-“ bedeutet die Standardausgabe, das ist aber auch der Normalfall.
ja: 作成したネイティブファイルを出力するファイル。“-” は標準出力への出力を意味します。デフォルトも標準出力です。
nl: Bestand waar het in het programma gemaakte bestand in moet worden opgeslagen. '-' betekent uitvoeren naar stdout. Standaard is ook stdout.

source: Document to open
ar: المستند لفتحه
de: Zu öffnendes Dokument
ja: 開く文書
nl: Te openen document

source: Point by Numeric Labels
ar: نقطة بوسم عددي
de: Punkt mittels numerischer Felder
ja: 数値ラベルによる点
nl: Punt met coördinaten

source: A point whose coordinates are given by two numeric labels
ar: نقطة حُددَت إحداثياتها بوسمين عدديين
de: Ein Punkt, dessen Koordinaten durch zwei numerische Felder angegeben sind.
ja: 2 つの数値ラベルで座標が与えられる点
nl: Een punt met twee getallen als coördinaten

source: Segment
ar: قطعة
de: Strecke
ja: 線分
nl: Lijnstuk

source: A segment constructed from its start and end point
ar: قطعة إنشِئَت من نقطتي بدايتها ونهايتها
de: Eine Strecke konstruiert mittels ihres Start- und ihres Endpunktes
ja: 始点と終点から作られる線分
nl: Een lijnstuk met gegeven begin- en eindpunt

source: Segment Axis
ar: محور قطعة
de: Mittelsenkrechte
ja: 線分軸
nl: Middelloodlijn

source: The perpendicular line through a given segment's mid point.
ar: الخط العمودي على نقطة المنتصف لقطعة معطاة.
de: Die Senkrechte, die durch den Mittelpunkt dieser Strecke geht.
ja: 与えられた線分の垂直二等分線
nl: De lijn loodrecht door het midden van een gegeven lijnstuk.

source: Line by Two Points
ar: خط بنقطتين
de: Gerade durch zwei Punkte
ja: 2 点による直線
nl: Lijn door twee punten

source: A line constructed through two points
ar: خط أنشِئَ من خلال نقطتين
de: Eine Gerade konstruiert mittels zweier Punkte
ja: 2 点を通って作られる直線
nl: Een lijn door twee gegeven punten

source: Half-Line
ar: نصف خط
de: Strahl
ja: 半直線
nl: Halve rechte lijn

source: A half-line by its start point, and another point somewhere on it.
ar: نصف خط بنقطة بدايته، ونقطة أخرى تقع عليه.
de: Ein Strahl durch seinen Startpunkt und einen anderen Punkt.
ja: 始点と 1 つの通過点による半直線
nl: Een halve rechte lijn met gegeven beginpunt, en door een gegeven punt.

source: Perpendicular
ar: تعامد
de: Senkrechte
ja: 垂線
nl: Loodrechte lijn

source: A line constructed through a point, perpendicular to another line or segment.
ar: خط أنشِئَ من خلال نقطة، عمودي على خط آخر أو قطعة أخرى.
de: Eine Gerade, die durch einen Punkt konstruiert wird und rechtwinklig zu einer anderen Geraden oder Strecke steht.
ja: 1 点を通り、他の直線または線分に垂直な直線
nl: Een lijn door een gegeven punt, loodrecht op een andere gegeven lijn of lijnstuk.

source: Parallel
ar: متوازٍ
de: Parallele
ja: 平行線
nl: Evenwijdige lijn

source: A line constructed through a point, and parallel to another line or segment
ar: خط أنشِئَ من خلال نقطة، وموازٍ لخط آخر أو قطعة أخرى
de: Eine Gerade konstruiert durch einen Punkt, die parallel zu einer anderen Gerade oder Strecke verläuft
ja: 1 点を通り、他の直線または線分に平行な直線
nl: Een lijn door een gegeven punt en evenwijdig aan een gegeven andere lijn of lijnstuk

source: Circle by Center && Point
ar: دائرة بمركز ونقطة
de: Kreis durch Mittelpunkt && Punkt
ja: 中心と点による円
nl: Cirkel met middelpunt && punt

source: A circle constructed by its center and a point that pertains to it
ar: دائرة إنشِئَت بمركزها ونقطة تنتمي إليها
de: Ein Kreis konstruiert durch seinen Mittelpunkt und einen Punkt, der zu ihm gehört
ja: 中心と内包点で作られる円
nl: Een cirkel met gegeven middelpunt en een gegeven punt op de omtrek

source: Circle by Three Points
ar: دائرة بثلاث نقاط
de: Kreis durch drei Punkte
ja: 3 点による円
nl: Cirkel met drie punten

source: A circle constructed through three points
ar: دائرة إنشِئَت من خلال ثلاث نقاط
de: Ein Kreis konstruiert durch drei Punkte
ja: 3 点を通って作られる円
nl: Een cirkel door drie punten

source: Circle by Point && Radius
ar: دائرة بنقطة ونصف قطر
de: Kreis durch Punkt und Radius
ja: 点と半径による円
nl: Cirkel met punt && straal

source: A circle defined by its center and the length of the radius
ar: دائرة حُدِّدَت بمركزها وطول نصف القطر
de: Ein Kreis, der durch seinen Mittelpunkt und die Länge seines Radius bestimmt wird.
ja: 中心と半径の長さで定義される円
nl: Een cirkel met gegeven middelpunt en de grootte van de straal

source: Construct Bisector of This Angle
ar: أنشِئ منصف هذه الزاوية
de: Die Winkelhalbierende dieses Winkels konstruieren
ja: この角の二等分線を作成
nl: Teken de bissectrice van deze hoek

source: Select the angle you want to construct the bisector of...
ar: اختر الزاوية التي تريد أن تنشئ منصفها...
de: Wählen Sie den Winkel, von dem Sie die Winkelhalbierende konstruieren möchten.
ja: 二等分線を作成する角を選択...
nl: Selecteer de hoek waarvan u de bissectrice wilt tekenen...

source: Angle Bisector
ar: منصف زاوية
de: Winkelhalbierende
ja: 角の二等分線
nl: Bissectrice

source: The bisector of an angle
ar: منصف زاوية
de: Die Winkelhalbierende eines Winkels
ja: 角の二等分線
nl: De bissectrice van een hoek

source: Conic by Five Points
ar: مخروط بخمس نقاط
de: Kegelschnitt durch fünf Punkte
ja: 5 点による二次曲線
nl: Kegelsnede door vijf punten

source: A conic constructed through five points
ar: مخروط أنشِئَ من خلال خمس نقاط
de: Ein Kegelschnitt konstruiert mittels fünf Punkten
ja: 5 点を通って作られる二次曲線
nl: Een kegelsnede door vijf punten
